{
  "total_articles": 40,
  "scraped_at": "2025-11-16T03:52:07.146661",
  "articles": [
    {
      "title": "What Moldova's twin vote means for its EU future and Russia's grip",
      "content": [
        "With both Moldova and Georgia heading to the polls, concerns are high in Brussels that either of them could slip into Russia’s orbit.",
        "Welcometo Euractiv’s Global Europe Brief, your weekly update on the EU from a global perspective. You can subscribe to receive our newsletterhere.",
        "Good Sunday morning from Chișinău!",
        "Across the country, Moldovans are going to the polls today in a vote that isseen as a choice between a European future or a return to Moscow’s sphere of influence.",
        "While EU support in the country with fewer than 3 million people is as high as ever, Russian-backed campaigns have focused on demobilising voters.",
        "WHAT IS AT STAKE? |Moldovan voters are asked to make two crucial decisions this Sunday: whether to re-elect incumbent, staunchly pro-EU President Maia Sandu and whether the country should anchor its European path in the constitution.",
        "Over the past months, Sandu, a former World Bank president, has led a primarily domestic ‘bread-and-butter’ campaign with less emphasis on geopolitical tensions in order not to give room to disinformation attempts.",
        "Although both votes are separate, together, they are seen as a choice between a European future or a return to Moscow’s sphere of influence.",
        "As Moldova faces a decisive presidential election and an EU referendum on Sunday (20 October)…",
        "The referendum, for which 12 parties support the “YES” option and two the “NO” option, is meant to determine whether accession to the bloc will be added to the country’s constitution as a strategic goal.",
        "Sunday’s polls are seen as a significant test before the country’s parliamentary elections next year, which could prove decisive for the speed of Moldova’s EU integration.",
        "WHAT DO THE POLLS SAY? |The latest polls tip Sandu to win in the first round of the presidential polls. But if she does not reach more than 50% of the vote, a run-off will be staged between the two leading candidates on 3 November.",
        "Analysts predict she could face a more difficult second-round runoff against Moscow-friendly Alexandr Stoianoglo, a former prosecutor general who was dismissed by Sandu and is polling at 10%.",
        "Support for the “YES” side in the referendum, meanwhile, is up to 65%, but a minimum turnout of 33% – around 940.000 voters – is needed for the referendum to be considered valid.",
        "While Moldova’s left-leaning parties, which have historically been pro-Russian, still reach around 40% support, they have struggled to command the same sway after Moscow’s invasion of neighbouring Ukraine.",
        "Moldova’s Central Election Commission said people will be able to cast their ballot at 2,221 polling stations, with 1,957 located across the country and 234 installed for Moldovan citizens voting abroad. Voters who live in Transnistria and have Moldovan passports will be able to access30 polling stationson the Moldovan side of the border, within the perimeter of the security zone.",
        "SPECTRE OF DISINFORMATION |In recent months, Moldovan authorities have flagged an uptick in coordinated disinformation campaigns and vote-buying orchestrated by Russia and its proxies in the country, designed to sway or suppress the vote.",
        "Pro-Russian oligarch Ilan Shor, who has been sanctioned by the West for spearheading the Kremlin’s operations in Moldova, haspublicly offeredmoney for votes against EU integration.",
        "Earlier this month, Chișinău warned that some €15 million in Russian funds had been distributed directly to around 130,000 Moldovans in a bid to buy their anti-EU votes.",
        "The few elections Shor’s movement has won in the past — such as regional votes in Gagauzia and Orhei — came with accusations of widespreadvote-buying.",
        "At the same time, Moldovan officials believe Moscow isbehind plansto train hundreds of its citizens in Russia to stage civil unrest in Moldova during or after the elections.",
        "Moldovan authorities had warned that Russia’s playbook in their country could be used elsewhere in the future, should it be successful.",
        "WHY DOES IT MATTER FOR EU? |It’s all about the bigger picture.",
        "As Moldova – and Georgia a week later – head to the polls over two respective weekends with their EU aspirations on the ballot, European officials and diplomats are concerned either of them could slip into Russia’s orbit after these elections.",
        "It would be a major setback for the EU and wider Western interests in Europe’s near neighbourhood, especially after enlargement has been declared a top priority after Russia’s invasion of Ukraine in 2022.",
        "Georgians will vote next Saturday (26 October) in watershed parliamentary elections, with a first-ever union of all pro-Western opposition forces facing off against the country’s Georgian Dream ruling party accused of democratic backsliding and increasingly shifting towards Russia.",
        "Brussels has warned that the vote would be crucial for Tbilisi’s path towards EU membership – and Georgia’s future seems more uncertain than that of Moldova.",
        "More pro-Russian governments in one or both countries could also encourage Vladimir Putin to repeat his interference playbook in EU member states.",
        "European Commission President Ursula von der Leyen’s visit to Moldovalast weekwas seen as welcome support by Sandu, but the trip was kept low-key to avoid accusations of election interference, sources said.",
        "The EU’s executive has also deliberately moved the presentation of the EU’s enlargement package to after both elections, towards the last week of October, to avoid it being instrumentalised in the polls, according to people familiar with the matter.",
        "ISRAEL TALKS |EU leaders this week reiterated their calls for de-escalation in the Middle East, with some voicing hope the recent killing of Hamas’ leader Yahya Sinwar could be an off-ramp for ceasefire talks – and they seemed to converge on the fact that Israel’s attitude was becoming“less and less acceptable”.",
        "With the EU struggling to address Israel’s possible violations of international humanitarian law, next month’s foreign ministers’ talks could see a discussion of what to do abouttrade ties with Tel Aviv.",
        "GULF TIES |For the first time, the EU and the six Gulf Cooperation Council (GCC) leadersmetthis week in Brussels in talks that will be overshadowed by escalating tensions in the Middle East. But while both sides agreed to revive long-stalled trade talks, but disagreements on how to word itprevailed.",
        "Strengthening ties with the Gulf region will be vital in countering the growing Russia-Iran alliance and handling the Middle East crises, the EU’s Special Representative for the Gulf region, Luigi Di Maio,told Euractivahead of the talks.",
        "IRAN SANCTIONS |EU member states this week alsobacked a sanctions packageagainst seven high-ranking Iranian officials and seven entities in response to Tehran’s transfer of military equipment to Russia.",
        "NATO INVITE IAs Ukraine’s President Volodymyr Zelenskyy pitchedhis ‘victory’ planto European leaders this week, an invitation to join NATO is emerging as a key ask by Kyiv. However, so far, none of the big key Western countries has publicly thrown its support behind a swift NATO invitation, which is one of the core aspects of Kyiv’s pitch.",
        "NATO should not wait with its invitation, andthe country’s backers should “implement in full what was promised” in terms of aid deliveries, Ukraine’s NATO envoy Nataliia GalibarenkotoldEuractiv.",
        "As Ukraine braces for another harsh winter, the urgency of air defence and ammunition supplies remains critical, but military aid discussions are increasingly taking placeout of the spotlight.",
        "G7 GOES DEFENCE IG7 defence ministersdoubled downon calls for respect for international law in their inaugural meeting this weekend, a few days before BRICS members meet in Russia.",
        "KUBILIUS’ PLANS IThe future EU defence commissioner aims to align with NATO on key security priorities, Andrius Kubilius told Euractiv in person this week. Read thefull interview here.",
        "HALFWAY THERE INATO membersspent€20 billion in the first half of 2024 on military aid to Ukraine – they are halfway towards meeting their annual target with only three more months to go.",
        "EU-UK TIES |UK’s Foreign Secretary David Lammy attended talks with EU counterparts for the first time in two years as London looks to “reset” relations with the bloc after Brexit and potentially sign abilateral security pactin the near future.",
        "DUAL-USE WOES IIn a mid-term evaluation of the EU innovation programme, expertssay the European Commissionshould avoid classifying projects as “dual-use”, as all technologies can now have a military component, and keep Horizon Europe for all non-purely military projects.",
        "INFRASTRUCTURE MOVES |Germany and NorwaypressNATO allies to divide responsibility for underwater infrastructure protection. Finland and Norway, meanwhile, plan to improve rail and road linksbetween the countries for military use.",
        "WHAT ELSE WE’RE READING",
        "ON OUR RADAR NEXT WEEK",
        "[Edited by Owen Morgan]"
      ],
      "url": "https://www.euractiv.com/news/what-moldovas-twin-vote-means-for-its-eu-future-and-russias-grip/",
      "scraped_at": "2025-11-16T03:51:48.689826",
      "paragraph_count": 47
    },
    {
      "title": "Moldova eyes energy lever to topple Kremlin puppet regime in Transnistria",
      "content": [
        "For the first time, Moldova can cut an energy link to its breakaway territory. Yet doing so risks Moscow’s threats and a possible humanitarian crisis.\r\n\r\nCopy Link\r\nFree article usually reserved for subscribers\r\nMOLDOVA-INDUSTRY-ENERGY\r\nBrussels has offered Moldova millions of euros and more links to its energy supplies as part of a yearslong process to get the country ready for EU membership. | Daniel Mihailescu/AFP via Getty Images\r\nApril 29, 2024 4:00 am CET\r\nBy Gabriel Gavin\r\nCHIȘINĂU — For the first time in three decades, Moldova thinks it finally has the leverage to kick Russia out of the country. \r\n\r\nBut it comes with a quandary: how to do that without unleashing a humanitarian crisis on its own citizens.\r\n\r\nSince gaining independence in the 1990s, Moldova has been locked in a frozen conflict with Moscow over Transnistria, a Kremlin-backed separatist region near Moldova’s eastern border with over a quarter of a million people. \r\n\r\nThe face-off has been tense, but maintained by a powerful connection: Moldova gets cut-rate Russian energy via Transnistria, which gets hundreds of millions of euros a year in return. The link allowed Russia to preserve control over the strategic strip of land along the Ukrainian border, where its troops are stationed despite Moldova’s objections.\r\n\r\nThat dynamic is changing, however. Moldova in recent years has integrated with Europe under pro-EU President Maia Sandu. Brussels has offered millions of euros and more links to its energy supplies as part of a yearslong process to get the country, one of Europe’s poorest nations, ready for EU membership.\r\n\r\n“Moldova is no longer dependent on Transnistria,” Moldovan Foreign Minister Mihai Popșoi told POLITICO. “When it comes to gas, we buy gas on the international market. On the electricity side, we are building high-voltage lines to connect ourselves to Romania.”\r\n\r\nThe switch is a problem for Transnistria, but also for the Moldovan government. Stopping payments to Transnistria would collapse the separatist state’s budget and leave hundreds of thousands of people there without incomes and basic services — a challenge that, for a country Moldova’s size, would be akin to the reunification of Germany following the fall of the Berlin Wall.\r\n\r\n“The elites in Transnistria acknowledge already that we buy electricity from the region not because we have to but because the alternative is to throw the region into a humanitarian crisis,” Moldovan Energy Minister Victor Parlicov said in an interview.\r\n\r\nStill, officials are unequivocal: It’s time to end the multi-generational deadlock.\r\n\r\n“There is a strong incentive now for us to reintegrate the country peacefully,” said Popșoi, who was appointed foreign minister in January. “Solving the conflict means full reintegration and Moldova taking control of its sovereign borders.”\r\n\r\nPower play\r\nFrom the bridge over the river Dniester, you can see the Russian soldiers. Wearing camouflage uniforms, they huddle together against the rain at a checkpoint emblazoned with the Soviet hammer and sickle.\r\n\r\nThese are just a few of the 1,500 Russian troops keeping Transnistria under Moscow’s thumb, more than 30 years after Moldova gained independence from the USSR.\r\n\r\nOver the years, Transnistria has developed its own armed forces, public services and pension schemes — all funded through marked-up sales of cheap Russian energy to Moldova.\r\n\r\n“The entire region is dependent on free gas like it’s drugs,” said Parlicov, the energy minister, speaking from the imposing government building in Chișinău’s central square.\r\n\r\nMoldova, too, has been hooked on the discount energy. The Russian-owned Cuciurgan power plant in Transnistria is Moldova’s largest energy source, supplying around four-fifths of the country’s power in exchange for hundreds of millions of euros a year. Moldova also relies on high-voltage cables running through Transnistria, giving the region — and its Russian partners — even more leverage.\r\n\r\n“The beauty of it for the Russians was that by buying electricity from the Transnistrian region, we were basically financing the separatism in our own country,” Parlicov said.\r\n\r\nThe EU has changed that calculus. In recent years, Brussels has given Moldova tens of millions of euros to build infrastructure and cement its connection to European energy networks, offsetting the costs of buying supplies from elsewhere.\r\n\r\nThat means Moldova doesn’t have to buy Transnistria’s gas anymore, which could spell trouble for the breakaway state. Transnistria has used access to discounted Russian fuel and electricity revenues to build an industrial sector that would crumble virtually overnight if Moldova cut off payments.\r\n\r\nYet Moldova is keenly aware that destroying Transnistria’s economic engine also means harming local citizens — the same people it wants to reintegrate into Moldovan society. \r\n\r\n“We’re talking about up to 300,000 people, almost all of them are our citizens, and they need to be provided with basic services,” Parlicov said. \r\n\r\nBreaking the habit\r\nIt’s a conundrum that looms over Sandu’s Western integration push. \r\n\r\nSince Sandu won power in 2020, Moldova has made strides in tackling corruption, reforming public institutions and strengthening its democracy. For its efforts, the country was granted EU candidate status last year, and talks over joining the bloc are ongoing.\r\n\r\nHowever, there are lingering questions over whether Moldova could join the EU while it has a separatist conflict and Russian troops stationed on its soil.\r\n\r\nEuropean politicians have previously hinted that the Transnistria issue may have to be settled before its application clears the final hurdle. Moldovan leaders are pushing back, repeatedly urging Brussels not to let Moscow and its proxies determine Moldova’s EU fate.\r\n\r\nUndercutting the breakaway region’s cash flow by ending its energy monopoly offers a chance to heal the country’s divisions and join the bloc as one nation.\r\n\r\n“Solving the energy issue with Transnistria would be a major step forward,” said Viola von Cramon-Taubadel, a German MEP and member of the European Parliament’s foreign affairs committee. “But will this be enough for Transnistria to slowly but steadily integrate into the country?”\r\n\r\nHybrid threat\r\nTransnistrian leaders are unlikely to go quietly. In March, its officials called on the Kremlin to “protect it against the pressure of Moldova,” claiming that the country was staging an economic blockade — despite the daily flow of goods and services that pass Russian checkpoints.\r\n\r\nRussian President Vladimir Putin and his inner circle, meanwhile, have stepped up their rhetoric against the country, attacking its European dream with rhetoric similar to what they lobbed at Ukraine.\r\n\r\nYet Russia’s ability to intervene is, in practice, limited. Since the start of the war in Ukraine, local Russian forces have been cut off from their usual supply lines, unable to bring in reinforcements or fly in hardware. Many haven’t been rotated in or out of Moldova in years, and have settled down and raised families locally. And while they sit atop one of Europe’s largest arsenals of weaponry and ammunition at the closely guarded Cobasna depot, it is widely believed to hold little else but decaying WWII-era equipment that hasn’t already been sold off or repurposed by the Russians.\r\n\r\nOther frozen conflicts in the post-Soviet space have culminated in catastrophe. Just last year, a standoff between Azerbaijan and Armenia led to a mass exodus of 100,000 people from Nagorno-Karabakh.\r\n\r\nBut in Moldova’s case, there’s no ethnic animosity driving efforts to end the standoff. Almost all Transnistrian residents have Moldovan passports and move freely through the Russian-guarded checkpoints. Just like Moldovans living elsewhere in the country, Transnistrian residents stand to benefit from the economic boom of joining the EU — no matter what Putin might want for them.\r\n\r\nEven if Moscow can’t muster up a military intervention, it can still create problems for Moldova. Last year, Kyiv’s intelligence services warned it had intercepted a Moscow plan to stage a coup and oust Sandu, using a pro-Russian opposition party to overthrow the government. Presidential and parliamentary elections scheduled for October will be a critical moment for Moldovans to decide their future — and a chance for outside powers like Russia to meddle.\r\n\r\nIn response, Brussels has deployed a mission to the country to help counter disinformation designed to weaken Moldova’s EU ambitions.\r\n\r\n“The EU needs to continue to help Moldova with energy so they become completely independent from Russia,” said Ivana Stradner, a research fellow at Washington’s Foundation for Defense of Democracies. “And we need to make sure that if things escalate we are not afraid of Putin’s provocations in the country — if we don’t want the West to be seen as a paper tiger, we need to be ready to help Moldova.”"
      ],
      "url": "https://www.politico.eu/article/moldova-eye-energy-lever-topple-kremlin-puppet-regime-transnistria/",
      "scraped_at": "2025-11-16T03:51:48.869523",
      "paragraph_count": 0
    },
    {
      "title": "Moldova strips general of rank and medals over Russian spying allegations",
      "content": [
        "The move comes amid warnings Moscow is seeking to destabilize the EU candidate country.\r\n\r\nCopy Link\r\nFree article usually reserved for subscribers\r\nMoldova receive ‘Piranha-3 H’ transporters from Germany\r\nIgor Gorgan is alleged to have offered confidential insights into the weaponry used by the Moldovan armed forces as well as on Ukrainian supply lines running through the country.|Dumitru Doru via EPA\r\nJune 5, 2024 1:04 pm CET\r\nBy Gabriel Gavin\r\nA former senior Moldovan military officer stands accused of betraying his country by passing on sensitive information about the Eastern European nation's defenses to Russian intelligence services.\r\n\r\nIgor Gorgan, who served as Moldova's chief of the general staff until he was dismissed by pro-EU President Maia Sandu in 2021, is alleged to have offered confidential insights into the weaponry used by the Moldovan armed forces as well as on Ukrainian supply lines running through the country.\r\n\r\nIn an exposé published Wednesday, independent Russian investigative outlet The Insider published a spate of Telegram messages purported to be between Gorgan and his handlers in Moscow’s military intelligence service, the GRU, dating back to at least April 2022. The Insider said it had been leaked the messages from an anonymous source.\r\n\r\nGorgan studied at a military school in Russia prior to the fall of the Soviet Union, but had also received training in the United States and participated in NATO missions in Bosnia, Georgia and Iraq. Since leaving the military, Gorgan has been working for the UNHCR, the U.N.’s refugee agency. He did not immediately reply to a request for comment.\r\n\r\nResponding to the allegations, in a statement shared with POLITICO, Sandu’s chief of staff, Adrian Balutel, said “such crimes against the state must be punished in the harshest manner for treason” and announced that Gorgan’s military awards and honorary ranks “will be revoked.”\r\n\r\nLike Ukraine, Russia has sought to keep Moldova in its self-declared sphere of influence, as it seeks to establish greater ties with the rest of Europe. The Kremlin has responded by launching the sort of hybrid warfare it conducted against Kyiv from 2014 until the start of its full-scale invasion in 2022. Russia occupies the Transnistria region of Moldova, which runs along the border with Ukraine, and has hundreds of troops stationed there despite calls from the government for them to leave.\r\n\r\nMoldova and its Western allies have in recent months sounded the alarm over Russian efforts to destabilize the country, with reports that the Kremlin has been actively trying to topple the elected government and fomenting discontent through local proxies.\r\n\r\nThe EU, which last year opened accession talks with Moldova, has deployed a civilian mission to the country to help combat hybrid threats from Russia. The country has also struck a spate of defense deals with Western countries, including France, to bolster its resilience.\r\n\r\n“Such internal offenders contribute to the hybrid threats against the state of the Republic of Moldova,” Balutel said. \"This is precisely why we need more effective tools to counter acts of treason.”"
      ],
      "url": "https://www.politico.eu/article/moldovan-general-accused-of-treason-over-russian-spy-allegations/",
      "scraped_at": "2025-11-16T03:51:48.992145",
      "paragraph_count": 0
    },
    {
      "title": "Moldovan president warns of 'harsh winter' in inauguration speech",
      "content": [
        "\"We can be proud that, despite the challenges, we have managed to be on the right side of history,\" Maia Sandu said while taking the oath before parliament and the Constitutional Court.",
        "Moldovan President Maia Sandu was sworn in for a second term Tuesday (24 December), praising voters’ pro-Europe choice “despite the pressures” after Russia was accused of interfering in last month’s election in the former Soviet republic that borders Ukraine.",
        "In her first term, Sandu pivoted Moldova towards the European Union and away from Moscow, which ruled the country during the Soviet era.",
        "“We can be proud that, despite the challenges, we have managed to be on the right side of history,” she said while taking the oath before parliament and the Constitutional Court.",
        "“We have defended democracy in the face of external threats,” she added.",
        "“Moldova voted, despite all the pressures, for a clear direction — a developed, European country bringing greater security and prosperity,” the 52-year-old leader said.",
        "The former World Bank economist took 55.33% of the vote in the run-off in early November, defeating Alexandr Stoianoglo, who was supported by pro-Russian socialists.",
        "The Moldovan president’s pro-European party came first in hundreds of local elections, but failed to…",
        "Sandu, the country’s first woman head of state, owed her re-election in large part due to a strong turnout from Moldova’s large diaspora. Within the country’s borders, she lost by a narrow margin.",
        "Rural areas of the country — sandwiched between NATO member Romania and war-torn Ukraine — and separatist Transnistria, where Russian troops are stationed, remain pro-Moscow, as does the autonomous Gagauzia region.",
        "Authorities reported numerous “attempts at destabilising” the election, including disinformation, vote buying, death threats, cyberattacks, and the bussing of voters.",
        "In return, the Kremlin accused Moldova of suppressing “the opposition and independent media, especially Russian-language outlets”.",
        "Sandu has firmly steered her 2.6 million-strong nation, one of Europe’s poorest, toward Brussels over the last four years, with the European Union officially opening accession talks in June.",
        "“Four years ago, we promised you better times. It was a sincere promise,” she said. “But the times turned out to be difficult,” referring to the impact of the war in Ukraine.",
        "Russia is expected to cut off gas supplies to Moldova and Transnistria from 1 January, when the existing supply contract expires. Chisinau declared a state of emergency earlier this month as a result.",
        "Energy, Environment & Transport",
        "Moldova’s parliament voted early on Friday (13 December) to impose a national state of emergency…",
        "“After the pandemic came inflation, the energy crisis, gas blackmail, and now blackouts,” she added, referring to the “harsh winter” in store from power outages.",
        "Moldova relies on the Cuciurgan power plant in breakaway Transnistria for 70% of its electricity, which is fuelled by Russian gas arriving via Ukraine.",
        "However, Kyiv has announced its intention not to renew the transit contract which allows Russian gas to be transported to Europe at the end of December.",
        "In response, the Moldovan government has accused the Russian energy giant Gazprom of refusing to use alternative routes.",
        "(Edited by Georgi Gotev)"
      ],
      "url": "https://www.euractiv.com/news/moldovan-president-warns-of-harsh-winter-in-inauguration-speech/",
      "scraped_at": "2025-11-16T03:51:50.263303",
      "paragraph_count": 22
    },
    {
      "title": "Russia says it will protect its citizens in Moldova's Transnistria",
      "content": [
        "The statement was made as the parliament of the separatist enclave of Transnistria appealed to Moscow for help resolving disruptions in natural gas supply.",
        "Russia will protect its citizens and peacekeepers in Moldova’s separatist Transnistria region, foreign ministry spokeswoman Maria Zakharova said on Wednesday (18 December).",
        "Zakharova was speaking as the separatist enclave’s parliament appealed to Moscow for help resolving disruptions in natural gas supply linked to the expiry at the end of December of an agreement allowing Russian gas to transit through Ukraine.",
        "“Russia will react adequately to any provocations and will ensure the protection of its citizens, peacekeeping contingent, servicemen of the task force of Russian troops and military warehouses in the settlement of Kolbasna in Transdniestria,” Zakharova told a briefing.",
        "Any actions that threaten them would be considered by Moscow as an attack on Russia, she added.",
        "Breakaway pro-Russian Transnistria has existed generally peacefully side by side with Moldova since a brief post-Soviet war in 1992 and some 1,500 Russian “peacekeepers” remain in the country.",
        "But Moldova’s pro-European leaders accuse Moscow of “gas blackmail” in trying to destabilise it.",
        "Both Moldova and Transnistria have declared states of emergency over the threat of a disruption of gas supplies passing through Ukraine.",
        "Energy, Environment & Transport",
        "Moldova’s parliament voted early on Friday (13 December) to impose a national state of emergency…",
        "The speaker of Transnistria’s parliament, Alexander Korshunov, said the appeal was sent to the Kremlin and to both houses of Russia’s parliament to clinch a new accord ensuring further supplies of Russian gas through Ukraine. Moldova’s government, he said, also had to act to secure a deal.",
        "“We are waiting,” local media quoted him as saying. “Matters here do not depend on Transnistria.”",
        "Ukraine has said it will not extend the transit deal.",
        "Moldova has held discussions with Russian state gas company Gazprom on securing Russian gas and suggested supplies could be shipped through Turkey, Bulgaria and Romania. No deal has been reached.",
        "Bulgaria will stop the transit of Russian gas through the Balkan Stream unless Gazprom finds…",
        "Moldova sees the supplies as vital to guard against a humanitarian emergency in Transdniestria and to ensure continued operation in the enclave of a thermal plant that provides most of the electricity in areas of Moldova under government control.",
        "The central government this week rejected a proposal by Transnistria to issue a joint appeal to Moscow, saying that such a move would amount to de facto recognition of the separatist enclave. It has no international recognition.",
        "Moldovan Prime Minister Dorin Recean, speaking on television on Wednesday, said authorities would consider supplying Transnistria with gas purchased from elsewhere, but that would prove more costly."
      ],
      "url": "https://www.euractiv.com/news/russia-says-it-will-protect-its-citizens-in-moldovas-transdniestria/",
      "scraped_at": "2025-11-16T03:51:51.206863",
      "paragraph_count": 18
    },
    {
      "title": "Slovakia leads effort for continued Ukraine gas transit as EU stays out of talks",
      "content": [
        "Slovakia, receiving gas from Russia via pipelines in Ukraine, has been in talks to try to avoid Russian gas flows stopping when a transit contract between Kyiv and Moscow expires at the end of the year.",
        "Slovakia’s main gas buyer SPP and groups from Hungary, Austria and Italy warned the European Commission on Tuesday (17 December) of the risks of an end to natural gas transit via Ukraine, as EU officials kept out of talks aimed at keeping Russian gas flowing.",
        "Slovakia, receiving gas from Russia via pipelines in Ukraine, has been in talks to try to avoid Russian gas flows stopping when a transit contract between Kyiv and Moscow expires at the end of the year.",
        "Ukraine, locked in a 33-month-old war with Russia, has said repeatedly that it will not extend the gas transit agreement.",
        "After a second meeting with Robert Fico’s government, Ukrainian Prime Minister Denys Shmyhal reiterated Ukraine’s…",
        "Prime Minister Denys Shmyhal said on Monday that Ukraine was willing to agree to a deal enabling gas to transit through its territory as long as it was not of Russian origin.",
        "“The declaration that we have prepared in SPP is intended to support the continuation of gas transit through the territory of Ukraine and the preservation of its gas infrastructure,” SPP Chief Executive Vojtech Ferencz said in a statement.",
        "“It is the most advantageous solution not only for gas consumers in Europe, but also for Ukraine itself,” Ferencz said.",
        "SPP said its declaration was signed by Slovak pipeline operator Eustream, Hungarian groups MVM and MOL, along with industry associations from Italy, Austria and Hungary.",
        "The declaration was sent to Commission President Ursula von der Leyen “so that she has first-hand information about the threat to energy and economic security in our region,” Ferencz said.",
        "A spokesperson said on Tuesday that the Commission had received the groups’ declaration but was not in talks to extend the transit contract and had no interest in keeping Russian gas transit via Ukraine.",
        "“The Commission does not support any discussions on the contract extension nor other solutions to maintain transit flows and has not been involved in any kind of negotiations on this,” the spokesperson said in emailed responses to questions.",
        "Slovakia has said that European countries and companies have a combined demand of around 15 billion cubic metres of Russian gas next year via Ukraine.",
        "Slovak Economy Minister Denisa Sakova held another round of talks on Tuesday with Russian group Gazprom.",
        "With fewer route options, the loss of supplies via Ukraine transit would be a blow to buyers like Slovakia.",
        "In SPP’s case, the company said the loss of supplies from the east would cost it an additional 150 million euros ($157 million) due to higher transit fees. The cost for the entire Slovak market would reach 220 million euros.",
        "Amid renewed concerns over Russian gas supply, the benchmark Dutch front-month gas contract was up over 5% on Tuesday.",
        "Deputy Prime Minister of Moldova Oleg Serebrian told Radio Moldova he had discussed with Kyiv officials how Russian gas could transit through Ukraine after the existing agreement expires, but felt that the issue was closed.",
        "Moldova has been discussing gas supplies with Russian gas giant Gazprom, particularly to its separatist Transnistria region, and has suggested Russian gas could be shipped by lines passing through Turkey, Bulgaria and Romania.",
        "Energy, Environment & Transport",
        "Moldova’s parliament voted early on Friday (13 December) to impose a national state of emergency…",
        "No agreement has yet been reached.",
        "Russian gas is critical for Transnistria’s residents and to supply a thermal plant that provides most of the electricity for government-controlled areas of Moldova.",
        "But Serebrian rejected a call from Transnistria’s pro-Russian leaders to make a joint appeal to Moscow on gas supplies.",
        "“Just what would a joint declaration (of Moldova and Transnistria) mean?” he asked. “Would it mean recognition of dual power centres in Moldova? Recognition of their so-called authority? That is the sub-text of such a proposal.”"
      ],
      "url": "https://www.euractiv.com/news/slovakia-leads-effort-for-continued-ukraine-gas-transit-as-eu-stays-out-of-talks/",
      "scraped_at": "2025-11-16T03:51:51.935693",
      "paragraph_count": 25
    },
    {
      "title": "Moldova declares state of emergency as risk of Russian gas cutoff looms",
      "content": [
        "Prime Minister Dorin Recean said Russian President Vladimir Putin \"wants to leave the population of Transnistria without gas\" in order to destabilise the situation in Moldova.\"",
        "Moldova’s parliament voted early on Friday (13 December) to impose a national state of emergency for 60 days starting on 16 December due to an expected cut-off of Russian gas supplies from 1 January.",
        "Fifty-six members in the 101-seat chamber backed the measure in the vote just after midnight following Prime Minister Dorin Recean’s call for approval to ensure Moldova’s separatist Transdniestria region secured the gas it needed.",
        "It was a vote, he said, to end “gas blackmail” from Moscow.",
        "Declaring a state of emergency allows the government to respond rapidly and curb energy exports.",
        "Moldova receives Russian natural gas via Ukraine, which has said it will not extend its transit contract with Russian gas giant Gazprom. The contract expires on 31 December.",
        "Recean said Russian President Vladimir Putin “wants to leave the population of Transnistria without gas and electricity and hold them hostage. Moscow is doing this to destabilise the situation in Moldova.”",
        "It was up to parliament, Recean said, to approve the state of emergency so that “this winter must be the last in the country’s history when we can be subject to energy blackmail”.",
        "Failing to provide gas to Transnistria, the government said in a statement, “will lead to a humanitarian crisis… and will also create risks for the stability of the electricity sector of Moldova”.",
        "Moldova receives about 2 billion cubic metres of gas per year from Russia. Since 2022, Transdniestria and the central government have agreed that all Russian gas received by Moldova flows to Transnistria.",
        "Transnistria is home to a power plant fuelled by Russian gas that is a vital plank of the breakaway region’s economy and also provides most of the power for government-controlled areas of Moldova.",
        "Transnistria, which has no international recognition, declared its own economic state of emergency on Tuesday.",
        "Recean said the transit issue through Ukraine was an “artificial problem” as Russian gas could move along other routes.",
        "Moldova has said an alternative route to Transnistria could be to ship Russian gas via the TurkStream pipeline to Turkey and then through Bulgaria and Romania.",
        "The supplies, however, could be under question as Gazprom in talks linked continued deliveries via alternative routes to its demands that Moldova pay a debt on past supplies, which according to Russian calculations stands at $709 million.",
        "Moreover, Bulgaria recently warned that it will stop the transit of Russian gas unless Gazprom finds a new way to pay following the imposition of US sanctions on Gazprombank.",
        "Bulgaria will stop the transit of Russian gas through the Balkan Stream unless Gazprom finds…",
        "(Edited by Georgi Gotev)"
      ],
      "url": "https://www.euractiv.com/news/moldova-declares-state-of-emergency-as-risk-of-russian-gas-cutoff-looms/",
      "scraped_at": "2025-11-16T03:51:52.767720",
      "paragraph_count": 18
    },
    {
      "title": "Moldovan separatists complain to EU about central government",
      "content": [
        "A week after the European Union launched membership talks with Moldova, the country's separatist region of Transnistria complained on Tuesday (2 July) that central authorities had ignored its proposals to settle their long-running dispute and imposed a \"banking blockade\".",
        "A week after the European Union launched membership talks with Moldova, the country’s separatist region of Transnistria complained on Tuesday (2 July) that central authorities had ignored its proposals to settle their long-running dispute and imposed a “banking blockade”.",
        "The leader of the pro-Russian separatist Transnistria region, Igor Krasnoselsky, told the EU ambassador in a rare meeting that Moldova’s government had ignored its proposed declaration calling for a peaceful settlement.",
        "“The declaration is a good, positive step. The Moldovan position, refusing to sign a document about peace, is incomprehensible,” Krasnoselsky told EU ambassador Jānis Mažeiks, referring to the document he said was presented in May.",
        "“Everyone, including the Moldovan side, talks about peace and ruling out aggression. Let’s sign and make this wish plain.”",
        "Krasnoselsky also told the ambassador that the bank accounts of Transnistrian businesses in Moldovan banks had been closed, restricting their access to EU programmes intended to ease trade with the 27-member bloc.",
        "This, he said, amounted to a “banking blockade”.",
        "Transnistrian authorities earlier this year denounced Moldovan customs duties on goods leaving and entering the region, and elected officials called for help from Russia.",
        "Transnistria, a sliver of land on the border with Ukraine, split from Moldova in the final days of Soviet rule and engaged in a brief 1992 war with the newly independent state.",
        "A senior official of Moldova’s pro-European government said on Wednesday (17 January) that his latest…",
        "It functions with heavy backing from Moscow and the two sides have existed side by side with few incidents for more than 30 years.",
        "Moldova seeks an overall solution under which the region would be fully integrated into its territory.",
        "But Russia’s 2022 invasion of Ukraine had halted all efforts of the “5+2” talks to find a settlement, which included Russia, Ukraine and the Organisation for Security and Cooperation in Europe as well as the European Union and the United States.",
        "Moldova’s Bureau for Reintegration told the newsmaker.md news outlet that the proposed declaration had “unscrupulous aims” and pledged to press on with its diplomatic efforts.",
        "Moldovan President Maia Sandu has made EU membership the cornerstone of her policies in the country lying between Ukraine and Romania. Membership talks opened with Moldova and Ukraine last week and Moldova hopes it will be able to join by 2030.",
        "Sandu has called an October referendum on joining the bloc, to be held alongside a presidential poll in which she is seeking re-election."
      ],
      "url": "https://www.euractiv.com/news/moldovan-separatists-complain-to-eu-about-central-government/",
      "scraped_at": "2025-11-16T03:51:53.733147",
      "paragraph_count": 16
    },
    {
      "title": "US sanctions pro-Russia governor of Moldova's Gagauzia region",
      "content": [
        "The United States imposed sanctions on the pro-Russia governor of Moldova's Gagauzia region on Wednesday (12 June), a move supported by the pro-Western government in Chisinau.",
        "The United States imposed sanctions on the pro-Russia governor of Moldova’s Gagauzia region on Wednesday (12 June), a move supported by the pro-Western government in Chisinau.",
        "Evgenia Gutul is a Kremlin ally who was elected last year to head the autonomous southern Moldovan region and has been at odds with the government and President Maia Sandu, who seeks to take the small ex-Soviet state into the European Union. Moldova is officially a candidate to join the EU.",
        "The new leader of Moldova’s region of Gagauzia expressed gratitude at her inauguration on Wednesday…",
        "Gutul faces criminal allegations of channelling funds from Russia to finance the now-banned Shor Party set up by Ilan Shor, an exiled pro-Russia businessman convicted of fraud in Moldova.",
        "She has denied those allegations as fabricated.",
        "The sanctions announced on the website of the US Treasury’s Office of Foreign Assets Control freeze any assets held by Gutul in the United States and generally prohibit Americans from doing business with her.",
        "“The United States announced sanctions against (Gutul) as an active facilitator of fugitive convicted oligarch Ilan Shor and his Shor Party, and their Kremlin-backed illegal political interference efforts,” the US embassy in Chisinau said in a statement.",
        "Moldovan Prime Minister Dorin Recean said the sanctions had been imposed after “effective cooperation” with partners and that “we will continue to take decisive action to counter corruption and threats to national security”.",
        "“The prompt reaction of the USA must serve as an example for the judiciary in the Republic of Moldova to do its duty and defend the interest of the country and our citizens,” Recean said in a statement.",
        "Gutul, writing on the Telegram messaging app, said she was unsurprised by the US punitive measures.",
        "“There is no point being afraid of judges, sanctions and threats,” she said. “We have overcome and will continue to overcome the obstacle course organised by Maia Sandu and her backers.”",
        "Shor mocked the sanctions, describing then as “a quality mark, a symbol that we are correct in what we are doing.”",
        "As Moldova’s relations have deteriorated with the Kremlin during Moscow’s full-scale invasion of neighbouring Ukraine, Gutul has called for closer ties and met high-level Russian officials, including President Vladimir Putin in March.",
        "Moldova’s pro-Western government has staunchly condemned Russia’s invasion of Ukraine, at one point accused Moscow of plotting its overthrow and expelled Russian diplomats.",
        "Gagauzia, a region populated mainly by a Turkic-speaking largely Orthodox ethnic group, has had an uneasy relationship with the capital Chisinau since the 1991 breakup of the Soviet Union, and was later granted autonomy.",
        "Moldova, one of Europe’s poorest countries, has a Romanian-speaking majority and a large Russian-speaking minority, and political control has alternated between pro-Russian and pro-Western groups since the fall of the Soviet Union.",
        "Another region of Moldova, mainly Russian-speaking Transnistria, broke from Chisinau’s control after a brief war in the early 1990s, and houses a garrison of Russian troops."
      ],
      "url": "https://www.euractiv.com/news/us-sanctions-pro-russia-governor-of-moldovas-gagauzia-region/",
      "scraped_at": "2025-11-16T03:51:57.214112",
      "paragraph_count": 18
    },
    {
      "title": "Blinken vows support for Moldova against Russia 'bullying'",
      "content": [
        "US Secretary of State Antony Blinken on Wednesday (29 May) promised steadfast US support to Moldova in areas from energy independence to democracy promotion on a solidarity visit to the pro-Western nation as alarm grows over Russian pressure.",
        "US Secretary of State Antony Blinken on Wednesday (29 May) promised steadfast US support to Moldova in areas from energy independence to democracy promotion on a solidarity visit to the pro-Western nation as alarm grows over Russian pressure.",
        "The top US diplomat saluted the work of the country’s president, Maia Sandu, who has charted a firm pro-European course in the face of what US officials fear is a coordinated Russian campaign as she seeks a new term.",
        "Moldova is officially a candidate to join the EU.",
        "“We see you as a very valuable partner in the region and we have an enduring commitment to work together,” Blinken told Sandu as they met at the presidential office.",
        "“What’s so powerful is the deep and deep-rooted commitment to democracy,” he said.",
        "“This in the face of bullying from Russia — interference, efforts to spread misinformation, disinformation, weaponising corruption, manufacturing anti-government protests. Despite that, we’ve seen extraordinary resilience,” Blinken said.",
        "The United States hopes to ensure “that fundamentally, the people of Moldova are the ones who decide their own future and their own course. That’s what this is really all about”, he said.",
        "Blinken said President Joe Biden’s administration was asking Congress for another $50 million in support for Moldova, including assistance in cyber security during the upcoming election.",
        "The United States has already committed some $300 million to Moldova’s energy sector as the country has been making moves to reduce its reliance on Russian imports in the wake of Moscow’s invasion of Ukraine.",
        "Blinken announced that $85 million of the already committed funds would go into immediate projects, including battery storage and helping to link Moldova to Ukraine, Romania and other non-Russian sources of energy.",
        "The United States is “working to help you continue to diversify your energy supply so that you are not dependent on any one source”, Blinken said.",
        "Sandu said she expected to see more “attempts at Russian interference” as she seeks reelection and pursues eventual membership in the European Union.",
        "“We do expect the situation to get more difficult in the next few months,” she said.",
        "The trip comes as Moscow, which stations troops in Moldova’s breakaway Transnistria region, has recently scored a series of battlefield victories in Ukraine, stirring new calls to let Kyiv use Western arms to strike directly on Russian soil.",
        "Biden is wary of direct military confrontation with Russia but Blinken suggested he was receptive to calls from France and elsewhere to loosen restrictions.",
        "“At every step along the way we’ve adapted and adjusted as necessary. And so that’s exactly what we’ll do going forward,” Blinken said.",
        "Sandu hailed US support both to Moldova and to Ukraine, where Biden has directed billions of dollars in weapons since Russia invaded in 2022.",
        "The assistance to Ukraine “also makes Moldova more safe and resilient”, she said.",
        "“Our neighbours and friends in Ukraine pay a terrible price every day for the simple aspiration to be free,” she said.",
        "Blinken last visited Moldova weeks after Russia’s invasion of Ukraine, when he made some gloomy predictions that Moscow would also strike the tiny country of 2.6 million people.",
        "Speculation grew earlier this year that Russia would seek to annex Transnistria, but US officials say they see no imminent military threat from the 1,500 Russian troops in the separatist region.",
        "Russia launched an assault on Ukraine’s northeastern Kharkiv region two weeks ago, seeking to press its advantage before US weapons reach the frontlines.",
        "Blinken voiced confidence in Ukrainian forces once the weapons come, saying that Russian President Vladimir Putin had already failed in his earlier goal of taking Ukraine’s second-largest city of Kharkiv.",
        "The US election in November could have major ramifications for Ukraine.",
        "Biden’s Republican challenger, Donald Trump, has voiced admiration for Putin and doubted Ukraine’s chances for victory.",
        "Russia also appears to have gained ground diplomatically in another former Soviet republic, Georgia, which on Tuesday rammed through a law against “foreign influence” seen as inspired by the Kremlin."
      ],
      "url": "https://www.euractiv.com/news/blinken-vows-support-for-moldova-against-russia-bullying/",
      "scraped_at": "2025-11-16T03:51:58.106410",
      "paragraph_count": 27
    },
    {
      "title": "Moldovan Parliament backs bid to join EU, but divisions remain",
      "content": [
        "Moldova's Parliament on Thursday (21 March) endorsed an appeal to press on with a drive to join the European Union, but the opposition walked out of the vote and separatists in the Transnistria region urged authorities to drop their claim to the enclave.",
        "Moldova’s Parliament on Thursday (21 March) endorsed an appeal to press on with a drive to join the European Union, but the opposition walked out of the vote and separatists in the Transnistria region urged authorities to drop their claim to the enclave.",
        "President Maia Sandu, who says Russia is the biggest threat to Moldova’s security, has made EU membership the cornerstone of her administration in the ex-Soviet state, which lies between Ukraine and Romania.",
        "Moldova applied for EU membership in 2022 and received a draft framework for accession negotiations in March, along with neighbouring Ukraine.",
        "A vocal opponent of Russia’s war in Ukraine, Sandu has called for a referendum on EU membership to be held this year.",
        "President Maia Sandu launched a campaign to promote an upcoming referendum on Moldova’s push to…",
        "After a debate coinciding with an EU summit in Brussels, the 101-seat Parliament adopted by a vote of 54-to-0 a declaration saying, “Only joining Europe can ensure the future of the country as a sovereign, neutral and full-fledged democratic state”.",
        "It identified EU integration as “Moldova’s top priority national project.” Moldova is one of Europe’s poorest countries.",
        "The opposition Bloc of Communists and Socialists, sympathetic to Moscow, walked out of the chamber.",
        "In Transdniestria, a sliver of land which broke away from Moldova as the Soviet Union was collapsing, self-styled President Vadim Krasnoselsky called on Moldovan authorities to recognise his territory and renounce all claims to it.",
        "“There is no other way out,” he said on the enclave’s television. “There can be no more talk of autonomy. You must walk away from these territories.”",
        "His region, he said, was “not separatist,” but “a normal neighbour” seeking peace and stability.",
        "Transnistria, heavily dependent on Russia for financial support, has no international recognition, not even from Moscow.",
        "It has remained on Moldova’s eastern border for 30 years with little turmoil, but tension has risen since Moldovan authorities imposed customs duties in January on all goods entering and leaving the region.",
        "Elected officials last month appealed to Moscow for diplomatic measures to protect the region.",
        "An EU summit last year gave the green light for membership talks with both Ukraine and Moldova, but no date for the start of talks has been made public, and there was no announcement on the matter at Thursday’s meeting in Brussels.",
        "Moldova has been engaged in an escalating row with Russia, with the Ukraine war and Transdniestria as the focal points.",
        "Authorities summoned the Russian ambassador twice in the past week over Moscow’s decision to open six polling stations in the enclave for Russia’s presidential election, and a Russian diplomat was told to leave the country.",
        "Moldova faces disputes with a second region in the south, Gagauzia, whose leader met Russian President Vladimir Putin this month and is linked to a fugitive pro-Russian businessman sentenced to 15 years in absentia for mass fraud.",
        "The new leader of Moldova’s region of Gagauzia expressed gratitude at her inauguration on Wednesday…",
        "(Edited by Georgi Gotev)"
      ],
      "url": "http://euractiv.com/news/moldovan-parliament-backs-bid-to-join-eu-but-divisions-remain/",
      "scraped_at": "2025-11-16T03:51:59.699932",
      "paragraph_count": 21
    },
    {
      "title": "Moldova expels Russian diplomat over Transnistria polling stations",
      "content": [
        "Moldova on Tuesday (19 March) expelled a Russian diplomat over the opening of polling stations for Russia's presidential election in the breakaway region of Transnistria after summoning the Russian ambassador.",
        "Moldova on Tuesday (19 March) expelled a Russian diplomat over the opening of polling stations for Russia’s presidential election in the breakaway region of Transnistria after summoning the Russian ambassador.",
        "Moldova’s Foreign Ministry has twice called in Moscow’s envoy, Oleg Vasnetsov, to protest the opening of the polling stations in Transnistria, an unrecognised pro-Russian enclave, despite Moldova’s opposition.",
        "The country’s pro-European government doubled down on punitive action against Moscow, saying it would bar a Russian delegation from a United Nations meeting taking place in Chisinau in May.",
        "Pro-European President Maia Sandu said the Russian move indicated a lack of respect for Moldova’s sovereignty and promised a government response at a press conference on Monday.",
        "The envoy, Vasnetsov, said Moscow would draw up a response to what he described as an unfriendly act by Moldova, Russia’s TASS news agency reported.",
        "In a statement, the Moldovan Foreign Ministry said it was barring a Russian delegation from a regional meeting of the UN’s Food and Agriculture Organisation.",
        "It said the decision “took account of Russia’s continuing aggressive war against Ukraine which blatantly violates the UN Charter and provoked many crises in the international arena”.",
        "Russian participation in the meeting, it said, would be confined to embassy staff or online.",
        "Russian Foreign Ministry spokeswoman Maria Zakharova decried both measures as “the latest part of an anti-Russian campaign conducted by Moldova’s leaders”.",
        "She said it was also Moldova’s way of “settling scores” for Russia providing the means for Transnistria residents to vote in the Russian presidential poll.",
        "Moldova’s relations with Russia have become strained since Moscow’s invasion of Ukraine in February 2022, which Moldova’s government has strongly condemned.",
        "Moldova told Russia to drastically reduce the size of its embassy staff to 25 from 80 last year to establish parity with Moldova’s representation in Moscow.",
        "“We don’t want a relationship with a regime that kills innocent people every day,” Sandu said of Russia on Monday.",
        "Sandu’s government expelled the unidentified Russian diplomat in protest against the opening of six polling stations in Transnistria instead of one polling station in Moldova’s capital Chisinau as previously agreed."
      ],
      "url": "https://www.euractiv.com/news/moldova-expels-russian-diplomat-over-transnistria-polling-stations/",
      "scraped_at": "2025-11-16T03:52:00.397340",
      "paragraph_count": 15
    },
    {
      "title": "Moldovan president launches campaign to promote EU referendum",
      "content": [
        "President Maia Sandu launched a campaign to promote an upcoming referendum on Moldova's push to join the European Union on Monday (18 March), calling on civil leaders to rally support for the country's accession to the 27-member bloc.",
        "President Maia Sandu launched a campaign to promote an upcoming referendum on Moldova’s push to join the European Union on Monday (18 March), calling on civil leaders to rally support for the country’s accession to the 27-member bloc.",
        "Moldova, a former Soviet republic of 2.6 million led by a pro-European government, applied for EU membership in 2022 and received a draft framework for accession negotiations in March, along with neighbouring Ukraine.",
        "The country’s relations with Russia have become strained since Moscow’s invasion of Ukraine in February 2022, which Chisinau has staunchly condemned.",
        "Sandu announced plans in December to hold a referendum later this year on whether to join the EU. The president, who will seek a second term at elections in late 2024, told a news conference that Moldova had a historic opportunity to mount an accession push.",
        "The referendum would vote on enshrining Moldova’s EU ambitions in the constitution ensuring that the bid is not derailed by future governments.",
        "“Member states of the European Union are more open than ever, we have the necessary political will for this step, and our citizens want to be part of the EU,” she said.",
        "The referendum would prevent Moldova’s pro-Europe drive stalling or reversing after a change of power, she said.",
        "“This must be reconfirmed and written in the Constitution, so that whoever is in government, the voice of the people for this direction of development should be mandatory for the political class.”",
        "The referendum could take place in October, she said, though parliament would choose the date. It was not yet clear whether the constitutional court would allow the referendum to fall on the same day as the presidential elections.",
        "Sandu’s comments come after Russia operated polling stations for its presidential election inside the breakaway, Moldovan region of Transnistria despite protests from Chisinau, which said the move was disrespectful to the country’s sovereignty.",
        "The Russian ambassador to Moldova dismissed those complaints as “unfounded” and said the polling station were needed to ensure Russian citizens could participate in the elections."
      ],
      "url": "https://www.euractiv.com/news/moldovan-president-launches-campaign-to-promote-eu-referendum/",
      "scraped_at": "2025-11-16T03:52:01.102155",
      "paragraph_count": 12
    },
    {
      "title": "Moldova says Russia illegally printed election ballots in Transnistria",
      "content": [
        "A senior official in ex-Soviet Moldova said on Wednesday (13 March) Moscow was breaking laws by printing ballot papers in the separatist region of Transnistria ahead of this weekend's Russian presidential election.",
        "A senior official in ex-Soviet Moldova said on Wednesday (13 March) Moscow was breaking laws by printing ballot papers in the separatist region of Transnistria ahead of this weekend’s Russian presidential election.",
        "Moldova’s pro-European authorities have already summoned the Russian ambassador to complain about a decision to open six polling stations in the pro-Russian enclave. The central government said the move broke an agreement to allow voting only at a single polling station at the Russian embassy in Chisinau.",
        "The ambassador rejected the complaint as unfounded, telling reporters Russia was simply enabling some 250,000 Russian nationals in Moldova to vote, many of them in the separatist region.",
        "“These ballots were more than likely printed right there (in Transnistria) to avoid taking them through a border crossing,” Deputy Prime Minister Oleg Serebrian said before a government meeting.",
        "“It is hard to say how they would have been brought over a border. Moldova’s borders are controlled and there is no way of legally bringing them in or taking them out.”",
        "Russians vote in a presidential election from 15 to17 March in which incumbent Vladimir Putin is certain to win against three challengers, none of whom criticise him.",
        "Moldova’s pro-European president, Maia Sandu, has denounced Moscow’s invasion of Ukraine and accuses the Kremlin of plotting to unseat her. Russia says Sandu promotes Russophobia.",
        "Transnistria split from Moldova as the Soviet Union was collapsing and has remained on the country’s eastern border with Ukraine for more than 30 years with a minimum of turmoil.",
        "It has no international recognition and depends heavily on Russian help. Some 1,500 Russian “peacekeepers” remain in place.",
        "Tension has risen between authorities and the region since Moldova imposed customs duties on goods entering and leaving Transdniestria as part of its drive to join the European Union.",
        "Serebrian, who is responsible for “reintegrating” the region, said printing the ballots in Transnistria was intended to show Moldova that the region had no regard for national laws.",
        "“What is important here is holding the electoral process itself and not whether the ballots are to be taken in or out of Russia,” he said.",
        "When Russia last held parliamentary elections in 2021, Russian officials opened 24 polling stations in Transnistria without permission from the country’s authorities."
      ],
      "url": "https://www.euractiv.com/news/moldova-says-russia-illegally-printed-election-ballots-in-transnistria/",
      "scraped_at": "2025-11-16T03:52:01.743837",
      "paragraph_count": 14
    },
    {
      "title": "Moldova spy chief warns on new destabilisation attempts by Russia",
      "content": [
        "Moldova's spy chief said on Tuesday (5 March) that Russia was planning fresh attempts to meddle in the country's internal affairs by provoking protests, interfering in upcoming presidential elections, and disrupting plans to join the European Union.",
        "Moldova’s spy chief said on Tuesday (5 March) that Russia was planning fresh attempts to meddle in the country’s internal affairs by provoking protests, interfering in upcoming presidential elections, and disrupting plans to join the European Union.",
        "Alexandru Musteață, head of the Information and Security Service, said his agency had intercepted a record level of activities by the Russian security services since 2023 and expected more destabilising actions this year and next.",
        "“Russian intelligence services intend to interfere in the election processes this year as well,” Musteață told media.",
        "“We have information that attempts are being made to compromise a referendum on the European integration, interfere in the presidential elections, as well as discredit government institutions and politicians who support Moldova’s accession to the European Union.”",
        "Relations between Moldova and Russia have disintegrated as the government has steered a pro-European course and accused Moscow of trying to destabilise it. The ex-Soviet state’s pro-Western president Maia Sandu has denounced Russia’s invasion of Ukraine as she leads Moldova on a path to join the EU and defence alliance NATO.",
        "Moscow denies the allegations of interference and accuses Sandu of stoking anti-Russian sentiment in the country, which lies between Ukraine and Romania.",
        "Sandu plans to run for a second term in the presidential election expected this autumn, and her party won more than 40% of the votes cast for mayors, city officials, district and village councils. The government also plans a nationwide referendum on its pro-European drive although no dates have been set yet.",
        "Musteață said Moscow tried to meddle in the local elections last November in Moldova. Moscow has denied such interference.",
        "Musteață said Moscow was also planning to interfere in the presidential vote by supporting pro-Russian politicians and parties. Russia would likely provoke protests in Moldova in March and April and stir up separatist sentiments, especially in the east and south of Moldova, he said.",
        "Last month, the pro-Moscow head of Moldova’s Gagauzia region asked Russia for its support and to maintain close ties. Also in February, Moldova’s breakaway Transnistria region asked Russia to help its economy withstand Moldovan “pressure”.",
        "Moldova’s breakaway Transnistria region asked Russia on Wednesday (28 February) to help its economy withstand…"
      ],
      "url": "https://www.euractiv.com/news/moldova-spy-chief-warns-on-new-destabilisation-attempts-by-russia/",
      "scraped_at": "2025-11-16T03:52:02.466925",
      "paragraph_count": 12
    },
    {
      "title": "Moldova dismisses Transnistria's request for Russian help",
      "content": [
        "Moldova's breakaway Transnistria region asked Russia on Wednesday (28 February) to help its economy withstand Moldovan \"pressure\", at a meeting of hundreds of officials dismissed by the pro-European Chisinau government as a propaganda stunt to gain headlines.",
        "Moldova’s breakaway Transnistria region asked Russia on Wednesday (28 February) to help its economy withstand Moldovan “pressure”, at a meeting of hundreds of officials dismissed by the pro-European Chisinau government as a propaganda stunt to gain headlines.",
        "The region, long seen as a potential flashpoint with Russia in Europe, held a “congress of deputies of all levels” after Moldova required Transnistrian firms to pay import duties to the central budget from January.",
        "The congress passed a resolution saying it would appeal to both houses of Russia’s parliament “with a request to implement diplomatic measures to protect Transnistria in the face of increasing pressure from Moldova”.",
        "The unrecognised strip of land, which borders war-stricken Ukraine to the east, has maintained autonomy from Chisinau for three decades with support from Moscow, which has more than a thousand troops stationed there since a brief war in 1992.",
        "After Russia’s full-scale invasion of Ukraine in 2022, tensions surged around the separatist region, which says it has 220,000 Russian citizens.",
        "Relations between Moldova and Russia have also frayed as the Chisinau government has steered a pro-European course and accused Moscow of trying to destabilise it.",
        "Moldova has found itself at the forefront of a hybrid war orchestrated by the Kremlin,…",
        "President Maia Sandu, in Albania for a summit of southeast European countries, said Moldova remained committed to a peaceful resolution of the Transnistrian conflict.",
        "“What the government is doing today is making small steps for the economic reintegration of the country,” she said.",
        "Oleg Serebrian, a Moldovan deputy prime minister, said the congress was a propaganda event, and that the breakaway region and all Moldova’s citizens were benefiting from Moldova’s push to join the European Union.",
        "The United States “firmly supports” Moldova’s sovereignty and territorial integrity, State Department spokesperson Matthew Miller said on Wednesday in Washington.",
        "“Given Russia’s increasingly aggressive role in Europe, we are watching Russia’s actions in Transdniestria and the broader situation there very closely,” Miller said, using another name for the region.",
        "Commenting on the congress, Russia’s Foreign Ministry said defending the interests of Transnistria’s citizens was a priority and that the request would be reviewed carefully, the RIA news agency reported.",
        "The region’s economy minister told the congress, held in the regional capital Tiraspol, that customs revenues paid into Transnistria’s budget had fallen by 18% under the new regulation.",
        "In a historic step, EU leaders agreed on Thursday (14 December) to open accession talks…",
        "“There is social and economic pressure on Transnistria, which directly contradicts European principles and approaches to the protection of human rights and free trade,” the resolution said.",
        "Last December EU leaders greenlighted the start of accession negotiations with Ukraine and Moldova.",
        "(Edited by Georgi Gotev)."
      ],
      "url": "https://www.euractiv.com/news/moldova-dismisses-transnistrias-request-for-russian-help/",
      "scraped_at": "2025-11-16T03:52:03.381403",
      "paragraph_count": 19
    },
    {
      "title": "Moldova says customs talks with Transnistria separatists 'difficult'",
      "content": [
        "A senior official of Moldova's pro-European government said on Wednesday (17 January) that his latest talks with the pro-Russian separatist Transnistria region had been \"quite difficult\" as tension rises in the three-decade-old standoff.",
        "A senior official of Moldova’s pro-European government said on Wednesday (17 January) that his latest talks with the pro-Russian separatist Transnistria region had been “quite difficult” as tension rises in the three-decade-old standoff.",
        "The region split from Moldova before the collapse of Soviet rule and fought a brief war against the newly independent state lying between Ukraine and Romania.",
        "Transnistria has since stood on Moldova’s eastern fringe with little turmoil or violence — 2,000 Russian “peacekeepers” remain on the line separating the two.",
        "A fresh dispute has emerged over Moldova’s imposition of customs duties on exports and imports from Transnistria – part of the ex-Soviet state’s efforts to join the European Union.",
        "Moldova’s deputy prime minister, Oleg Serebrean, said the latest talks between the sides on Tuesday, in Transnistria’s main town of Tiraspol, had focused on the new tax regime.",
        "“The meeting in Tiraspol took place in quite a difficult situation, both in national and regional terms,” Serebrean told a news conference in the capital, Chisinau. “But I cannot say that the meeting produced no results. We did get results.”",
        "“Our decision regarding [Transnistria’s] economic reintegration [into Moldova] is unshakeable and in stages we even plan the use of the MDL across all territory” – Oleg Serebrian, Moldova’s Minister of Reintegration, at 1+1 meeting with Ignatiev, Transnistria’s “foreign minister”pic.twitter.com/WOhLej5l8H",
        "— Paula Erizanu (@paulaerizanu)January 17, 2024",
        "Serebrean dismissed allegations that the regulations would hurt the region’s businesses, saying they involved modest increases in duty. He said the region’s residents would benefit from medical facilities and schools in the rest of the country.",
        "Three decades of negotiations have produced little movement towards resolving the dispute with the separatists, who rely heavily on Moscow for financial assistance.",
        "#Moldovawill join the#EUwith or without resolving the fate of its breakaway#Transnistriaregion, Oleg Serebrian, the country’s deputy minister in charge of reintegration, has told@BIRN_Network.https://t.co/dOOU75JrHl",
        "— Ian Bancroft (@bancroftian)January 17, 2024",
        "President Maia Sandu has said that Moldolva could press ahead with its bid to join the EU without Transnistria, citing the divided island of Cyprus as a precedent in membership talks.",
        "Sandu has denounced Moscow’s war in neighbouring Ukraine and singled out Russia — and endemic corruption — as the biggest threats facing her country, one of the poorest in Europe.",
        "Parts of Russian missiles have landed in Moldova. Separatist authorities last week accused Moldova’s authorities of training soldiers to launch attacks on its institutions and leaders.",
        "One-on-one talks with Transnistria are held under the auspices of the 57-nation Organisation for Security and Co-operation in Europe, which has been mediating for decades. They replaced a longstanding “5+2” format in which Russia, Ukraine and the United States participated, along with observers from the EU and the United States. That format was abandoned after Ukraine refused to take part alongside Russia, citing the Kremlin’s 22-month-old invasion."
      ],
      "url": "https://www.euractiv.com/news/moldova-says-customs-talks-with-transnistria-separatists-difficult/",
      "scraped_at": "2025-11-16T03:52:04.235832",
      "paragraph_count": 17
    },
    {
      "title": "Transnistria appeals to Russia for ‘protection’, reviving fears for Moldova breakaway region",
      "content": [
        "US says it is closely watching situation in key region on Ukraine border after officials asked Moscow for help against the government in Moldova",
        "The US has said it is closely watching the situation in the breakaway Moldovan region of Transnistria, after pro-Russian officials in the territory appealed to Moscow for “protection”.",
        "Transnistria, which borders war-strickenUkraineto the east, has maintained autonomy from Moldova for three decades with support from Russia, which has more than a thousand troops stationed there since a brief war in 1992.",
        "Since Moscow began its full-scale assault on Ukraine, Chișinău has been concerned the Kremlin could use Transnistria to open a new front in the south-west, in the direction of Odesa.",
        "The request forRussiato help Transnistria’s economy withstand Moldovan “pressure” was made after a meeting of hundreds of officials in the unrecognised region.",
        "The resolution came a day before the Russian president, Vladimir Putin, on Thursday makes his annual address to Russian lawmakers and as Ukraine suffers setbacks on the battlefield. There are suggestions Putinmight bring up the Transnistrian request in his speech and express support for the region.",
        "Moldova’s pro-European government dismissed the appeal as a propaganda event to gain headlines.",
        "The region, long seen as a potential flashpoint with Russia in Europe, held a “congress of deputies of all levels” after Moldova said it would require Transnistrian companies to pay import duties to the central budget from January.",
        "At the meeting, the congress passed a resolution saying it would appeal to both houses of Russia’s parliament “with a request to implement measures to protect [Transnistria] in the face of increasing pressure from Moldova”.",
        "Russian officials responded by saying that one of its “priorities” was to protect the thin sliver of land, which has been de facto controlled by pro-Russian forces since the collapse of the Soviet Union but is internationally recognised as part of Moldova.",
        "US state department spokesperson Matthew Miller said on Wednesday: “Given Russia’s increasingly aggressive role in Europe, we are watching Russia’s actions in Transnistria and the broader situation there very closely.”",
        "After Russia’s full-scale invasion of Ukraine in 2022,tensions surged around the separatist region, which says it has 220,000 Russian citizens. Relations between Moldova and Russia have also frayed as the government in Chișinău has steered a pro-European course.",
        "Moldova’s president, Maia Sandu, in Albania for a summit of south-east European countries, said her country remained committed to a peaceful resolution of the Transnistrian conflict. “What the government is doing today is making small steps for the economic reintegration of the country,” she said.",
        "Polish prime minister Donald Tusk said tensions in Transnistria were dangerous for the region. The problem “is not a new one”, he said, adding that the “threat of Russian intervention or at least some provocation there is something permanent”.",
        "The call for help from Moscow has fuelled comparisons with February 2022, when Russian-backed militants in eastern Ukraine called for protection against what they said were relentless attacks and shelling by Kyiv’s forces.",
        "Russia and Agence France-Presse contributed to this report"
      ],
      "url": "https://www.theguardian.com/world/2024/feb/29/transnistria-moldova-breakaway-region-russia-protection-appeal",
      "scraped_at": "2025-11-16T03:52:04.357205",
      "paragraph_count": 16
    },
    {
      "title": "‘Russia’s dirty money will hijack our democratic process’: how tiny Moldova fears Kremlin is fixing EU referendum",
      "content": [
        "Officials believe €100m has been funnelled into the country to influence the pivotal vote and the presidential election",
        "Last spring, customs officers in the tiny nation ofMoldovastruck gold. Acting on a national intelligence tip-off from, they intercepted more than 100 passengers arriving from Russia via Armenia, each carrying bundles of cash just shy of €10,000 – the threshold for mandatory declaration. In a single night authorities at Chișinău airport seized more than €900,000.",
        "Moldovan officials swiftly announced that the cash couriers were part of a scheme allegedly led by a Kremlin-linked fugitive oligarch and aimed at financing protesters and buying votes in this month’s presidential election and pivotal EU referendum.",
        "The operation offered an early indication of what Moldovan and western officials have described in interviews with theObserveras an unprecedented effort byRussiato undermine the country’s bid for EU membership and weaken the authority of its pro-western president through a series of destabilising campaigns.",
        "“Russia is pouring millions in dirty money to hijack our democratic processes. This isn’t just meddling – it’s full-blown interference aimed at destabilising our future. And it is alarming,” said Olga Roşca, a foreign policy adviser to the pro-western president, Maia Sandu.",
        "The election, set for 20 October, in which Sandu faces re-election, is to be held on the same day as a referendum asking Moldovans whether they support constitutional changes that could eventually enable the country – one of the poorest inEurope– to join the EU.",
        "Roşca said the government estimated that at least €100m was being funneled into Moldova from Russia to manipulate the elections and EU referendum. It is not the first warning about Russian interference: in June, the US, UK and Canada said Moscow was trying to meddle in Moldovan politics and would seek to provoke mass protests if its campaign fails.",
        "Since the breakup of the Soviet Union, Moldova has gravitated between pro-western and pro-Russian courses, though the shadow of the Kremlin has always loomed large. Moscow also has 1,500 troops stationed in Transnistria, a region run by pro-Russian separatists who broke away from the control of Moldova’s government in a brief war in the 1990s.",
        "Sandu, a former World Bank official, was electedpresident in November 2020, riding a wave of popularity as an anti-corruption reformer with a pro-European agenda. She has advocated a humble lifestyle – a sharp contrast to the bombastic, predominantly male politicians who have long dominated Moldovan politics.",
        "In a recent interview, the president said she was sharing a two-bedroom apartment with her mother, while in her asset declaration from 2023 her bank balance was recorded as $600.",
        "In 2021, Sandu’s pro-western party, PAS, won a majority in the country’s parliamentary elections, giving her unprecedented power to implement reforms and push the country toward the west. But, three years later, Moldova remains mired in economic and political instability.",
        "First, the country was plunged into an energy crisis when Kremlin-controlled Gazpromslashed gas suppliesto the country by one-third and demanded more than double the previous rates to maintain the flow, in what was widely seen as political payback from Moscow for Sandu’s pro-western stance. Then, Russia’s war on Ukraine pushed Moldova into a broader financial crisis.",
        "Located just a few hoursdrive from Odesa, Moldova took in the highest number of Ukrainian refugees per capita, placing immense strain on its healthcare system, public services, and infrastructure. Inflation surged byas much as 40%as trade with both Moscow and Kyiv sharply declined.",
        "Stray Russian missiles from the conflict added to the growing sense of danger, while the Russian troops stationed in Transnistria further amplified anxieties.",
        "“Sandu promised a lot, but the geopolitical situation has been very tough on her. They have not been able to deliver on all promises,” said a western official in Moldova, reflecting on the growing frustration among some Moldovans with Sandu and her party.",
        "“There is growing apathy and disappointment, which provides a fertile ground for Russia,” the official added.",
        "Sandu remains the favourite to win the first-round presidential vote against 10 challengers, but she is facing a tricky second-round runoff.",
        "She is also leading the “Yes” campaign for the EU referendum, with polls showing 55-65% of voters in favour of joining the bloc. In a major boost for Sandu, Moldova officiallybegan EU accession negotiations in June. However, scepticism remains high about the country’s ability to implement the necessary democratic and judicial reforms in the near future.",
        "Critics from the opposition have accused Sandu of politicising the referendum by holding it on the same day as the presidential election, suggesting that the move is designed to boost her own political chances. “The referendum is a very cynical move,” said Alexandr Stoianoglo in Chișinău, one of Sandu’s main rivals from the Russian-friendly socialist party, who is polling at 12%.",
        "“EU integration should not be used for personal gain,” he added.",
        "But those close to Sandu said Russia’s growing influence means the country cannot afford to wait. “We have a unique opportunity: Moldova has a pro-European president, parliament, and government. The EU is open to our membership, with all countries backing accession talks last June,” said Roşca. “Moldova’s survival as a democracy is on the line, and the geopolitical stakes are higher than ever,” said Roşca.",
        "The biggest threat for Sandu comes from abroad, say her supporters. In particular, the fugitive pro-Russian businessman Ilan Shor, a vocal – and wealthy – opponent of EU membership who has been sanctioned by the west.",
        "Shor was sentenced to 15 years in prisonlast yearin absentia in connection with his role in the disappearance of $1bn from Moldova’s banking system. He fled to Israel and then Moscow where he set up a political movement aimed at destabilising the current government in Chișinău.",
        "At a press conference last Thursday, national police chief Viorel Cernăuțanu accused Shor and Moscow of establishing a complex “mafia-style” voter-buying scheme and bribing 130,000 Moldovans to vote against the referendum and in favour of Russia-friendly candidates in what he called an “unprecedented, direct attack”.",
        "Officials in Chișinău also believe Shor is behind a wave of pre-election vandalism attacks on government buildings, accusing him of recruiting young people who were allegedly trained in Moscow to cause unrest in the country. “We are prepared for anything in the coming weeks,” said a security official in the city. “It will be a variety of misinformation campaign, violent street protests and crude vote buying,” they added.",
        "Shor did not reply to questions from theObserver. But he has done little to distance himself from the accusations of trying to interfere in Moldovan politics from abroad. Through the social network Telegram, he has offered to pay voters the equivalent of $29 if they registered for his campaign, promising money to people who would “convince as many people as possible at their polling station” to vote “no or abstain” in the referendum.",
        "He has publicly pledged to pay Moldovans for publishing anti-EU posts on Facebook and Telegram.",
        "The central “fear-mongering” narrative that Shor has been promoting centres around the claim that Chișinău’s pro-European policies are pushing the country towards war with Russia, said VadimPistrinciuc, the director at the Institute for Strategic Initiatives of Moldova, a thinktank.",
        "“We have never faced this level of foreign interference,” he added.",
        "Worryingly for officials in Chisinau, Shor’s tactics have proven effective elsewhere the country.",
        "Last year, Yevgenia Gutsul, a previously unknown Shor-backed candidate, caused a political earthquake by winning the elections of governor in Gagauzia, another small, Russian-speaking semi-autonomous region in the south of the country.",
        "Pro-Russian sentiments have always been high in Gagauzia, a region populated by a Turkic ethnic minority, which has had an uneasy relationship with the capital Chisinau since the 1991 breakup of the Soviet Union.",
        "But Gutsul’s rise from obscurity and her ties to the Kremlin has stunned even seasoned observers and have prompted questions over Moscow’s role in her elections.",
        "“She was polling at zero two weeks before the elections and then suddenly she appears and wins,” said Mihail Sirkeli, founder of Nokta, an independent media outlet based in Gagauzia.",
        "Gutsul, who has openly declared running “a pro-Russian party” and travelled to Moscow to meet withVladimir Putinafter her election, is currently under investigation for allegedly funnelling Russian funds to a party associated with Shor.",
        "“Shor is looking to repeat the Gagauzia playbook across the country,” said a western diplomat in Chisinau.",
        "For now, officials in Moldova believe Moscow is concentrating its efforts on influencing the EU referendum, rather than the presidential elections where Sandu remains by far the most popular politician.",
        "“If the referendum passes, it will lead to constitutional changes, which are harder to reverse in the long term compared to election outcomes,” said a senior Moldovan official.",
        "But even if Sandu survives this month’s vote and referendum, her team expects renewed Kremlin efforts next year when her party faces re-election in the country’s parliamentary elections.",
        "“Russia’s goal is clear: to keep Moldova stuck in a grey zone,” said Roşca. “If they lose Moldova, they lose a strategic foothold in the region.”",
        "This is the archive of The Observer up until 21/04/2025. The Observer is now owned and operated by Tortoise Media."
      ],
      "url": "https://www.theguardian.com/world/2024/oct/12/moldova-fears-kremlin-fixing-eu-referendum-russia",
      "scraped_at": "2025-11-16T03:52:04.567856",
      "paragraph_count": 41
    },
    {
      "title": "‘It’s better not to try our luck again’: how Russia’s wars left deep scars in Georgia and Moldova",
      "content": [
        "Voters have backed political forces that favour closer Moscow ties despite seeing their country’s future in Europe",
        "Lately, Levan cannot stop thinking about the time he saw Russian tanks roll into his hometown of Gori, an hour’s drive from Georgia’s capital, Tbilisi.",
        "In 2008, Gori was one of the places Moscow bombed and occupied during ashort and deadly warthat left 20% of the country – though not the city – under de-facto Russian control.",
        "“When Russia invaded Ukraine, we began to worry they might come here again,” said Levan, speaking in the central square of Gori, known as the birthplace of Joseph Stalin andwhere a museumdedicated to the Soviet dictator attracts thousands of tourists each week.",
        "About 1,200 miles to the west, Sergiu, 62, has his own experiences with Russian aggression.",
        "In 1991, he was drafted in the Moldovan capital, Chișinău, and sent to Transnistria to fight Russian forces after the restive region had broken away fromMoldova. The brief conflict ended in a 1992 ceasefire that left more than a thousand Russian troops stationed in Transnistria, which was granted autonomy but is internationally recognised as part of Moldova.",
        "Levan and Sergiu, both of whom requested their last names be omitted to speak freely, said the Kremlin’s wars had left deep wounds in their communities. They also saw their own country’s future inEurope, not Russia.",
        "Yet during an election in Georgia and a referendum in Moldova last month, polls widely seen as pivotal tests of whether the future path of the two former Soviet republics lay with Europe, Levan and Sergiu opted for political forces that favoured closer ties with Moscow, fearing that a pro-western government might provoke the Kremlin into a new war.",
        "The complex election results in these two small but politically significant countries have underscored the growing challenge the EU faces in expanding into territories that Moscow views as part of its sphere of influence.",
        "In Georgia, a ruling party viewed by most countries as increasingly Moscow-friendly and anti-liberalwon a parliamentary electionlast Saturday that was marred by reports of voting violations and fraud.",
        "And in Moldova, only a razor-thin majoritybackeda key referendum of joining the EU, while the country’s pro-western president, Maia Sandu, faces a tough election runoff this Sunday against a candidate who has called for a “reset” of relations with the Kremlin.",
        "Last month, the Guardian visited Moldova and Georgia. In both countries, many voiced concerns about living under the looming shadow of Russia’s war inUkraine. Some grappled with what they perceived as the harsh necessity of preserving peace – a reality that often overshadowed the allure of EU integration.",
        "“Peace is by far the most important objective for any government. It is better not to try our luck again and anger Moscow,” said Levan. He voted for the increasingly anti-liberal Georgian Dream (GD) party. It secured 54% of the vote in the parliamentary elections, a result that has in effect stalled the country’s longstanding aspirations to join the EU.",
        "Levan said he “fully agreed” with the party’s central campaign message: “Choose peace, not war”. He said he was worried the opposition would pull Georgia into a Ukraine-style conflict. Others in his hometown seemed to share his concerns – GD won 57% of votes in Gori.",
        "In the weeks leading up to the elections, the ruling party displayed crudebillboardsacross Tbilisi that featured images of bombed-out Ukrainian churches and sports arenas contrasted with idyllic scenes from Georgia.",
        "Speaking in Chișinău, Sergiu, who has retired from the military, said he voted in the country’s 20 October presidential election for the Moscow-friendly socialist candidate, Alexandr Stoianoglo, who advocates for better relations with Russia.",
        "Sergiu said it was naive to believe that Moscow would allow Moldova to join the EU. “Russia wants to keep us under their control forever. For now, we should stay neutral,” he said.",
        "Pro-western politicians in Moldova and Georgia have dismissed Russian invasion fears as scare-mongering orchestrated by the Kremlin, and instead stressed that only the west could guarantee long-term stability. They also reported that pro-Russian forces engaged in widespread disinformation and vote-buying campaigns had created a distorted picture of the actual public sentiment.",
        "Still, the voting in Georgia and Moldova suggests the threat of a Russian invasion resonates at least with certain parts of society, especially in conservative, poorer regions where economic progress has lagged and the promise of Europe feels distant and faint.",
        "Sign up toHeadlines Europe",
        "A digest of the morning's main headlines from the Europe edition emailed direct to you every week day",
        "after newsletter promotion",
        "It is a trend that has worried European officials. “We are losing the appeal of the EU to brute Russian force,” said one western official in Tbilisi.",
        "The outcome of the Georgian elections, where opinion polls once indicated that up to 80% of the population supported EU integration, has raised questions over the potency of Europe’s soft power. “The ruling party in Georgia has framed this vote as a choice between war and peace. For some, that choice feels more pressing than the question of being pro or against Europe,” the western official said.",
        "Ukraine’s increasingly bleak position on the battlefield, amid dwindling western support for Kyiv, has further validated those advocating for dialogue with Russia.",
        "“America and the EU have supported Ukraine and imposed massive sanctions on Russia. But it didn’t stop Russia … Ukrainian cities are ruined and so many people are dying,” said David Razmadze, a GD official in Gori.",
        "Razmadze said that in Georgia’s 2008 war with Russia, western allies did little to assist while Russian occupation troops remained stationed near Georgia’s border. “Georgians need to realise we are on our own. Europe will not come to our rescue,” he added.",
        "While the Kremlin has not directly threatened to invade either Georgia or Moldova, it has used its vast propaganda machine to highlight the devastation that followed Ukraine’s turn towards the west.",
        "The fear of a new Russian invasion is not the only factor keeping the region within its orbit. Both the GD in Georgia and pro-Russian groups in Moldova have stated their commitment to eventually joining the EU, but they have also criticised what they perceive as the west’s desire to compel their countries to abandon values of “family and church”.",
        "“The EU is forcing us to adopt LGBT legislation that goes against our traditions,” said Razmadze, saying he fully supported his party’s recentcrackdownon LGBTQ+ rights that critics say is modelled on Russia’s.",
        "In Moldova and Georgia, two devoutly Orthodox Christian countries, the issue of LGBTQ+ rights remains sensitive. Political forces in both have sought to galvanise anti-liberal sentiment by campaigning against what they perceive as western “moral degradation”.",
        "Russia’s economic influence also continues to loom large over the former Soviet region, casting a shadow on the promise of financial support that EU membership could offer.",
        "In Georgia, where the GD has refused to impose sanctions against Russia, direct flights from Moscow have recently resumed, bringing in thousands of Russian tourists each day. When the invasion in Ukraine prompted Moscow to reduce imports of French and Italian wines, it turned to Georgian wine, resulting in a profitable surge in exports for Georgia.",
        "In Moldova, some still yearn for the days of affordable Russian gas after Gazpromslashed suppliesto the country by a third and demanded more than double the previous rates to maintain the flow, a move that was widely seen as political payback for Sandu’s pro-western stance. Stoianoglo in his campaign has pledged to seek negotiations for new gas supplies from Russia.",
        "On Wednesday, the European Commissionannounced it would not recommendopening EU membership talks with Georgia unless the country changed course. In the same report, the commission kept the door open for Moldova, whose geopolitical future will be once again be on the ballot on Sunday."
      ],
      "url": "https://www.theguardian.com/world/2024/nov/01/russia-wars-georgia-moldova-europe-voters-closer-ties-moscow",
      "scraped_at": "2025-11-16T03:52:04.704676",
      "paragraph_count": 35
    },
    {
      "title": "Russia-Ukraine war at a glance: what we know on day 736",
      "content": [
        "Ukraine’s business how they use cruise missiles, says UK; Moscow warned against interfering in Transnistria after separatist request for ‘protection’",
        "Several members of Ukrainian special forces have died in an assault on the Tendra Spit in Kherson oblast, according to reports. Ukraine’s special operations forcesconfirmed the deaths, suggesting those who died had stayed behind to ensure the main contingent escaped.",
        "Russia claimed on Thursday that its forces hadre-entered the village of Robotyne, which Ukraine retook from the occupiers in August 2023. Russia’s state-run Interfax news agency cited the defence ministry saying troops had taken over some buildings but it was unclear whether Ukrainian troops had completely withdrawn. There was no confirmation from reliable sources. Robotyne lies between Avdiivka and Kherson, and south-east of Zaporizhzhia, on the frontline in Zaporizhzhia oblast.",
        "Ukraine’s forces shot down 10 Russian aircraft in as many days with the latest being two Russian Su-34 fighter-bombers on 27 February, according to the Ukrainian general staff.",
        "The UK government said on Wednesday that how Ukraine uses donated cruise missiles is “the business of the armed forces of Ukraine”after comments by Germany’s chancellor, Olaf Scholz, about possible UK and French involvement in targeting, and how Germany would not get involved in similar activity by sending its Taurus missiles.",
        "The Russian defence ministry claimed through state media on Wednesday that its forces hadcaptured Petrovske, formerly renamed by Ukraine as Stepove,in eastern Ukraine.",
        "Ukraine’s foreign ministry on Wednesday cautioned against anymeddling from Russia in Moldova’s neighbouring breakaway region of Transnistria, whose separatist leaders have supposedly appealed to Moscow for “protection” – a ploy that has previously been instigated by Russia to justify invading other countries.",
        "Moldova’s government has called the Transistrian separatists’ request apropaganda event. Transnistria is a primarily Russian-speaking region that is legally part of Moldova. In February 2022 leading up to the full-scale invasion of Ukraine, Russian-backed militants in Ukraine also asked for Moscow’s “protection”.",
        "Ukraine’s president, Volodymyr Zelenskiy, has promoted the idea of joint arms production at asummit of south-eastern European countries in the Albanian capital, Tirana. Zelenskiy proposed a Ukrainian-Balkans defence forum in Kyiv or a Balkan capital, similar to initiatives held last year with British and US weapons companies. A joint declaration signed by 10 countries at the summit said their leaders were ready to take part in a Ukrainian-led peace summit in Switzerland this spring to discuss Zelenskiy’s vision of peace.",
        "Albania, Bulgaria, North Macedonia, Montenegro and Romania are Nato members, have joined western sanctions against Russia, and sent arms and equipment to Ukraine. There are significant arms industries in parts of the Balkans left over from the former Yugoslavia. Serbia has not imposed sanctions on Russia, and neither Belgrade nor Kyiv recognise the independence of Kosovo, an Albanian enclave that claims independence, backs Ukraine and seeks EU and Nato membership.",
        "The EU should consider using profits from frozen Russian assets to buy military supplies for Ukraine, the European Commission president, Ursula von der Leyen, said on Wednesday. Japan has backed the idea, saying the EU proposals appear to have a basis in international law.",
        "Poland’s prime minister, Donald Tusk, said his government was considering a “temporary” closure of the border with Ukraine for goods, amid tensions over low-priced Ukrainian grain. “We are talking with the Ukrainian side about a temporary closure of the border, the cessation in general of trade.” However, Oleksandr Kubrakov, Ukrainian deputy PM, said: “Ukraine is not going to close its borders with Poland. No one from the Ukrainian side is negotiating about this. Our people are fighting for their existence in a war with the Russian aggressor. For us, a stable border is a matter of survival.”",
        "Ensuring Ukraine’s success against Russia is “the biggest test of our generation”, UK Foreign Office minister Andrew Mitchell said on Wednesday. He added: “At the G20 foreign ministers meeting it was clear there are few illusions about what Russia is doing and that the UN and Britain underlined how dangerous Putin’s actions are for the entire world.”",
        "Russian forces struck 11 communities along the Sumy oblast border in 42 separate attacks on Wednesday, the regional military administration reported according to theKyiv Independent. No casualties or damage to local infrastructure were reported.",
        "Russian foreign minister Sergei Lavrov will attend a diplomacy forum in Turkey from Friday, the countries’ governments said. Russian foreign ministry spokesperson Maria Zakharova said Lavrov would meet Turkish counterpart Hakan Fidan.",
        "A court in southern Russia jailed a Ukrainian man for 11 years and six months after convicting him of espionage for trying to procure secret missile components for Ukraine, Russian news agencies reported on Wednesday.",
        "China’s Eurasia envoy, Li Hui, will visit Russia, Ukraine and the headquarters of the EU this week for talks. The trip will represent “the second round of shuttle diplomacy on seeking a political settlement of the Ukraine crisis”, China’s foreign ministry said in a statement, adding Li would also go to France, Germany and Poland."
      ],
      "url": "https://www.theguardian.com/world/2024/feb/29/russia-ukraine-war-at-a-glance-what-we-know-on-day-736",
      "scraped_at": "2025-11-16T03:52:04.811669",
      "paragraph_count": 17
    },
    {
      "title": "How Moldovans bravely fought off Russian election meddling – and stood up for democracy",
      "content": [
        "Journalists and police challenged disinformation, intimidation and cash-for-vote schemes, while huge numbers turned up to vote",
        "Having lived in Britain for 12 years, I returned to my native Moldova in 2022 because I was worried that Russia’s war inUkrainewould spill into my country. Thanks to the Ukrainian resistance, the skies are still clear in Moldova. But in the past weeks leading up to the presidential runoff between the pro-European incumbent Maia Sandu and the Russian-supported former prosecutor general Alexandr Stoianoglo, I felt as if I might lose my country once again.",
        "The scale of interference in these Moldovan elections has been unprecedented. As reported by excellent independent journalists in the country, our law enforcement agenciesalleged the existenceof a large-scale, vote-buying scheme in the first round, run by Ilan Shor – a Russian-backed fugitive oligarch, who denies any wrongdoing.",
        "Before the second round,journalistsandothersreportedly received death threats in broken Romanian, pretending to be on behalf of Sandu’s team. On election day, the most popular polling stations across Europe for overseas Moldovans had their vote disrupted bybomb threats. The servers of the Central Electoral Commissionexperienced a temporary cyberattack. The police said they had “reasonable evidence” of illegal organised voter transportation in Russia, Belarus, Azerbaijan and Turkey; people from Transnistria, the region to the east of the country, bordering Ukraine and controlled by Russia,admitted to being transported.",
        "In addition to the alleged rigging, the internet, especially TikTok, wasflooded with anti-Europe disinformationbefore the EU referendum on 20 October.",
        "Despite all this, Sandu won. “They cannot steal as much as we can vote” was one of the informal slogans of this campaign. In the run-up to the second vote, the police updated the country daily about their arrests and seizures of cash related to the vote-buying scheme. This helpedsome people realisethat receiving payment for votes was illegal and not just a way of getting free money. It also helped mobilise 380,000 people in the capital city Chișinău – more than in 2020 – and an unprecedented 330,000 Moldovans in the diaspora, who amounted to almost 20% of the total number of voters, to come out and vote. Both electorates largely voted for Sandu.",
        "The pro-Russian Socialist party (PSRM), which supported Stoianoglo, said that it did not recognise the election results and that Sandu would only be the “president of the diaspora”. Yet 70% of the votes she receivedcame from within the country.",
        "While I lived in the UK, I queued for hours in order to vote in Moldovan elections at the various polling stations the state opened across London. In 2016, when Sandu first ran against PSRM leader Igor Dodon and lost to him,with thousands of other fellow citizens, I was not able to cast my vote because the polling station ran out of ballot papers. Some people had come from hundreds of miles away in order to vote.",
        "Moldova’s diaspora is relatively new and porous. People first started leaving in large numbersin the 2000s, when President Vladimir Voronin ruled the country with many leading members of the PSRM. Their first destinations were Russia, Italy or Portugal, where they did difficult jobs in construction or care, in order to provide for their families. (My history teacher went to look after the dogs of an Italian star in order to pay for her son’s university fees.) Since then, as many people’s parents and grandparents had been born when Moldova was part of Romania, about a million Moldovans obtained Romanian citizenship – including thetwo presidential candidates, Sandu and Stoianoglo.",
        "EU passports opened the way for Moldovans such as myself to benefit from better study and work opportunities across Europe, sendingvital remittancesback home. At the moment, about1 million Moldovanslive abroad and 2.8 million live in the country. Everyone has family members working abroad.",
        "Like me, a number of people have also returned from the diaspora to open their own businesses or join existing private or non-governmental organisations, as well as state institutions. Sandu did this in 2012, leaving her much better paid position at the World Bank in order to become minister of education. Natalia Gavrilița, whom I first met in 2018 in a Moldovan activist group called FreeMoldova in London, left development work to become minister of finance and then prime minister. The list goes on.",
        "Since the full-scale invasion of Ukraine, many Moldovans from the diaspora inRussiahave returned home. In the more Russian-speaking regions of Gagauzia and Transnistria, people have started emigrating to Poland and the Czech Republic. As I was travelling on the Chișinău-Prague bus to the small Romanian town of Sibiu last week, in front of me a man was listening to Russian propaganda. The second driver, meanwhile, put on a speech by Sandu while resting. Social media have polarised Moldovan society – just like the entire world. Russian propaganda is good at enhancing these cleavages.",
        "Moldova has shown resilience in the recent EU referendum and this presidential vote. But given the country is a parliamentary republic, the great battle will be next year in parliamentary elections. Until then, law enforcement has to get on top of vote-buying schemes. There must be better regulation of social media. And pro-European Moldovans have to collaborate and communicate better than the Russian propagandists.",
        "Paula Erizanu is a Moldovan journalist and writer based in Chișinău",
        "Do you have an opinion on the issues raised in this article? If you would like to submit a response of up to 300 words by email to be considered for publication in ourletterssection, pleaseclick here."
      ],
      "url": "https://www.theguardian.com/commentisfree/2024/nov/05/moldova-russia-election-meddling-democracy",
      "scraped_at": "2025-11-16T03:52:04.919331",
      "paragraph_count": 15
    },
    {
      "title": "Russia's Gazprom says it will stop supplying Moldova with gas next week",
      "content": [
        "FILE - Men stand next to pipelines of the national natural gas distribution network outside Ungheni, Moldova, March 4, 2015. (AP Photo/Aurel Obreja)\r\nCopyright Aurel Obreja/AP\r\nBy Daniel Bellamy with AP\r\nPublished on 28/12/2024 - 18:21 GMT+1\r\nShare\r\nComments\r\nGazprom said Moldovagaz “regularly fails to fulfill its payment obligations under the existing contract, which is a significant breach of its terms.”\r\nGazprom said the supply of gas will cease on January 1st at 0500GMT in an announcement that was not unexpected in Moldova's capital Chisinau.\r\n\r\nOn December 13th Moldova’s parliament voted in favour of imposing a state of emergency in the energy sector over fears that Russia could leave it without sufficient natural gas supplies this winter.\r\n\r\nAfter the vote Moldovan Prime Minister Dorin Recean said Moscow could deliberately weaponise energy flows to destabilise the country, and potentially leave people “in the middle of winter without heat and electricity.”\r\n\r\nRussian energy giant Gazprom supplies the gas-operated Kuciurgan plant, which generates electricity that powers a significant portion of Moldova proper. The plant was privatized in 2004 by Transnistrian officials and later sold to a Russian state-owned company. Moldova doesn’t recognise the privatisation.\r\n\r\nIn late 2022, Moldova suffered major power outages following Russian strikes on neighbouring Ukraine, which is interconnected to the Kuciurgan plant.\r\n\r\nTransnistria, which broke away after a short war in 1992 and is not recognised by most countries, also declared its own state of emergency in mid-December in case the region does not receive gas supplies.\r\n\r\nWhen Russia fully invaded Ukraine in 2022, Moldova, a former Soviet republic of about 2.5 million people, was entirely dependent on Moscow for natural gas but has since pushed to diversify and expand its energy sources.\r\n\r\nSebastian Burduja, Romania's energy minister, has previously promised that Romania has the energy resources to support Moldova, if it's need help.\r\n\r\nIn October, Moldova’s pro-Western President Maia Sandu won a second term in office, and a referendum voted in favour of securing the country's path toward the EU.\r\n\r\nThe two votes were overshadowed by ongoing claims of Russian interference to derail the country's westward shift in recent years. Russia denies it is meddling in Moldova."
      ],
      "url": "https://www.euronews.com/2024/12/28/russias-gazprom-says-it-will-stop-supplying-moldova-with-gas-next-week",
      "scraped_at": "2025-11-16T03:52:05.027033",
      "paragraph_count": 0
    },
    {
      "title": "Maia Sandu sworn in for second term as Moldova's president amid EU hopes",
      "content": [
        "MCopyright VADIM GHIRDA/AP\r\nBy Euronews with EBU\r\nPublished on 24/12/2024 - 16:13 GMT+1 •Updated 16:34\r\nShare\r\nComments\r\nThe role, which holds significant powers in areas such as foreign policy and national security, is limited by Moldovan law to two consecutive four-year terms.\r\nMaia Sandu was sworn in for her second term as President of the Republic of Moldova in a formal joint session of the parliament and Constitutional Court in the capital Chișinău on Tuesday.\r\n\r\nAfter taking the oath, Sandu expressed her gratitude to the people for their trust as she accepted the new mandate \"with humility and determination\".\r\n\r\nReflecting on her first term, she acknowledged the multiple crises faced but emphasised \"the determination and courage of Moldovans to choose to be on the good side of history.\"\r\n\r\nThe 52-year-old former World Bank advisor also said, \"We managed to open the door wide to the European Union,\" as Moldova, a candidate country, waits for Brussels to officially accept it.\r\n\r\nSince Russia launched its full-scale invasion of neighbouring Ukraine in early 2022, Sandu has repeatedly called on Western leaders to address Moldova's concerns, fearing that her country could be the next target of the Kremlin.\r\n\r\nADVERTISEMENT\r\nMoldova is home to a Kremlin-backed breakaway parastate of Transnistria, which hosts a large contingent of Moscow troops and a major Russian weapons storage facility.\r\n\r\nHowever, the territory remains internationally recognised as a part of Moldova. Most recently, in March 2022, the Council of Europe adopted a resolution that defining the territory as under Russian occupation.\r\n\r\nRelated\r\nPro-EU incumbent Maia Sandu re-elected to second term as president of Moldova\r\nSandu urged citizens to remain mobilised and optimistic, stating that Moldova is on the right path.\r\n\r\nThe pro-Western president secured a second term in a crucial presidential runoff against a Russia-friendly opponent. The race, according to Moldovan police, was overshadowed by claims of Moscow's interference, voter fraud, and intimidation.\r\n\r\nSandu received 55.03% of the vote, with a turnout of more than 1.68 million people, or around 54% of eligible voters, according to the Central Electoral Commission.\r\n\r\nHer competitor, former prosecutor general Alexandr Stoianoglo, received just under 45%.\r\n\r\nThe role carries significant powers in areas such as foreign policy and national security, which are restricted under Moldovan laws to a maximum of two consecutive four-year terms."
      ],
      "url": "https://www.euronews.com/my-europe/2024/12/24/maia-sandu-returns-office-for-second-term-as-president-of-moldova",
      "scraped_at": "2025-11-16T03:52:05.209396",
      "paragraph_count": 0
    },
    {
      "title": "Moldova declares an energy emergency over fears of Russian gas cut-off",
      "content": [
        "Pipelines of the national natural gas distribution network outside Ungheni, Moldova. 4 March 2015.\r\nCopyright Aurel Obreja/AP\r\nBy AP with Euronews\r\nPublished on 13/12/2024 - 16:39 GMT+1\r\nShare\r\nComments\r\nMoldovan PM Dorin Recean said his country faces an “exceptional situation” in which Moscow could deliberately weaponise energy.\r\nMoldova’s parliament on Friday voted in favour of imposing a state of emergency in the energy sector over fears that Russia could leave the EU candidate country without sufficient natural gas supplies this winter.\r\n\r\nA majority in Moldova’s 101-seat legislature voted to pass the state of emergency, which will start on 16 December and last 60 days.\r\n\r\nA special commission will urgently adopt measures to manage “imminent risks” if Moscow fails to supply gas to the Kuciurgan power plant, the country's largest, which is situated in the separatist pro-Russian Transnistria region.\r\n\r\nMoldovan Prime Minister Dorin Recean said his country faces an “exceptional situation” in which Moscow could deliberately weaponise energy flows to destabilise the country, and potentially leave people “in the middle of winter without heat and electricity”.\r\n\r\nKuciurgan plant\r\nRussian energy giant Gazprom supplies the gas-operated Kuciurgan plant, which generates electricity that powers a significant portion of Moldova proper.\r\n\r\nThe plant was privatised in 2004 by Transnistrian officials and later sold to a Russian state-owned company. Moldova doesn’t recognise the privatization.\r\n\r\nIn late 2022, Moldova suffered major power outages following Russian strikes on neighboring Ukraine, which is interconnected to the Kuciurgan plant.\r\n\r\n“This must be the last winter in the country’s history in which we can still be threatened with energy,” Recean said. “It is clear that these crises are deliberately provoked, and their goal is to create panic and chaos.”\r\n\r\nHe added that a cessation of natural gas could trigger economic and humanitarian crises, but vowed that nobody in Moldova would be left “in the cold and dark”.\r\n\r\nTransnistria, which broke away after a short war in 1992 and is not recognised by most countries, also declared its own state of emergency this week in case the region does not receive gas supplies.\r\n\r\nDiversifying energy sources\r\nWhen Russia fully invaded Ukraine in 2022, Moldova, a former Soviet republic of about 2.5 million people, was entirely dependent on Moscow for natural gas. It has since pushed to diversify and expand its energy sources.\r\n\r\nSebastian Burduja, Romania's energy minister, said late Thursday that Romania has the resources to support Moldova \"if the situation demands it,” saying it would be “a duty … in the face of the aggressions coming from the east.”\r\n\r\nIn October, Moldova’s pro-Western President Maia Sandu won a second term in office and a referendum also showed the electorate in favour of securing the country's path toward the EU.\r\n\r\nThe two votes were overshadowed by ongoing claims of Russian interference to derail the country's westward shift in recent years. Russia denies it is meddling in Moldova."
      ],
      "url": "https://www.euronews.com/business/2024/12/13/moldova-declares-an-energy-emergency-over-fears-of-russian-gas-cut-off",
      "scraped_at": "2025-11-16T03:52:05.298123",
      "paragraph_count": 0
    },
    {
      "title": "In Moldova's path towards the EU, political prisoners in Transnistria face challenges",
      "content": [
        "Copyright Euronews\r\nBy Zoltan Siposhegyi\r\nPublished on 21/11/2024 - 21:21 GMT+1\r\nShare\r\nComments\r\nWhen pro-European forces won in Moldova in November, their victory only passed by the slimmest of margins. A concerted Russian influence campaign was potentially behind it.\r\nA new government has formed in Moldova. Re-elected in early November, the pro-European President Maia Sandu has replaced only the ministers in charge of Interior, Agriculture and Infrastructure.\r\n\r\nInterior Minister Adrian Efros had earlier announced his resignation after it emerged that Moscow had used activists and hackers to interfere in the elections.\r\n\r\nIn the summer, Maia Sandu's lead looked confident and everyone expected a strong Yes vote in the EU accession referendum. In both cases, the margin of victory for the pro-Western forces was tiny.\r\n\r\nMost young people in Moldova align themselves with Europe, but why then did 49% of the population vote against the EU? International observers say the answer lies in Russia and its annexed state, the breakaway Transnistrian republic.\r\n\r\nTransnistria, a Soviet enclave\r\nThe border dividing Moldova into two parts is not recognised by the international community, yet it has stood for 34 years. The Transnistrian Republic has its own currency, number plates and, of course, flag. In the capital Tiraspol, time has stood still since the break-up of the Soviet Union. The monochrome of Lenin and Marx monuments is broken only by a statue of Harry Potter.\r\n\r\nHarry Potter statue\r\nHarry Potter statue Euronews\r\n2,000 Russian soldiers stationed Transnistria ensure that things are done according to Moscow's wishes. That is why, in this part of Moldova, Russia's invasion of Ukraine can only be referred to as a defensive war or a special military operation. Those who express opposition to the war often find themselves behind bars.\r\n\r\nHarsh conditions\r\nThis is what happened to Viktor Plescanov, the country's best-known political prisoner. In 2022, the 50-year-old engineer hung a Ukrainian flag on his terrace and posted \"Freedom for Ukraine\" on his social media, only to be confronted by the authorities shortly afterwards.\r\n\r\nIn September 2022, he was sentenced to three years and two months in prison without trial on terrorism charges.\r\n\r\nViktor Plescanov\r\nViktor Plescanov Euronews\r\n\"The conditions in prison were hellish. It was like the 19th century. This is not Europe,\" explained Viktor, who at one point gave up and attempted suicide. He also showed on his arm exactly where he had tried to slit his wrists.\r\n\r\nMeanwhile, his wife, Oxana went from embassy to embassy recruiting supporters and telling Viktor Plescanov's story to the world.\r\n\r\nEventually, under pressure from the OSCE and the US Ambassador in Chisinau, the Transnistrian leader Vadim Krasnozelsky pardoned Plescanov.\r\n\r\nADVERTISEMENT\r\nBut dozens of political prisoners remain in Tiraspol jails. This could be a serious obstacle to Moldova's EU accession, because if Moldovans were to join the integration process, Russian and Ukrainian separatists would come with them, something Brussels would prefer to avoid."
      ],
      "url": "https://www.euronews.com/2024/11/21/in-moldovas-path-towards-the-eu-political-prisoners-in-transnistria-face-challenges",
      "scraped_at": "2025-11-16T03:52:05.384870",
      "paragraph_count": 0
    },
    {
      "title": "US set to sanction Serbia’s main oil company over Russian ownership, Vučić says",
      "content": [
        "Britain and the EU would likely follow Washington in introducing sanctions against NIS, Serbian president says in TV interview.\r\n\r\nCopy Link\r\nFree article usually reserved for subscribers\r\nBULGARIA-RUSSIA-UKRAINE-CONFLICT-ENERGY-GAS-OIL\r\nNIS is majority-owned by Russia's Gazprom and Gazprom Neft. | Nikolay Doychinov/AFP via Getty Images\r\nDecember 14, 2024 11:42 am CET\r\nBy Jones Hayden\r\nSerbian oil company Naftna Industrija Srbije (NIS) faces financial sanctions from the United States as soon as next month because of its Russian ownership, Serbian President Aleksandar Vučić said late Friday.\r\n\r\nThe U.K. and the EU would likely follow the U.S. in introducing sanctions against the company, Vučić said in an interview with Serbian broadcaster Informer TV. That would mean that oil shipments through a pipeline from Croatia would be stopped, he said.\r\n\r\nNIS is majority-owned by Russia's Gazprom and Gazprom Neft.\r\n\r\n\"We got confirmation that in the next few days, the U.S. will introduce sanctions against NIS because of Russian ownership,\" Vučić told Informer TV. \"We are still waiting to get an official paper with details.\" he added.\r\n\r\nThe U.S. sanctions could take effect as soon as Jan. 1, Vučić said.\r\n\r\nThe U.S. government hasn't commented on the prospect of NIS sanctions. The U.S. Treasury Department did not immediately respond to a request for comment, Reuters reported.\r\n\r\nMeanwhile, Moldova’s parliament on Friday voted in favor of imposing a state of emergency in the energy sector over fears that Russia could leave the country without sufficient natural gas supplies this winter, according to media reports.\r\n\r\nThe state of emergency will start on Dec. 16 and last 60 days. A special commission will urgently adopt measures to manage “imminent risks” if Moscow fails to supply gas to the Kuciurgan power plant, the country’s largest, which is situated in the separatist pro-Russian Transnistria region, the AP reported.\r\n\r\nMoldova's Prime Minister Dorin Recean said his country faces an “exceptional situation” in which Moscow could deliberately weaponize energy flows to destabilize the country, and potentially leave people “in the middle of winter without heat and electricity.”"
      ],
      "url": "https://www.politico.eu/article/united-states-sanctions-serbia-oil-company-russia-ownership-gazprom/",
      "scraped_at": "2025-11-16T03:52:05.591995",
      "paragraph_count": 0
    },
    {
      "title": "Moldova’s pro-EU president on course for reelection",
      "content": [
        "Security services warned of Russian efforts to disrupt and distort voting at polling stations in Germany, Russia and the U.K.\r\n\r\n\r\nListen\r\nCopy Link\r\nScholz Receives Moldovan President Maia Sandu\r\nMaia Sandu was denied an outright majority in the first round of the presidential election two weeks ago. | Sean Gallup/Getty Images\r\nNovember 3, 2024 11:01 pm CET\r\nBy Gabriel Gavin\r\nMoldovan President Maia Sandu is on track to secure another four years in office following a runoff election on Sunday, despite widespread allegations that Moscow has been working to influence the vote against her.\r\n\r\nAccording to figures published by Moldova’s Central Election Commission, pro-Western former World Bank economist Sandu looks almost certain be reelected with around 55.4 percent of the vote in the second round, putting her ahead of rival Alexandr Stoianoglo, who drew around 44.6 percent. Some 99.82 percent of votes have been counted, according to the official results website.\r\n\r\n“Our people have united, and freedom and the citizens have won,” Sandu said in the early hours of Monday morning. “Peace and hope for a better life have prevailed!”\r\n\r\nStoianoglo, a former prosecutor from the pro-Russian Socialist Party, sought to portray himself as a unity candidate — vowing not to oppose European integration while also rebuilding relations with Moscow. Speaking as the polls closed, Stoianoglo said the people’s “choice will determine our future path.”\r\n\r\nSandu was denied an outright majority in the first round of the presidential election two weeks ago, and a simultaneous referendum on enshrining EU membership into the constitution passed by a razor-thin margin.\r\n\r\nAuthorities have accused the Kremlin of meddling in the votes, paying millions of dollars to ordinary people and orchestrating a campaign of propaganda and disinformation designed to undermine the country’s EU candidacy. Ultimately, those voting from abroad, including in Europe and the U.S., swung the referendum in favor of the pro-EU side.\r\n\r\nHowever, in a statement issued while polling stations were still open on Sunday, Sandu’s national security adviser, Stanislav Secrieru, said “massive interference” had been detected at overseas polling stations, with charter flights laid on to take Moldovans living in Russia to cast ballots in nearby countries like Belarus, Turkey and Azerbaijan.\r\n\r\n“Ongoing coordinated cyberattacks are targeting the connectivity of our national voter record systems, disrupting links between polling stations domestically and abroad,” he said.\r\n\r\nSecrieru also reported bomb threats had been phoned in to polling stations in Germany and the United Kingdom, while those casting ballots at the embassy in Moscow had been offered a free meal at a nearby restaurant.\r\n\r\nHowever, according to Moldovan Foreign Minister Mihai Popșoi, diasporans hit an all-time turnout record early on Sunday evening, with more than a quarter of a million voting “despite fake bomb alerts at several polling stations in Europe (likely perpetrated by (pro)Russian elements).”\r\n\r\nStatistics published by the Central Election Commission show that a clear majority of votes cast by Moldovans abroad were for Sandu.\r\n\r\nSpeaking overnight, Sandu said: “Moldova has been under an unprecedented attack in the history of all Europe — dirty money, illegal vote-buying, the interference in electoral processes by hostile forces from outside the country and by criminal groups, lies, sowing hatred and fear within society.”\r\n\r\n\r\nNinety-five percent of votes have been counted. | Daniel Mihailescu/Getty Images\r\nThere have been repeated warnings that Moscow has sought to oust the Moldovan president in the past, with Ukraine’s intelligence services last year alleging a plot to violently overthrow the government. A former Soviet Republic, Moldova borders Ukraine. Russia has stationed more than a thousand troops in the breakaway region of Transnistria, despite calls from the Moldovan government that they be withdrawn.\r\n\r\nMoldova began accession talks with the EU in June, and officials have set an internal deadline of 2030 to join the bloc.\r\n\r\nSiegfried Mureșan, a Romanian MEP and chair of the European Parliament’s delegation for relations with Moldova, told POLITICO on Sunday night that Sandu’s presumed win was a victory for “a future where the benefits of the European Union are felt in the lives and homes of all Moldovans.”\r\n\r\n“The pro-European victory in the presidential elections and the positive outcome of the referendum on joining the European Union make the Republic of Moldova a stronger state, better prepared for the accession process,” he said."
      ],
      "url": "https://www.politico.eu/article/moldova-pro-eu-president-maia-sandu-central-election-commission-world-bank-elections-moscow/",
      "scraped_at": "2025-11-16T03:52:05.712268",
      "paragraph_count": 0
    },
    {
      "title": "Moldovans head to polls in major test for EU future",
      "content": [
        "Authorities tell POLITICO they are working to fight Russian interference after first-round vote was marred by allegations of bribery and intimidation.\r\n\r\nCopy Link\r\nMOLDOVA-ELECTIONS-EU-REFERENDUM\r\nCurrent president of Moldova Maia Sandu. | Daniel Mihailescu/AFP via Getty Images\r\nNovember 3, 2024 10:13 am CET\r\nBy Gabriel Gavin\r\n`Moldova’s pro-Western president, Maia Sandu, faces a critical second-round election on Sunday that will determine who takes charge of the EU candidate country, amid widespread allegations of Russian interference.\r\n\r\nHundreds of thousands of voters at home and at polling stations abroad will cast their ballots for either Sandu or her pro-Russian challenger, Alexandr Stoianoglo. While Sandu won the largest share of votes in the first round of the presidential election two weeks ago with 42.3 percent, she failed to secure an absolute majority, requiring a runoff against her nearest competitor, former prosecutor and Socialist Party politician Stoianoglo.\r\n\r\nA simultaneous referendum on Oct. 20 on whether to enshrine European integration into Moldova’s constitution passed by the narrowest of margins — with 50.4 percent supporting the move and 49.6 percent against. Sandu accused Russia of “buying 300,000 votes” and using an unprecedented campaign of disinformation and propaganda to try to keep the former Soviet Republic inside its self-proclaimed sphere of influence.\r\n\r\nSpeaking to POLITICO, Olga Rosca, an adviser to President Sandu, said that authorities had stepped up efforts to avoid a repeat of the same tactics.\r\n\r\n“Authorities, working tirelessly, have implemented a dual approach — dismantling the network and discouraging potential participants,” she said. “All resources have been mobilized — from law enforcement efforts to public announcements on trolleybuses and in supermarkets, from civil society’s calls for integrity to journalists capturing the stories of those who’ve opted out of the scheme.”\r\n\r\nAccording to one person with knowledge of law enforcement’s efforts to safeguard the election, Russia’s efforts to interfere in the vote had become “more kinetic” in recent weeks. Five people were detained on allegations of plotting to start fires at the Central Election Commission, and preliminary investigations found messages purportedly showing they had received instructions from Moscow.\r\n\r\nLater on Sunday, Moldova’s national security adviser, Stanislav Secrieru, wrote online that the country was “seeing massive interference by Russia in our electoral process.”\r\n\r\nAccording to him, voters were being bused in from the Russian-occupied breakaway Transnistria region, while charter flights had been laid on to take Moldovans living in Russia to overseas polling stations in Belarus, Turkey and Azerbaijan. A video purportedly taken on board one such plane showed hundreds of people holding up Moldovan passports.\r\n\r\n“Cybersecurity agency reports the Central Election Commission’s voter education site was temporarily down this morning due to a DDoS attack,” he added.\r\n\r\nWhile Stoianoglo previously boycotted the EU referendum, a common position initially advocated by pro-Russian parties including his own Party of Socialists of the Republic of Moldova, he has since insisted he would not stand in the way of European integration, seeking to portray himself as a unity candidate. However, at the same time he has advocated rebuilding bridges with Moscow in the name of “national interests and stability.”\r\n\r\nRussia has troops stationed in Transnistria, which has remained de facto autonomous since the fall of the Soviet Union. The territory, which runs along the border with Ukraine, earlier this year called on the Kremlin for “protection,” even as Moldovan officials insisted they have no plans to force a change in the status quo.\r\n\r\nMoldova began accession talks with the EU in June, at the same time as Ukraine. Officials say they are hoping to join the bloc by 2030. However, despite updating the constitution to include that goal, Sandu losing the presidency or the pro-Western Party of Action and Solidarity failing to build a governing coalition after parliamentary elections next year, could derail the country’s efforts."
      ],
      "url": "https://www.politico.eu/article/moldovans-head-to-polls-in-major-test-for-eu-path/",
      "scraped_at": "2025-11-16T03:52:05.830765",
      "paragraph_count": 0
    },
    {
      "title": "Unquiet on the Eastern front: Why Brussels is losing to Moscow",
      "content": [
        "In countries seeking to join the EU, the European Dream is running into the Russian fist.\r\n\r\nCopy Link\r\nTOPSHOT-UKRAINE-RUSSIA-CONFLICT\r\nAlthough the threat of war is one common trope spread by Russian-linked disinformation in both countries, it is not the only one, pundits say. | Fadel Senna/Getty Images\r\nOctober 25, 2024 4:00 am CET\r\nBy Eva Hartog\r\nBRUSSELS — In June 2022, four months after Russia launched a blitzkrieg of tanks and bombs on Ukraine, the European Union countered with the most powerful weapon in its arsenal.\r\n\r\nAs artillery rained down on Ukrainian cities and towns and refugees poured into the EU, Brussels reached into its holster and pulled out — a carrot.\r\n\r\nEU officials announced that Ukraine and Moldova were to be allowed to begin negotiations to become part of the bloc. In December of the following year, a third former Soviet republic, Georgia, was granted the same “candidate status.”\r\n\r\nBefore Russia’s full-scale invasion, even such a distant invitation to join the club would have offered powerful encouragement to Ukrainians, Moldovans and Georgians eager for a piece of the European Dream.\r\n\r\nThese days, however, the pledge of a seat at the table is up against a far more concrete promise: the threat of Russian violence.\r\n\r\nIn Ukraine, where protesters once risked their lives to oppose the pro-Moscow government under the EU flag, a mention of the bloc’s thumbs up from the sidelines is most likely to be met with a despondent sigh. The things Kyiv needs right now — ammunition, air defense systems, real pressure on the Kremlin — are in short supply.\r\n\r\nIn Moldova and Georgia, too, two elections this week are demonstrating the fading power of the European dream. \r\n\r\nOn Sunday, Moldovans voted in a referendum on whether to lock EU integration into the country’s constitution. On Saturday, Georgians will cast their ballots in a parliamentary election featuring a ruling party widely seen as styling itself on the Kremlin. \r\n\r\nIn both cases, the votes have been cast as a choice between a future aligned with Moscow or Brussels, East or West — a decision that not long ago would have heavily favored the EU.\r\n\r\nFor Brussels, however, the early results are less than encouraging.\r\n\r\nWhile polls show a sizable pro-EU majority in both countries, that sentiment isn’t showing up in the voting booth.\r\n\r\nIn Moldova, the pro-EU vote won by only the slightest of margins, dealing an unexpected blow to its pro-Western president Maia Sandu. \r\n\r\n\r\nMoldovans voted in a referendum on whether to lock EU integration into the country’s constitution. | Dumitru Doru/EPA\r\nIn Georgia, the Georgian Dream governing party, responsible for passing a raft of repressive measures that threaten to swing the country toward Moscow, is predicted to emerge with the greatest numbers of votes.\r\n\r\nIn both cases, Russian disinformation and hybrid warfare are considered to have played an important role in swaying public opinion.\r\n\r\nDecrying the disappointing result in Moldova, President Sandu complained of “an unfair fight” against “foreign forces.” \r\n\r\nMoldovan officials estimate Russia spent around €100 million on an influence campaign, including the buying of some 130,000 votes through a shady network of proxies supported by Moscow.\r\n\r\nDomestic factors, pundits say, also played a role, with many Moldovans using the referendum to voice their grievances with the government.\r\n\r\nBut, together with the run-up to the election in Georgia, the vote in Moldova begs the question: At a time when Russia is flexing its hard-power muscles, can the EU still rely on its soft-power promises?\r\n\r\nWar and peace\r\nIn both Moldova and Georgia, the threat of the Russian military fist is no hypothetical. Russian troops have been stationed in Moldova’s Transnistria region since the region broke away with Moscow’s support in the 1990s. They’re also in Georgia’s Abkhazia and South Ossetia regions, following a 2008 incursion by Moscow’s troops.\r\n\r\nBut the war in Ukraine has brought the threat into even sharper focus. Neither Georgians nor Moldovans will have missed the Kremlin’s message to what it considers its backyard: Defy us at your peril.\r\n\r\nAhead of the elections, that fear of war coming to their homes next has been exploited by Moscow’ proxies to make voters second-guess their desire to join the EU. After all, the bloc’s promise of safety and prosperity is indirect and distant. The possibility of Russian violence is direct and real.\r\n\r\nNeither the message, nor the way in which it has been conveyed, have been very subtle. In the capital Tbilisi, billboards for Georgian Dream juxtapose images of Georgian streets with those of bombed Ukrainian cities.\r\n\r\n\r\nThe things Kyiv needs right now — ammunition, air defense systems, real pressure on the Kremlin — are in short supply. | Sergey Dolzhenko/EPA\r\n“Georgian Dream is putting out this ‘war and peace narrative’ which is shaping the information space,” said Eto Buziashvili, a research associate into influence operations at the Atlantic Council.\r\n\r\nIn Moldova, those encouraging a “no” vote in the EU referendum deployed a similar tactic, according to Dionis Cenușa, an associate expert with the Eastern Europe Studies Center: “If you don’t choose Sandu, then you’ll have peace.”\r\n\r\nMissed information\r\nAlthough the threat of war is one common trope spread by Russian-linked disinformation in both countries, it is not the only one, pundits say.\r\n\r\nAhead of the election in Moldova, an array of fake news on TikTok and Telegram warned that a vote for the EU would unleash all sorts of demons. \r\n\r\nOne common myth was that richer Europeans would sweep in and buy up their land. Another that Moldovan children would be subjected to so-called non-traditional values — a reference to LGBTQ+ people.\r\n\r\nIn the face of that blunt onslaught, civil society figures have called on the EU to adapt its own communication style. \r\n\r\nIn Georgia, for example, the ruling party has been “camouflaging itself as a pro-democracy, pro-EU force,” said Buziashvili. The party’s campaign banners feature the European flag and its politicians claim they are preparing Georgia for EU membership in the style of that of Viktor Orban’s Hungary. \r\n\r\nShe added that such a “deception campaign” calls for clear language and tangible measures like sanctions from Brussels. \r\n\r\n“Protesters tell me: We know that we should do our homework in terms of protesting and defending democracy,” said Buziashvili. “But we also want to see that Western countries are serious about who they cooperate with and call things by their names.” \r\n\r\nWith real membership of the bloc still years away (at best), the EU will need to do a better job at specifying what both its sticks and its carrots entail. \r\n\r\n\r\nThe possibility of Russian violence is direct and real. | Alexander Nemenov/Getty Images\r\nArtur Gurău, a 38-year-old Moldovan volunteer who helped campaign for the EU camp, said vote-buying schemes were successful because Russia’s proxies knew to target vulnerable swathes of the population.\r\n\r\nFor some of those living in a country listed among the poorest in Europe, even a one-time payment of several dozen euros could mean the immediate difference between a cold or warm home, as opposed to the uncertain deliverables of the castle in the sky promise of one day joining the EU.\r\n\r\n“People don’t believe anymore in promises; they don’t want a future in five or seven years,” Gurău said. “They want it now.”"
      ],
      "url": "https://www.politico.eu/article/russia-moscow-belgium-brussels-ukraine-war-defense-military-east/",
      "scraped_at": "2025-11-16T03:52:05.945111",
      "paragraph_count": 0
    },
    {
      "title": "Deciding Moldova’s European future",
      "content": [
        "Sunday’s results will show whether the country’s efforts to avoid their own ‘Brexit moment’ will succeed.\r\n\r\nCopy Link\r\nMOLDOVA-VOTE\r\nIn an echo of Brexit, surveys have found that just over 50 percent of Moldovan voters are in favor of the pro-EU position. | Daniel Mihailescu/AFP via Getty Images\r\nOpinion\r\nOctober 19, 2024 2:41 pm CET\r\nBy Benton Coblentz\r\nBenton Coblentz is a member of the Truman National Security Project and an MPA candidate at the Princeton School of Public and International Affairs.\r\n\r\nVoters in Moldova are heading to the polls Sunday to vote in a referendum on whether the country should enshrine its EU aspirations in the constitution. Current polls indicate a fragile majority in favor of the change, but various challenges — including Russian misinformation and the economic repercussions of the full-scale invasion of Ukraine — mean the results are far from certain.\r\n\r\nSo, might voters in Moldova surprise observers in their EU referendum, just as British voters did in 2016?\r\n\r\nIn an echo of Brexit, surveys have found that just over 50 percent of Moldovan voters are in favor of the pro-EU position. In a recent poll from the International Republican Institute, 53 percent of respondents were in favor of the change, while a poll by the Moldovan NGO Watchdog.MD found a similar 52 percent share in favor. And as election day has approached, polling indicators point to a growing majority — as well as a small minority planning to abstain. But the uncertainty remains.\r\n\r\nMeanwhile, as Moldova’s voters consider their options for the country’s long-term geopolitical future, they’ll also be rendering their judgment on incumbent President Maia Sandu’s bid for reelection.\r\n\r\nThe timing of all this is seemingly no coincidence. Sandu is currently leading the presidential race, polling at around 35 percent of the vote. And Moldova’s pro-European leadership likely hopes the two elections will be mutually reinforcing, with voters motivated to vote for the EU helping deliver a majority for Sandu — and vice-versa.\r\n\r\nHowever, this presumed positive correlation is far from guaranteed. Popular discontent has been fueled by the economic headwinds brought on by the war in Ukraine, leading to disruptions in Moldova’s supply chain and contributing to inflation — which, at certain points throughout 2023, reached over 30 percent. And given the perceived certainty of Sandu’s reelection, voters may well see a “no” vote in the referendum to be a safe way of expressing their dissatisfaction with her administration.\r\n\r\nThe opposition is well-positioned to capitalize on this discontent as well. Despite talk of a unified opposition candidate earlier in the year, more than a dozen candidates have now declared their intent to run. And the multiplicity is allowing these candidates to tailor their anti-EU and anti-Sandu messages in ways that will appeal to the country’s different voting blocs. For example, while some are calling for a “no” vote in the referendum, others are encouraging abstention, hoping the referendum will fail to achieve the constitutionally required 33 percent turnout.\r\n\r\nMoreover, these opposition efforts are all spearheaded with tacit support from Russian President Vladimir Putin’s government. Not only does Moscow have the power to exert influence through its hold on breakaway region Transnistria’s leadership, but it openly supports the opposition within Moldova itself. Just this month, Moldova’s National Police accused Russia of backing an attempt to bribe 130,000 voters — although the alleged orchestrator of the operation, convicted Moldovan oligarch Ilan Shor, has denied the allegations.\r\n\r\nRussia-fed misinformation has been stoking fears about Sandu’s potential reelection as well, claiming she’s preparing to drag the country to war with Transnistria, which is politically backed by Moscow. These misinformation efforts have also focused on tarnishing the EU’s reputation, claiming that membership will spread LGBTQ+ propaganda and lead to family separations.\r\n\r\nDespite Russia’s outside support for the opposition, however, Moldova’s pro-European forces are laying the groundwork for a successful close to their campaign. Sandu has actively promoted EU integration, holding large rallies in Chișinău and launching her reelection bid with a focus on EU aspirations.\r\n\r\nThe country’s civil society has been active too. For example, one campaign by the Institute for Politics and European Reform aired poignant ads in favor of the EU during the Euro football championships, presenting a screen split to compare visions of a life of peace and of war, calling to celebrate the “79 years of peace and respect for life” that European integration brought the Continent.\r\n\r\nThe EU itself has also done a good job promoting the efficacy of a strong relationship with Brussels. After being granted candidate status in 2022 and officially beginning negotiations in December 2023, Moldova hit major milestones in its accession process. It hosted the 2023 European Political Community Summit, attended by 45 European heads of state and government. And signs of EU-funded public works projects are now visible throughout the country, reinforcing the tangible benefits of EU association.\r\n\r\nHowever, even if all these efforts fall short, the format of the question posed to voters might help Moldova avoid the U.K.’s fate. In Britain, voters were faced with a broad question about leaving or remaining in the EU, whereas Moldovan voters will be specifically asked about including EU aspirations in their constitution.\r\n\r\nThus, while a failure in the referendum might challenge the government’s perceived legitimacy, it wouldn’t necessarily preclude Moldova from a European future. It would, however, make the 2025 parliamentary elections — where Sandu’s party currently faces bleak prospects — all the more important.\r\n\r\nOverall, Moldova’s pro-European forces have successfully laid the groundwork for a positive result in this year’s referendum — but they can’t afford to be overly complacent at the eleventh hour. And Sunday’s results will show whether Moldovans’ efforts to avoid their “Brexit moment” will succeed."
      ],
      "url": "https://www.politico.eu/article/movolda-europe-future-polls-ukraine-rusiia/",
      "scraped_at": "2025-11-16T03:52:06.075764",
      "paragraph_count": 0
    },
    {
      "title": "Moldova faces ‘existential’ EU vote in face of Russian interference",
      "content": [
        "Moscow is using cash and fear in an attempt to regain control of the former Soviet Republic, officials warn.\r\n\r\n\r\nListen\r\nCopy Link\r\nMOLDOVA-EU-POLITICS-HISTORY-WWII\r\nA victory for the pro-Western government would be a blow for Moscow's influence in the region, but would also amp up pressure on Brussels to move ahead with the accession process despite serious practical concerns. | Elena Covalenco/AFP via Getty Images\r\nOctober 17, 2024 4:01 am CET\r\nBy Gabriel Gavin\r\nMore than a million Moldovans will cast ballots on whether to join the EU on Sunday in a referendum that could pave the way to becoming a member of the bloc — or see the Eastern European nation pulled back into Russia’s orbit.\r\n\r\nA victory for the pro-Western government would be a blow for Moscow’s influence in the region, but would also increase pressure on Brussels to move ahead with the accession process despite serious practical concerns.\r\n\r\n“This is a historic decision for us, maybe the most important one since we gained independence from the Soviet Union,” said Cristina Gherasimov, Moldova’s deputy prime minister and EU integration chief, in an interview with POLITICO.\r\n\r\n“For us, EU membership is existential. It’s the only way to consolidate our democracy. There is no plan B — Russia and the future it wants for us is no alternative.”\r\n\r\nMoldova’s gravitation toward the West has increased in recent years, with the war in Ukraine raging just across the border. Officials warn that Russian intelligence is actively trying to disrupt the EU membership referendum, as well as a simultaneous election in which President Maia Sandu is seeking a second term.\r\n\r\n“We are seeing the classic hybrid toolbox Russia uses to influence elections, but the magnitude is really unprecedented,” Gherasimov said. “We see hybrid attacks on public institutions responsible for critical services like the post office and the airport. We see vote-buying. We see the use of local corrupt proxies and political parties — they’re given cash to destabilize the situation on the ground.”\r\n\r\n\r\nOfficials warn that Russian intelligence is actively trying to disrupt the EU membership referendum, as well as a simultaneous election in which President Maia Sandu is seeking a second term. | Daniel Mihailescu/AFP via Getty Images\r\nThe country’s police force told POLITICO earlier this month that over $15 million in Russian funds have been funneled into the bank accounts of more than 130,000 Moldovan citizens in the lead-up to the election. Sandu’s pro-EU government faces opposition from a handful of pro-Russian parties, and the EU has imposed sanctions on Ilan Shor, a prominent oligarch accused of working on behalf of the Kremlin.\r\n\r\nThe bloc has also stepped in to support Moldova by deploying a civilian advisory mission designed to help the fight against disinformation and covert influence.\r\n\r\nA draft statement to be issued by EU leaders following talks on Thursday, seen in advance by POLITICO, condemns “Russia’s persistent foreign information manipulation and interference to attempt to undermine democratic elections and the choice of the Moldovan people for a prosperous, stable and peaceful European future.”\r\n\r\nA country divided\r\nMoldova’s accession talks with the EU began in June this year, moving forward in the process at the same time as neighboring Ukraine. However, as with Kyiv’s application, the country faces significant hurdles to actually being admitted to the club of 27 countries.\r\n\r\nSince the fall of the USSR, a frozen conflict has simmered over the breakaway region of Transnistria, where Russia has stationed troops despite objections from the Moldovan government. The existence of the unrecognized state presents Brussels with a dilemma — with few European leaders relishing a repeat of the decision to admit Cyprus to the bloc while almost half of the island remains occupied by a Turkish-backed separatist government.\r\n\r\nLast year, Romanian MEP Siegfried Mureșan, chair of the European Parliament’s delegation to Moldova, warned that “Moldova cannot become a member of the EU with Russian troops on its territory.” According to him, the issue needs to be solved “before membership.”\r\n\r\nHowever, Gherasimov insisted that negotiations were moving ahead despite the dispute. “We have not seen any mentions in official documents to the Transnistria region, which for us is a clear signal that there is not going to be special focus on the region,” she said.\r\n\r\nAccording to Sandu and her ministers, the referendum to enshrine Moldova’s European dream in the constitution will prevent future governments from undermining its Westward trajectory. However, the high-profile vote will also be used to convince Brussels to move ahead with the membership process.\r\n\r\n“We hope this rare window of opportunity, where there is interest to talk about enlargement, will continue,” Gherasimov said. “We’re working on a domestic deadline to be ready for accession by 2030 — we want the EU to reciprocate because we need a credible commitment.”"
      ],
      "url": "https://www.politico.eu/article/moldova-eu-referendum-vote-russian-interference-enlargement-accession/",
      "scraped_at": "2025-11-16T03:52:06.197488",
      "paragraph_count": 0
    },
    {
      "title": "Russia meddling in Moldova elections, Western allies allege\r\n",
      "content": [
        "Canada, the United Kingdom and the United States accuse Russia of “seeking to undermine Moldovan democratic institutions.”\r\n\r\nCopy Link\r\nMOLDOVA-EU-POLITICS-HISTORY-WWII\r\nTwo polling stations established in Russia to count the votes of Moldovans living in that country have seen huge numbers of people lining up outside. | Elena Covalenco/AFP via Getty Images\r\nJune 13, 2024 4:43 pm CET\r\nBy Gabriel Gavin\r\nMoscow has engaged in hybrid operations to oust Moldova’s pro-EU government and to bring the Eastern European nation back into its orbit, a coalition of Western nations has alleged.\r\n\r\nA statement released Thursday by Canada, the United Kingdom and the United States accused Russia of “seeking to undermine Moldovan democratic institutions in the leadup to the October presidential elections and a referendum on Moldova’s EU membership.”\r\n\r\nThe trio of countries accused the Kremlin of supporting opposition candidates standing against President Maia Sandu and of “agitating criticism of the incumbent Moldovan president’s government and political party, in order to incite protests.”\r\n\r\nTactics have included “spreading lies” about the record of the current government, which last year secured European Union candidate status for the country, and promoting pro-Russian politicians including convicted criminal Ilan Shor. Shor was sanctioned by the EU last year over his alleged involvement in a plot to “destabilize” the country.\r\n\r\n“By revealing the Kremlin’s plot, we are making it clear to Moscow that we stand for free and fair elections and will not tolerate its attempts to meddle and undermine democratic processes,” the three countries said. “We urge the Kremlin to abandon these efforts to subvert Moldova’s democracy and to respect its sovereignty and the outcomes of free, fair, and independent elections.”\r\n\r\nMoldova and its Western allies have sounded the alarm in recent months over Russian efforts to destabilize the country. Last year, Ukrainian President Volodymyr Zelenskyy said Kyiv’s intelligence forces had  uncovered a Russian plan to overthrow Sandu’s government and to install its own proxy regime to control the country.\r\n\r\nAs it did with Ukraine, Russia has sought to keep Moldova within its self-declared sphere of influence as the Chișinău government has sought to establish closer ties with the rest of Europe. The Kremlin has responded to Moldova’s Western outreach by launching the sort of hybrid warfare it conducted against Kyiv from 2014 until the start of its full-scale invasion in 2022.\r\n\r\nRussia occupies the Transnistria region of Moldova, which runs along the border with Ukraine, and has hundreds of troops stationed there despite government calls for them to leave.\r\n\r\nThe EU, which last year opened accession talks with Moldova, has deployed a civilian mission to Chișinău to bolster its resilience against hybrid threats and to help it maintain sovereignty in the face of aggression from Moscow."
      ],
      "url": "https://www.politico.eu/article/russia-plot-meddle-moldova-election-uncovered-say-western-allies-maia-sandu-kremlin/",
      "scraped_at": "2025-11-16T03:52:06.325945",
      "paragraph_count": 0
    },
    {
      "title": "Moldova fights to free itself from Russia’s AI-powered disinformation machine",
      "content": [
        "With an EU referendum and a presidential election in October, the Ukraine-bordering Eastern European country fends off a barrage of disinformation, cyberattacks and Kremlin-backed political corruption.\r\n\r\nCopy Link\r\nFree article usually reserved for subscribers\r\nPolitico-Europe—AI-story-2-FA-WEB\r\nIlustration by Marcus Marritt for POLITICO\r\nBots and Ballots\r\nMay 7, 2024 6:00 am CET\r\nBy Mark Scott\r\nThis article is part of a series, Bots and ballots: How artificial intelligence is reshaping elections worldwide, presented by Luminate.\r\n\r\nCHIȘINĂU, Moldova — In the closing days of 2023, Moldova's pro-Western President Maia Sandu did something bizarre: She banned people from drinking a popular berry-infused tea.\r\n\r\nThe grainy video first appeared on Telegram, and then quickly across Facebook, just before New Year’s celebrations. It purportedly showed Sandu mocking the country’s poor by outlawing the picking of rose hip, a wild berry used in a traditional Yuletide drink. Sandu’s apparent reason for the ban: protecting the environment.\r\n\r\nThe mundane announcement caught the public’s attention in a country where the average monthly salary is less than $1,000. Many here still remember family members foraging for food in the forest during the impoverished Soviet era. So banning rose hips hit close to home. \r\n\r\nFor those who have accused Sandu of being a Western puppet, the video was proof, finally, that she was willing to abandon a cherished national tradition, all in the name of her pro-European Union agenda.\r\n\r\nThere was just one problem. The video was a forgery.\r\n\r\nIt was created, like many others that have targeted the 51-year-old politician, by artificial intelligence tools controlled by her political adversaries — almost all of whom have close ties to Russia. It was a deepfake. \r\n\r\n\r\n“These deepfakes are part of [a] new stage of Russia’s hybrid warfare against Moldova,\" Stanislav Secrieru, Sandu’s national security adviser, told POLITICO in his spartan office — decorated with only a few momentos — in the presidential palace in central Chișinău, across the street from the country’s imposing Soviet-era parliament.\r\n\r\nAfter the deepfake video went viral, Sandu was forced to debunk the falsehood in her New Year’s address on Facebook.\r\n\r\n\"What we expect is more of this in the months to come,\" added Secrieru.\r\n\r\nThis small Eastern European country — whose population is roughly equivalent to that of Paris or Chicago — has become ground zero in the battle between disinformation, much of it fueled by AI, and elections. \r\n\r\nWhile other democracies fear foreign governments’ meddling in their affairs, for Moldova, such interference has become an everyday reality. Some local officials and Western diplomats worry the ongoing interference efforts from Moscow may lay the groundwork among locals for a possible Russian invasion, at some point.\r\n\r\nLocated on the border of Ukraine, with a sizable Russian-speaking minority and a recent influx of Ukrainian refugees, Moldova holds a critical, double-barrelled vote in October: a presidential election and a referendum on joining the EU. Sandu, who’s seeking another four-year term, has urged voters to support the referendum. Parliamentary elections will also take place by July 2025, at the latest.\r\n\r\nAround 60 percent of Moldovans now support such closer ties with the West. The 27-country EU already represents the country’s largest economic partner, while hundreds of thousands of Moldovans already hold EU citizenship via close family ties to neighboring Romania. European Commission President Ursula von der Leyen, who’s seeking another five-year term in Brussels, has made Moldova — and the Harvard-educated Sandu — the poster children for the bloc’s march East.\r\n\r\nIt hasn’t gone unnoticed by the Kremlin and its local allies. \r\n\r\nRussian soldiers have a visible presence in Transnistria, an enclave of Russian speakers that unofficially broke away from Moldova at the end of the Cold War. In Gagauzia, an autonomous region in the country’s south, pro-Moscow politicians have courted President Vladimir Putin, who vowed to protect Moldova’s rebellious province. \r\n\r\nPro-Kremlin political parties — especially those tied to Israeli-born billionaire Ilan Shor, who has been sanctioned by the United States and EU for his efforts to undermine Moldovan democracy — will field candidates in October’s presidential election. In the run-up to that vote, Russian-linked hackers routinely target the country’s critical infrastructure, including a 36-hour cyberattack against government websites while POLITICO was in Moldova to report for this article.\r\n\r\n\"I slept four hours yesterday because we were in the meeting almost all night,\" said Alexandru Coreţchi, director of the country’s Information Technology and Cyber Security Service, in his agency’s headquarters, rubbing his eyes while fielding repeated phone calls as his team mopped up the latest attack.\r\n\r\nIn this instance, Moldova was targeted, he added, because about €1 million had been confiscated, collectively, from pro-Russian politicians as they flew back to Chișinău from a gathering in Moscow earlier in April. While in Russia, they were game-planning for October’s presidential vote and EU referendum.\r\n\r\n\"When we started to declare our intention to be an EU member state, the attacks became more violent, more sophisticated,\" said Coreţchi.\r\n\r\nAlexandru Coreţchi, head of Moldova’s Information Technology and Cyber Security Service, explains how he feels after his team repelled a 36-hour cybersecurity attack from hackers linked to Russia. The attackers targeted the government’s websites, on April 25, to disrupt Chișinău’s ability to pay its civil servants.\r\nNew tactics, same old strategy\r\nSitting in a Turkish restaurant in the Moldovan capital’s government quarter, Valeriu Pasha is almost blasé about the threat facing his small country.\r\n\r\nIn between bites of lamb stew and sips of Turkish tea — with loud club music thumping through the restaurant’s speakers — the thirty-something program manager for WatchDog.md, a local nonprofit tracking local disinformation, rattled off a list of those trying to sabotage the country’s upcoming elections.\r\n\r\nPro-Russian politicians peddling lies directly to unsuspecting voters. The Kremlin and the estimated $50 million it spent last year on undermining Moldova’s democracy. Almost no help from social media giants like TikTok and Telegram whose platforms have become the main vehicle for foreign interference.\r\n\r\nOn top of these existing threats, Pasha added a fourth: AI-powered bots. \r\n\r\nREPORTER'S JOURNAL\r\nIn April, Pasha and his colleagues recorded, for the first time, hundreds of fake comments on Facebook pages, including those of the president, Sandu, and even that of their own nonprofit, WatchDog.md.\r\n\r\nThe pro-Russian posts — almost exclusively in favor of Shor, the sanctioned politician — portrayed themselves as average citizens; included lifelike profile images, some of which were generated through AI tools; and contained grammatical mistakes to elude detection.\r\n\r\nThe bots' messages echo those promoted by real pro-Russian social media users. President Sandu was corrupt. Her pro-Western government was driving Moldova toward war. Only closer ties to Moscow, via electing politicians with links to the Kremlin, could guarantee the country's future. \r\n\r\nAI-powered bots are a mainstay on platforms like X (formerly Twitter). But in Moldova, automated political attacks — via AI-generated comments on Facebook pages — are a new threat.\r\n\r\n\"It's a simple tactic, but it's impactful,\" said Pasha, adding that most social networks rarely debunked falsehoods shared via comments. Of the almost 20 AI-powered Facebook profiles WatchDog.md supplied to POLITICO, only two were still active as of April 30. \"Bots are not new in other countries,\" he added. \"But, in Moldova, it's been a week.\"\r\n\r\nFor those fighting disinformation in Moldova — especially falsehoods paid for or promoted directly by the Kremlin — AI doesn’t represent a fundamental step change in a years-long fight that began long before ChatGPT and deepfakes became fashionable.\r\n\r\nInstead, the technology builds on other tactics, including local pro-Russian television stations, traditional media outlets also favoring Putin, and a stable of Kremlin-supporting politicians who, according to Moldova's national security agencies, are on Moscow's payroll. \r\n\r\nSeveral of these stations and news websites have been shut down amid accusations they were part of Russian influence operations. Sandu's opponents claim such sanctions unfairly hamper their legitimate right to free speech.\r\n\r\nInto that crucible of disinformation, AI has sped up how lies are made and shared. It hasn't completely rewritten the rulebook. \r\n\r\nEarly on, for example, deepfake videos of Sandu — some of which showed her urging Moldovans to vote for Shor, her pro-Russian rival — were uncanny, even initially fooling the president and her aides. But as the population grew accustomed to such attacks, many of which started on Russian-friendly Telegram channels like those associated with December’s 'rose hip' AI forgery, disinformation merchants switched to so-called 'cheapfakes' as a lower-cost alternative. \r\n\r\nThose now shared widely in Moldova, based on POLITICO's review of such content, include an actor with a passing similarity to Sandu portraying herself as the country's president. In these videos, AI is used to somewhat mirror the politician's voice and appearance versus recreating a cloned Sandu from scratch.\r\n\r\n\"Artificial intelligence is used heavily to discredit the authority of our leaders,\" said Ana Revenco, a former Moldovan interior minister who, as of October, heads the country's newly-formed Center for Strategic Communication and Combating Disinformation. \r\n\r\nThe agency, located in a nondescript two-story townhouse minutes from the president's office and next to Moldova's security services, coordinates how the government, civil society groups and Western allies respond to falsehoods aimed at undermining the country's national interest.\r\n\r\nAna Revenco, the newly appointed director of Moldova’s Center for Strategic Communication and Combating Disinformation, outlines the hybrid war threat now confronting the Eastern European country whose democratic institutions are still a work in progress.\r\nThe endgame: exhausting resources\r\nRevenco finds herself at the sharp end of this so-called hybrid war. That’s a mixture of disinformation, cyberattacks, political corruption and — if things go badly for the pro-EU government — Russian troops heading toward Moldova. \r\n\r\nShe also acknowledges the political difficulties for her fledgling agency. \r\n\r\nHer team must flag harmful falsehoods that undermine the country's democratic institutions. But Revenco can't be seen as taking sides in domestic politics. She also can’t be perceived as throttling people's right to free speech, whether on- or offline. Even if that means people promoting Moscow's interests. During her hourlong conversation with POLITICO, Revenco repeatedly steered clear of her personal political views.\r\n\r\n\"Russia, unfortunately, was here in Chișinău for years,\" she said matter-of-factly as she sat in her agency's boardroom on a hot spring morning in April. \"The war of aggression that they started two years ago increased, exponentially, the complexity and aggressiveness [of the Kremlin's disinformation attacks].\"\r\n\r\nFor Secrieru, Moldova's national security adviser, Moscow and its ever-evolving tactics, including the growing use of AI tools to sow disinformation, has one clear goal: exhausting his country's limited resources to push back.\r\n\r\nAhead of October's vote, local analysts and Western security experts expect the Kremlin to double its yearly influence spending — to roughly $100 million — in Moldova and bombard the Eastern European country with a cacophony of social media lies, paid-for politicians and old-school falsehoods via traditional Russian-speaking outlets. \r\n\r\nA recent spate of cyberattacks, including those targeting Moldova's health service and government payroll systems, were aimed at weakening people's trust in much-needed state services. Despite public commitments to protect the 2024 global election cycles, the biggest platforms have also had little interaction with the country’s officials or civil society groups, according almost all officials and civil society groups interviewed for this article.\r\n\r\nMeta said it would respond to Moldovan officials' reports of disinformation \"as quickly as possible.\" TikTok said it would keep vigilant about how bad actors used its platform around elections. A representative for Telegram did not respond to requests for comment.\r\n\r\n\"In December, there was a deepfake of the president shared widely across platforms. It was reported. NGOs reported it. Eventually, it was taken down,” said Secrieru.\r\n\r\n\"But the damage was done.\""
      ],
      "url": "https://www.politico.eu/article/moldova-fights-free-from-russia-ai-power-disinformation-machine-maia-sandu/",
      "scraped_at": "2025-11-16T03:52:06.454922",
      "paragraph_count": 0
    },
    {
      "title": "Moldova to allow billionaire’s pro-Kremlin party to field candidates in elections",
      "content": [
        "Members of a pro-Russian oligarch’s party can now run for president later this year.\r\n\r\nCopy Link\r\nMOLDOVA-POLITICS-ELECTION-ECONOMY-CORRUPTION\r\nThe Șor Party was named after Ilan Shor, a Moldovan businessman living in exile in Israel | Daniel Mihailescu/AFP via Getty Images\r\nMarch 27, 2024 6:22 pm CET\r\nBy Šejla Ahmatović\r\nMoldova’s highest court ruled on Tuesday that candidates from a pro-Russian political party headed by a fugitive billionaire can stand in the country’s presidential election later this year.\r\n\r\nThe Șor Party, named after Ilan Shor, a Moldovan businessman living in exile in Israel, was dissolved in June after a court found it had paid citizens to cause disorder and unrest. In October the Moldovan parliament amended the electoral code to bar individuals associated with parties deemed illegal or unconstitutional from running for office for three years.\r\n\r\nOn Tuesday, however, Moldova’s Constitutional Court ruled that the October changes to the electoral code were themselves unconstitutional, arguing the bill had been rushed through two sittings and that deputies hadn’t had enough time to draw up amendments.\r\n\r\nShor welcomed the verdict.\r\n\r\n“This decision not only restores the rights of individuals, but also calls into question the legitimacy of the past elections,” he said Tuesday in a Instagram post.\r\n\r\nShor was sentenced in 2017 to 7.5 years in prison — later increased to 15 years — on fraud and money laundering charges in relation to a $1 billion bank fraud from three years earlier. While under house arrest with an appeal pending, Shor fled to Israel in 2019. Last year he organized protests against Moldova’s pro-EU President Maia Sandu, calling on her to step down over her campaign to secure EU membership. Moldovan authorities said the demonstrations were part of a Russian campaign to replace the incumbent administration with a pro-Kremlin one.\r\n\r\nSpeaker of Parliament Igor Grosu said the government would respect the Constitutional Court’s March 26 ruling, but would make every effort to prevent anyone linked to criminal organizations from running for public office.\r\n\r\n“We will make adjustments in accordance with the court ruling, but we will not allow criminal groups to take control of the electoral process and undermine democracy in Moldova,” Grosu said.\r\n\r\nMoldova has long feared Russian intervention in its domestic affairs, most notably in the Kremlin-allied breakaway republic of Transnistria and the autonomous region of Gagauzia in the country’s south.\r\n\r\nTransnistria, which sits along Moldova’s border with Ukraine and is mostly populated by Russians, Ukrainians and Moldovans, has functioned as an unrecognized state since the fall of the Soviet Union, keeping its Soviet-era hammer and sickle flag and using Russian as one of its official languages. Moldova has repeatedly accused the Kremlin of attempting to destabilize the region.\r\n\r\nGagauzia is home to a Turkic minority that speaks Russian. Its leader, Yevgenia Gutsul, has close ties to both Shor and Russian President Vladimir Putin."
      ],
      "url": "https://www.politico.eu/article/moldova-allow-billionaire-ilan-shor-sor-pro-kremlin-party-sor-field-candidate-election/",
      "scraped_at": "2025-11-16T03:52:06.569205",
      "paragraph_count": 0
    },
    {
      "title": "Moldova turns to France in face of threats from Putin",
      "content": [
        "The two countries sign a defense deal as Paris boosts its presence in countries that Russia sees as its area of influence.\r\n\r\nCopy Link\r\nFree article usually reserved for subscribers\r\nFRANCE-MOLDOVA-POLITICS-DIPLOMACY\r\nFrance and Moldova signed an agreement of military cooperation in the hope of preventing Moldova from turning into another Ukraine | Pool photo by Christophe Ena via AFP/Getty Images)\r\nMarch 7, 2024 5:09 pm CET\r\nBy Laura Kayali and Gabriel Gavin\r\nPARIS — France doesn’t want Moldova to be the next Ukraine.\r\n\r\nOn Thursday, the two countries signed a deal to boost military cooperation. The pact comes as the Kremlin turns its gaze on the country of 2.6 million which is not a member of either the EU or NATO, and where Russian forces are stationed in the breakaway Transnistria region.\r\n\r\nThe agreement \"sends out a powerful message: Moldova is becoming stronger alongside France. With France's support, we know we're not alone,\" Moldovan President Maia Sandu, who traveled to Paris after attending the European People's Party congress in Bucharest, told reporters.\r\n\r\nSpeaking alongside Sandu, French President Emmanuel Macron said that \"Moldova's democratic reality and its aspirations for a European future — like those of Ukraine — actually represent a challenge for [President] Vladimir Putin's Russia, as it develops another model on its doorstep.\"\r\n\r\nFrance is increasingly interested in bolstering its presence in countries that Russia considers part of its sphere of influence. Last month, Paris struck new defense deals with Armenia, another small democracy working to distance itself from Russia.\r\n\r\nParis is trying to make Moldova more of a priority for the West; the country is specifically mentioned in the deliverables following an international leaders' summit summoned by Macron in late February.\r\n\r\nTensions between Moscow and Moldova have significantly increased recently as the country is set to begin negotiations to join the EU.\r\n\r\nThis week, Putin said he would support Moldova’s autonomous region of Gagauzia after meeting the territory’s pro-Moscow leader.\r\n\r\nLast month, authorities in Transnistria called on Moscow to “protect” it against “pressure” from Moldova.\r\n\r\nThat appeal has been noted in Moscow.\r\n\r\nKremlin spokesperson Dmitry Peskov said on Wednesday: \"Russia is open to provide this assistance, but we prefer settling all issues without any exceptions by means of a dialogue, a political dialogue,\" according to the TASS news agency.\r\n\r\nBeefing up defense\r\nWhile Moldova’s Foreign Minister Mihail Popșoi doesn't see an immediate threat of a Russian invasion, his country is nevertheless seeking to beef up its defenses.\r\n\r\nMoldova also decided this week to suspend its participation in the Treaty on Conventional Armed Forces in Europe, which sets limits for military equipment including battle tanks, artillery and warplanes.\r\n\r\n\r\nThe foreign ministers of Moldova and France sign the agreement for the defense cooperation | Christophe Ena/POOL/AFP via Getty Images\r\nThe defense cooperation agreement between Moldova and France paves the way for training the country's armed forces. French Armed Forces Minister Sébastien Lecornu — who traveled to Moldova last year to prepare the deal — discussed future arms contracts with his Moldovan counterpart Anatolie Nosatîi, according to a French official.\r\n\r\nA French defense mission will also be set up by the summer.\r\n\r\nIn an interview with POLITICO ahead of the meeting, Popșoi said that investment in the country’s air defenses was desperately needed. Several Russian missiles launched from the Black Sea have been detected flying through the country’s airspace en route to targets in Ukraine.\r\n\r\nIn September, Moldova purchased a Thales-made French Ground Master 200 radar — the first time the East European country has bought Western military gear. An option discussed in September was to acquire MBDA-made short-range air defense Mistral missiles.\r\n\r\nThe Moldovan government doesn't plan to stop there.\r\n\r\n“Of course, it’s very expensive and we don’t quite have the resources,” Popșoi said. “But we are looking at ways of how we can have the system in place so that we’re not in the position of the characters from the movie 'Don’t Look Up,'” the Moldovan minister added, a reference to the film where humanity ignores an approaching comet set to destroy the Earth.\r\n\r\nLaura Kayali reported from Paris. Gabriel Gavin reported from Chișinău, Moldova."
      ],
      "url": "https://www.politico.eu/article/we-know-were-not-alone-facing-putins-threats-moldova-turns-to-france/",
      "scraped_at": "2025-11-16T03:52:06.688198",
      "paragraph_count": 0
    },
    {
      "title": "Putin vowed to protect pro-Russia Moldovan region, its leader says",
      "content": [
        "Not Transnistria; another one.\r\n\r\nCopy Link\r\nRUSSIA-POLITICS-VOTE\r\nRussian President Vladimir Putin and Gagauzia leader Evghenia Guțul shake hands at an event near Sochi on March 6, 2024 | Pool photo by Mikhail Metzel via Getty Images\r\nMarch 7, 2024 12:35 pm CET\r\nBy Victor Jack\r\nTransnistria isn’t Moldova’s only problem child.\r\n\r\nRussian President Vladimir Putin said this week he would support Moldova’s autonomous region of Gagauzia after meeting the territory’s pro-Moscow leader, sparking further fears of destabilization in the Eastern European country as it races to join the EU.\r\n\r\nEvghenia Guțul, who has been in Russia since last week, said Putin “promised to extend support to Gagauzia and the Gagauz people in upholding our legal rights, our authority and positions in the international arena.”\r\n\r\n“I told [him] about the illegal actions of Moldova’s authorities who are taking revenge on us for our civic positions and for standing by our national interests,” she added, after meeting the Russian leader on Wednesday.\r\n\r\nGagauzia, a southern Moldovan region of about 150,000 people, is populated mostly by ethnic Turks and was granted autonomy from Chișinău soon after the collapse of the Soviet Union.\r\n\r\nGuțul’s comments come after authorities in Transnistria, a more prominent pro-Moscow breakaway territory in Moldova’s east that has hosted Russian troops for three decades, made similar calls to Moscow last month to “protect” it against “pressure” from Chișinău.\r\n\r\nTensions between the two regions and Moldova’s central government have spiked over President Maia Sandu’s strong support of Ukraine and pro-EU dreams. Moldova, wedged between Romania and Ukraine, is set to begin negotiations to join the bloc after the EU green-lighted the talks in December.\r\n\r\nBut the country’s Foreign Minister Mihail Popșoi dismissed claims Russia could order its troops into the country, despite the Kremlin’s all-out war on Ukraine raging near its border, telling POLITICO this week that Russia’s military power has waned “thanks to the sacrifice of the brave Ukrainian people.”\r\n\r\nSeparately on Thursday, Moldova’s prosecutor general said he had launched legal action against Guțul, who was elected the region’s leader last year, for unspecified “illegal actions.”"
      ],
      "url": "https://www.politico.eu/article/vladimir-putin-russia-moldova-gagauzia-evghenia-gutul/",
      "scraped_at": "2025-11-16T03:52:06.910289",
      "paragraph_count": 0
    },
    {
      "title": "Moldova dismisses idea that Putin could order Russian invasion",
      "content": [
        "Moscow’s military options have collapsed, Foreign Minister Mihail Popșoi said in exclusive interview with POLITICO.\r\n\r\nCopy Link\r\nFree article usually reserved for subscribers\r\nUKRAINE-RUSSIA-CONFLICT\r\nAlexander Nemenov/AFP via Getty Images\r\nMarch 6, 2024 6:00 am CET\r\nBy Gabriel Gavin\r\nCHIȘINĂU, Moldova — Moldova is feeling the heat from Russia, but it has a message for Moscow: know your limits.\r\n\r\nIncreasingly belligerent security threats from Moscow and hints that it could annex the Kremlin-backed breakaway region of Transnistria are chilling but they are out of touch with the reality of Russia's current military capabilities, Chișinău's top diplomat told POLITICO.\r\n\r\nForeign Minister Mihail Popșoi said that Russia's military power has waned \"thanks to the sacrifice of the brave Ukrainian people and the Ukrainian army,\" in one of his first interviews with international media since taking office a month ago.\r\n\r\n\"We are safe, although safe could be a strong word given the front lines are just 200 kilometers away,\" he said.\r\n\r\n\r\n\r\nFears have grown among Moldovans, the West and analysts that the Kremlin is stepping up its efforts to destabilize Moldova after Russian Foreign Minister Sergey Lavrov last week accused Chișinău's government of \"following in the footsteps of the Kyiv regime\" by \"canceling everything Russian\" and \"discriminating against the Russian language.\" A significant proportion of Moldova speaks Russian as a native language, and it is widely used across society without restrictions — a situation Popșoi reiterated the government has no intention of changing.\r\n\r\n\"Lavrov, the perception is, doesn't speak for the siloviki,\" he said, referring to Russia's bellicose security and military elites who call the shots when it comes to staging provocations. \"We know the situation on the ground, and most likely he knows the situation on the ground — he just has to play his role.\"\r\n\r\nThe veteran Russian envoy also sought to inflame tensions over Transnistria, a breakaway region inside Moldova's borders along the frontier with Ukraine, where Russia has stationed a contingent of troops and exerts control over the separatist administration. Last week, while stopping short of requesting annexation by Russian President Vladimir Putin, Transnistria's leaders called on Moscow to \"protect it against the pressure of Moldova.\"\r\n\r\n\"Our intelligence services, Ukraine's intelligence services, are clear that there is no premise for that,\" Popșoi said. \"They are showing us evidence that the situation on the front line, because Ukraine is so determined in defending its territory, makes it unlikely — although not impossible. The probability that the Russians would be able to advance and reach our territory is much lower now than it was two years ago.\"\r\n\r\nInstead, Popșoi continued, the threats are more likely part of \"a psychological operation\" designed to divide Moldovans and undermine the country's negotiations to become part of the EU.\r\n\r\nChișinău says it has long-term plans to peacefully reintegrate Transnistria, which is economically dependent on Moldova, and isn't considering a military solution despite speculation that Ukraine could easily drive out the ill-equipped Russian troops.\r\n\r\nAccording to Ivana Stradner, a research fellow at Washington's Foundation for Defense of Democracies, \"This is not the first time the Russians have employed hybrid warfare tools to destabilize Moldova and sow discord.\"\r\n\r\n\"Russia has no spare weapons to send to countries like Moldova, and they can't access Transnistria by air or by land,\" she said. \"But Vladimir Putin doesn't need to send tanks and jets to the country in order to create chaos — internal proxies can operate on his behalf.\r\n\r\n\"And by doing that he will put Europe on edge.\""
      ],
      "url": "https://www.politico.eu/article/moldova-russia-transnistria-mihail-popso-vladimir-putin-ukraine-war/",
      "scraped_at": "2025-11-16T03:52:07.027850",
      "paragraph_count": 0
    },
    {
      "title": "Transnistria begs Putin to ‘protect’ it against Moldova",
      "content": [
        "Kremlin-allied breakaway region claimed that Chișinău is ramping up “pressure” — and now it needs Moscow’s help.\r\n\r\nCopy Link\r\nDaily Life In Moldova Amid Fears Of Conflict Spreading Across Russian-backed Transnistria\r\nA region of Moldova is asking Vladmir Putin to \"protect\" it | Andreea Campeanu/Getty Images\r\nFebruary 28, 2024 3:08 pm CET\r\nBy Denis Leven\r\nPoliticians in Moldova’s Kremlin-backed breakaway region of Transnistria have appealed to Russian President Vladimir Putin to “protect” it against “pressure” from Chișinău.\r\n\r\n“[We resolved to] appeal to the Federation Council and the State Duma of the Russian Federation, requesting measures to protect Transnistria amidst increased pressure from Moldova,” read a resolution adopted by hundreds of Transnistrian politicians in Tiraspol, the region’s capital and largest city.\r\n\r\nThe appeal stops short of directly asking Moscow to integrate Transnistria into Russia, as had been predicted by one Transnistrian opposition politician in the days before the resolution was adopted.\r\n\r\nThe resolution noted that more than “220,000 Russian citizens” live inside the region. Moscow has recently made it easier for Moldovans to get Russian citizenship.\r\n\r\nTransnistria, which sits along Moldova’s border with Ukraine and is mostly populated by Russians, Ukrainians and Moldovans, has functioned as an unrecognized state since the fall of the Soviet Union, keeping its Soviet-era hammer and sickle flag and using Russian as one of its official languages.\r\n\r\nMoldova has repeatedly denied putting pressure on Transnistria, and accused Russia of destabilizing the situation in the country through its maneuvers in the breakaway region.\r\n\r\nPutin, who in violation of international law annexed multiple regions of Ukraine amid Russia’s ongoing full-scale invasion, is scheduled to make a lengthy address to Russia’s parliament on Thursday.\r\n\r\nIn 2006, an internationally unrecognized referendum was held on the “free accession of Transnistria to the Russian Federation,” which was officially backed by 98 percent of Transnistrian voters.\r\n\r\nSince then, however, Moscow has resisted any further steps toward annexation. Nevertheless, it maintains around a 1,500-strong military presence in the region, which prevents any possibility of reunification with Moldova. Moscow calls the troops “peacekeepers.”\r\n\r\nThe Russian foreign ministry said Wednesday that the protection of Transnistrian residents, including Russian citizens, is one of its priorities. They promised to consider the appeal.\r\n\r\nDenis Leven is hosted at POLITICO under the "
      ],
      "url": "https://www.politico.eu/article/breakaway-moldovan-region-transnistria-invites-russia-invade/",
      "scraped_at": "2025-11-16T03:52:07.146235",
      "paragraph_count": 0
    }
  ]
}