{
  "total_articles": 27,
  "scraped_at": "2025-11-14T13:14:01.267091",
  "articles": [
    {
      "title": "Is This the Next Crimea?",
      "content": ["By ANDREW CONNELLY March 19, 2014\r\nContinue to article content\r\n Facebook\r\n Twitter\r\n Comment\r\n Print\r\nContinue to article content\r\nThe Friday Cover\r\nThe Friday Cover for Jan. 10, 2020\r\n\r\nRead more \r\nAndrew Connelly (@connellyandrew) is a freelance journalist covering political developments in the UK and Europe.\r\n\r\nMoldova is not Ukraine. There has been no violent revolution on the streets of Chisinau, the capital of this largely agricultural country, and, though kleptocratic traditions permeate, the corruption here falls well short of the private zoos and sprawling dachasof Viktor Yanukovych, the ousted Ukrainian president. But the country is hopelessly divided on whether its future lies as an independent country in the European Union, reunification with linguistic brother country Romania, or allied with Russia, and its troublesome Transnistria region casts a long shadow across all of these issues. On Monday, Transnistria’s legislature petitioned Moscow to recognize the 1,600-square-mile territory as part of the Russian Federation—raising fears from folks like Sen. John McCain (R-Ariz.) that the breakaway republic could be the next Crimea.\r\n\r\nWhen a photographer colleague and I arrived in Chisinau last week, we weaved around the assembled old ladies in shawls selling seeds on the pavement and climbed into a battered marshutka (shared taxi), which somewhat fatefully was emblazoned with the Ukrainian, Russian and Soviet Union flags on the dashboard. At the end of the 40-mile trip eastbound to Tiraspol, capital of the twilight Transnistrian Republic, an aspiring state recognized by no other country in the world, the red carpet wasn’t exactly rolled out. At the border, we filled in our temporary migration cards, which were promptly returned with the time of maximum departure (10 p.m.) written at the bottom—our curfew. Transnistria, a long sliver of flatlands that is home to 500,000 people, does not attract a deluge of foreign visitors aside from journalists, pseudo-state tourists, committed history buffs and aficionados of the statelet’s robust cognac, which the Kvint factory has been brewing since 1897. Belching factories dot the landscape and despondent young cadets in camouflage mooch around the windy streets.\r\n\r\nWhy does Transnistria exist? In 1989 as the Soviet Union began to fray, nationalism was building in Moldova, with the majority Romanian-speaking population voicing its desire to be independent or united with Romania to the west. After the Latin alphabet was reintroduced after a few decades of hiatus under the Soviets, the Russian-speaking groups in Moldova, most of them ethnic Russians or Ukrainians populating the Transnistrian region, started to fear getting sidelined or worse, and declared their independence on Sept. 2, 1990 . Chisinau’s attempts to assert its sovereignty over the area prompted sporadic shootouts with Transnistrian separatists that spilled over into outright conflict, with both sides supported militarily by Romania and Russia, respectively. After several hundred deaths, a ceasefire was declared in July 1992. The new quasi-state’s position just to the east of the Dniester River, from which it derives its name, made it easier for a garrison to be set up, barricading it from Moldova proper. Around 1,500 Russian peacekeepers have been stationed in the territory ever since, and now their presence is under the spotlight more than ever before.\r\n\r\nMoldova, though, is moving in the opposition direction. In November 2013, the country signed an association agreement with the European Union—the same treaty that led to Yanukovych’s downfall in Ukraine. Moldova is considered poor even in comparison to neighboring Romania and Bulgaria, and with the average Moldovan currently taking home around $200 per month, access to EU markets could be a huge boon. Moldova is home to the largest wine cellars in the world and exports around 3 million bottles to Russia each year, though after Chisnau’s flirtations with the EU last year, Moscow jealously banned their import. Gas is exclusively imported from Russia and hence vulnerable to politically motivated disruptions.\r\n\r\nCentral Tiraspol is notable for its Soviet curiosities, including one of the odder giant statues of Lenin, seemingly affixed with a cape, and numerous hammer and sickle symbols displayed on billboards. On important holidays, such as Independence Day on Sept. 2, columns of tanks rumble and soldiers goose-step down the wide boulevards in scenes reminiscent of Moscow under Leonid Brezhnev. The pro-Soviet nostalgia has proven of limited use to the youth who are deserting the renegade nation in droves. Ditto for the Transnistrian ruble (equal to 8 cents), which makes an excellent souvenir but as a currency amounts to a financially crippling joke.\r\n\r\nFor all the independence talk, Transnistria would expire in a second if Russia withdrew its support, and the locals are under no illusions about this.Residents I spoke with said that although the “Transnistrian Republic” would be a nice idea, in reality Russia pays for salaries, pensions and infrastructure anyway so it wouldn’t be such a big step to be fully incorporated into the federation officially. Indeed, every referendum put to the population over the years has returned sentiments to this effect.\r\n\r\nMore prevalent, and indeed relevant, than the Soviet-era ornaments, is the ‘Sheriff’ brand, the name of the largest business in Transnistria, which runs everything from supermarkets to gas stations to bread factories, hotels, mobile phone networks and TV stations, right down to its own soccer team and a stadium supposedly built for around $200 million dollars. Moldovan investigative journalists have accused the business of being little more than a money-laundering front and personal piggy bank for the ruling elites. The previous Transnistrian president, Igor Smirnov, a man with a penchant for black Sobranie cigarettes and short-sleeved suit jackets, was rumored to have squirrelled away millions during his tenure, but he would only be one of many who profit from Sheriff’s monopoly. Other entrepreneurs exploit the region’s porous borders to Europe and make a tidy sum smuggling bootleg booze and cigarettes from the East. A 2002 EU report called Transnistria “a black hole in which illegal trade in arms, the trafficking in human beings and the laundering of criminal finance was carried on.”\r\n\r\nOne can hardly blame Transnistria for attracting a host of gangsters and brigands, given its inability to operate as a fully functioning state on the world stage and now, empowered by Crimea’s embrace of Mother Russia, the territory hopes to firmly anchor itself. But, after decades of yearning, will Russia accept? The conditions are ripe, though Transnistrians are not under threat from Chisinau in the same way that Crimeans claimed to fear radicals in Kiev. And as a landlocked territory 300 miles from the Russian border, there is no fleet to safeguard, Russian or otherwise. Nor is Transnistria so symbolic in Russian history. It is easy to see why Transnistrians would want to join Russia, but far harder to see why Russia would let them.\r\n\r\nPutin’s more likely aim is to lure, or bully, all of Moldova away from Europe. He is still hocking his alternate “Eurasian Union” proposal, which creates a customs zone between Russia, Belarus, Kazakhstan and other post-Soviet republics. We saw an office for this aspirant union in Tiraspol, and the Kremlin may try to gin up unrest in Transnistria in a bid to keep Moldova from fully signing the EU agreement later this year. Diplomats in Chisinau are already warning of Russian-sponsored shenanigans in the area should that happen, though many also remark that Transnistrian businessman secretly favor unification with Moldova to gain legal access to European markets.\r\n\r\nThe larger question for post-Soviet countries like Moldova is this: Where does Putin draw the line? There are many ethnic Russian communities dotted around Europe, particularly in the Baltic states, not to mention some opulent streets of West London. Is Russia committed to “liberating” them all? For Putin, Crimea was a prize worth taking; seizing an impoverished rump state like Transnistria would be all downside.\r\n\r\nAs I took the train from Chisinau to Odessa, which passes through Transnistria, tense- looking Ukrainian soldiers scrutinized passengers’ documents much more carefully than usual, perhaps reflecting fears, voiced to me by Ukraine’s ambassador to Moldova, that Russia is training provocateurs in the area to further destabilize his country. Ukrainian border guards are now blocking Russian men from crossing the border from Transnistria, according to Russian Deputy Prime Minister Dmitry Rogozin.\r\n\r\nWhatever the outcome, the fortunes of ordinary Transnistrians are unlikely to improve anytime soon: Just ask residents of Russia’s other de facto states, such as the disputed Georgian territories of South Ossetia and Abkhazia, if their fancy new passports, stamps and rubles have made them any richer."],
      "url": "https://www.politico.com/magazine/story/2014/03/transnistria-next-crimea-104820/",
      "scraped_at": "2025-11-14T13:13:55.044482",
      "paragraph_count": 0
    },
    {
      "title": "EconomyWidespread concern voiced ahead of EU's landmark trade deal with Moldova",
      "content": ["SHARE:\r\nPublished 11 years ago on May 21, 2014By Martin Banks\r\n\r\nSignup to our weekly newsletter to receive exclusive interviews, articles & videos.\r\nEnter your email address\r\n \r\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. You can unsubscribe at any time.\r\n\r\nbg-2EU council chief Herman Van Rompuy has confirmed that the signature of an association and free trade pact with Moldova will take place on 27 June in Brussels.\r\n\r\nAs the bloc presses ahead with deeper ties with East European nations in defiance of Russia, it was also recently announced that Moldovan citizens will no longer require visas to travel to the EU.\r\n\r\nBut this and other recent developments, such as Moldovan Prime Minister Iurie Leanca saying on Tuesday (20 May) that the country aims to join the EU by 2019, has merely served to reopen debate about the country's suitability for closer ties with the EU.\r\n\r\nAs part of its response to the Ukraine crisis, the EU has said it will accelerate the partnerships with states like Moldova but, lest it be forgotten, Ukraine's quest for EU ties triggered the current crisis in relations with Moscow.\r\n\r\nIs the same about to happen with Moldova?\r\n\r\nWhat appears clear is that the EU and Russia are locked in a Ukraine-type tug of war on Moldova.\r\n\r\nRussia insists that Moldova's EU rapprochement will jeopardize the future of Transnistria, a breakaway territory located on the border between Moldova and Ukraine.\r\n\r\nOne centre-right Polish MEP told EU Reporter: \"Some might argue that there is a contradiction in the EU's approach. After all, one of EU’s top demands for Moldova is that it still has to ´intensify  the fight´ against corruption at all levels.”\r\n\r\nIndeed, there are various concerns over Moldova which include the fact that it remains one of the major players in the sex trafficking industry.\r\n\r\nMoldova's National Bureau of Statistics estimates 25,000 Moldovans, including men, women and children, were trafficked abroad in 2008.\r\n\r\nAccording to the International Organization for Migration, the majority of victims are women and girls who are trafficked for the purpose of sexual and labour exploitation.\r\n\r\nMeanwhile, recent  European Commission report says countries round the EU’s southern and eastern rim, including Moldova, are seeing an increase of instability, authoritarianism and corruption.\r\n\r\nEU enlargement commissioner Stefan Fuele noted the EU spent €2.6 billion on \"neighbourhood policy\" states last year and has earmarked €15.4 billion for 2014 to 2020\r\n\r\nThese include Moldova, a former Soviet republic which was part of Romania before being annexed by the Soviet Union during World War II.\r\n\r\nLandlocked between Romania and Ukraine, Russian is widely spoken in Moldova and it has an ethnic Russian population.\r\n\r\nIn fact, Moldova, despite being the darling of EU officials, has the lowest income per capita of any of the Eastern Partnership countries.\r\n\r\nThe EU allocated €526 million to Moldova between 2007 and 2013 but its gross national income of US $2,250, despite increasing four-fold since 2002, is only a quarter of that of neighbouring Romania.\r\n\r\nAccording to the Program for International Student Assessment, Moldova remains at the bottom of European rankings in terms of quality of education and Moldova's Institute of Strategic Research and Reforms predicts that, if the trade deal with the EU is signed, Chisinau will have to implement over 300 directives in three to four years.\r\n\r\nMany question its ability to undertake such a task.\r\n\r\nFurther, the importance of keeping both export directions open is underlined by the fact that while 50% of Moldova's trade goes to the EU, 50% goes to CIS countries.\r\n\r\nWhile Chisenau, for some, is seen as the champion of the EU's Eastern association process for now, things could heat up this year with a victory for the Communist opposition in November's election likely to delay its EU integration.\r\n\r\nLast May, concern was voiced at EU level when Moldova's parliament gave itself powers to sack Constitutional Court judges and change election rules, moves Brussels said would harm the country's bid for closer ties with the EU.\r\n\r\nThe laws were part of \"a worrying new pattern of decision-making in Moldova ... where the institutions of the state have been used in the interest of a few,\" EU officials said.\r\n\r\nAny assessment of Moldova´s suitability for signing an Association Agreement should also take account of what is happening \"on the ground\" on this issue.\r\n\r\nCurrently, there are divisions in Moldovan society over which is the best way to go - signing the deal or not. In asking if Moldovan society supportive of the agreement it is worth recalling that an overwhelming majority of voters in a 2 February referendum held in the autonomous Moldovan region of Gagauzia voted for integration with a Russia-led customs union.\r\n\r\nThe chairwoman of Gagauzia's election commission, Valentina Lisnic later said that 98.4 percent of voters had chosen closer relations with the CIS Customs Union.\r\n\r\nIn a separate question, 97.2% were against closer EU integration.\r\n\r\nGagauzia Governor Mihail Formuzal does not hide his personal preferences, saying: \"I think that for the next 10 years it is in our interest to be in the customs union. I think that would enable us to modernize our economy, secure reliable markets for our goods.\"\r\n\r\nHrant Kostanyan, head of EU foreign policy at CEPS (Centre for European Policy Studies), said: \"Moldova has to engage in serious reforms adopting and implementing big part of the EU legislation as envisioned in the agreement. This is indeed challenging for Moldova since comprehensive domestic reforms require significant costs and political will.The implementation has to be carried out by Moldovan government.\"\r\n\r\nDmitry Rogozin, Russia's deputy PM and special envoy on Transniestria, agrees, saying that if the  EU signs the deal next month he “will insist on revising economic relations with Moldova”, which is 100 percent dependent on Russian gas.\r\n\r\nMoldova, he says, should hold elections before signing anything, with the pro-Russian opposition, the Communist party, polling high before a scheduled vote in November.\r\n\r\nWith Ukraine being torn apart, Willy Fautre, of Brussels-based Human Rights Without Frontiers, predicts, \"Moldova will certainly be the next battlefield. The EU neighbourhood policy has totally failed in the case of Ukraine and there is no chance of better success with Moldova.\"\r\n\r\nSome EU government ministers are sympathetic to Russia's concerns.\r\n\r\nAustria's foreign minister Sebastian Kurze said if the EU signs deal with Moldova  it should also offer a “long-term” free-trade perspective to Russia \"so these countries are not torn between the EU and a Eurasian customs union.\"\r\n\r\nKurz said that he did not live through the Cold War and does not want a new one.\r\n\r\n“It makes no sense to pretend Russia doesn't exist and that these countries don't have economic relations with Russia … We don't need a confrontation between the EU and Russia,” he said.\r\n\r\nElzbieta Kaca,  a researcher at Pism, a Warsaw-based think tank, says that EU aid for reforms in Eastern Partnership countries like Moldova has so far failed to bring tangible results.\r\n\r\nFor seven years now, the EU has made direct transfers to the state budgets of its eastern partners (minus Belarus) to support reforms in anything from energy and justice to water sanitation.\r\n\r\nA total of around €1.2 billion, 60 percent of bilateral aid, was envisaged for this so-called budget support, with Moldova being among those receiving the highest amounts.\r\n\r\nShe asks, \"What happened with this aid, given the different attitudes of eastern governments to EU-style reforms, let alone their problems with corruption and inefficient public administration? \"\r\n\r\nThe answer from a major research project carried out at the Polish Institute of International Affairs (Pism) is that too often nothing happened. In the cases of Moldova and Georgia, Brussels managed to release around half the promised resources; but due to lengthy procedures, the majority of operations have not yet been finalised.\r\n\r\nWhere the EU did manage to spend money Kaca says it brought \"very slim\" results. The recipient administrations were at ease drafting strategies, but implementation lagged behind.\r\n\r\nGernot Erler, Germany's new chief of relations with Russia and the eastern neighbourhood, warned that if countries like Moldova enter a \"deep free trade agreement\" with the EU, Moscow fears that these markets will be flooded with cheap Western products, which would undermine Russian exports.\r\n\r\n\"I can understand this concern. I don't know what the solution will look like, but it seems possible and this is currently being assessed by experts,” he noted.\r\n\r\nFurther comment comes from UK Foreign Minister William Hague who said recently that he wants Moldova \"to make more progress on reform and in the fight against corruption\". UK Independence Party MEP Roger Helmer said: \"I should have thought that the EU had done enough damage in the Ukraine, and would avoid prodding the Russian Bear again for a little while. If Moldova is anything like Bulgaria, Romania and Croatia, then it would not be ready for EU membership.\"\r\n\r\nA joint statement following the meeting on 15 May between the European Commission and the Moldovan government reiterated the need to \"fight corruption, including high-level one, reform the justice sector and improve the business and investment climate.\"\r\n\r\nCommission spokesman Peter Stano told this website, \"We are stressing that the association agreement is not a choice between Moscow and Brussels, it is a choice for more stable, more prosperous future. Closer cooperation brings benefits for all and previous examples have shown that the agreement contributes to job creation, increase of GDP, investment and better choice and lower prices for consumers. It is exactly with the AA/DCFTA we think Moldova will head into a future where its modernised economy will be able to sustain the country without outside dependency. And it is not at Russia's expense because Russia can benefit from this too.\"\r\n\r\nEven so, Georg Zachmann, from the leading Brussels-based Bruegel think tank, cautions: \"In economic terms, signing the DCFTA between the EU and Moldova might have a short-term cost for Moldova in case Russia will use its economic leverage, for example, cutting remittances, gas exports and imports from Moldova.\"\r\n\r\nAnother respected commentator, Michael Emerson, of the Centre for European Policy Studies, declared: \"Is Moldova ready for EU membership? Of course not.\""],
      "url": "https://www.eureporter.co/economy/2014/05/21/widespread-concern-voiced-ahead-of-eus-landmark-trade-deal-with-moldova/",
      "scraped_at": "2025-11-14T13:13:55.044482",
      "paragraph_count": 0
    },
    {
      "title": "Interview: Africa and Ukraine 'have a lot to offer each other'",
      "content": ["SHARE:\r\nPublished 12 years ago on May 6, 2014By EU Reporter Correspondent\r\n\r\nSignup to our weekly newsletter to receive exclusive interviews, articles & videos.\r\nEnter your email address\r\n \r\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. You can unsubscribe at any time.\r\n\r\n2014_04_29_498_PLENARY_SESSION_014By Mass Mboup\r\n\r\nEU Reporter's correspondent speaks exclusively with the former president of Ukraine, Viktor Yushchenko (pictured, left), about the differences and similarities between the two places, and the ongoing co-operation that needs to be maintained as the political crisis continues to plague the former Soviet country. The interview took place in Brussels, where Yushchenko was taking part in the plenary session of the EU's Economic and Social Committee (EESC), at the invitation of its President Henri Malosse (pictured, right).\r\n\r\nEU Reporter: When you were president, did you have any opportunities to go to Africa to meet heads of state there? \r\n\r\nViktor Yushchenko: I had several visits to the African Congress. I was at a meeting of the league of the African States. I made official visits to Egypt and Libya. We worked actively with the World Food Organization, they were interested in using our grain production facilities. We had some interesting dialogues. There is much potential in working with Africa.\r\n\r\nI always thought we could play an important role in Africa. I think we have a lot to offer each other; our political systems, economic co-operation, building bridges, meeting each other. We actually discussed the option of student exchange programmes, because in the past lots of students from African countries started to study in Ukraine. We also discussed  how to train and educate doctors on the basis of our medical universities, and we have good co-operation on  some African educational issues.\r\n\r\nWhat kind of signal are you expecting from African heads of state, who met in Brussels recently. Are you expecting a message of solidarity from the African people? In the past we had many problems of domination, slavery and colonisation, for instance, and Ukraine is very involved with this.\r\n\r\nThose political forces that create aggression in Ukraine, they do fear the external action from the world, in addition to fearing the reaction of their own people. I think that many countries of the world started talking seriously about Russian aggression; I think they look at these things differently in a more systemic way, as a more systemic threat.\r\n\r\nWe are not just talking about Crimea. The same applies to, for example, Azerbaijan or the Armenian conflict. The same applies to Abkhazia or Ossetia, to Georgia, to Transnistria. So, yes, Ukraine needs a lot of solidarity in how the world reacts to have a unanimous reaction to the actions of the president [Vladimir Putin].\r\n\r\nIt is not that difficult to produce this reaction. It is just calling things by their real names, and real definitions. If this is evil, it should be called evil.\r\n\r\nThe United Nations has produced several resolutions on Ukraine and the Ukrainian conflict. The link with the Arab countries can go further, and they can pass their own resolutions. There are dozens of international organisations that can help to produce  meaningful elections, by which you can sat we are not indifferent when evil is committed by other countries.\r\n\r\nHave you had contact through your foundation with Africa?\r\n\r\nActually, through an initiative of President Clinton, we are now working at an analytical and theoretical level with certain projects with African countries, and I hope that sooner or later our projects will be come real. And through the Club de Madrid, an organisation where many foreign leaders are members, there are also projects in Africa. And I have just became a member of that club."],
      "url": "https://www.eureporter.co/world/2014/05/06/interview-africa-and-ukraine-have-a-lot-to-offer-each-other/",
      "scraped_at": "2025-11-14T13:13:55.044482",
      "paragraph_count": 0
    },
    {
      "title": "To Russia with love: Transnistria's yearning for 'the Motherland'",
      "content": ["Copyright \r\nBy Euronews\r\nPublished on 30/05/2014 - 11:54 GMT+2\r\nShare\r\nComments\r\nTransnistria dreams of a Russian future. The region broke away form Moldova in the early 1990s and, legally at least, remains part of it. De facto, it is a self-governing separate entity, though unrecognised by any UN member state.\r\n\r\nMost of its half million inhabitants yearn to become part of the Russian Federation. Many, like Sergey, whom euronews spoke to in a park in the capital Tiraspol, have Russian passports: “Personally I prefer to be with Russia, because I feel close to Russia, I was born in Russia, I speak the Russian language.”\r\n\r\nIt is a sentiment shared by others on the streets of the city: “The best solution is to unite with the Russian Federation, and that’s not only my personal opinion but all people in Tiraspol and all over Transnistria think like that,” said one woman.\r\n\r\n“Of course, I want Transnistria to join the Russian Federation. because many Transnistrians go to Russia for work so they can make a living and feed their families. Moldova gave us nothing,” another woman told our reporter.\r\n\r\nHundreds were killed in a brief but bloody separatist war in 1992 before Moscow intervened. Some 1,200 Russian troops remain there.\r\n\r\nADVERTISEMENT\r\nToday it is a frozen conflict and its impact is far-reaching. In Grigoriopol we met retired engineer Alexey Mocreac who showed us around a closed food canning factory. It used to employ up to 3,000 people. But breaking away from Moldova took an economic toll on Transnistria, the factory failed and people left.\r\n\r\n“Many of the jobless went abroad: to Italy, Romania, some even to the USA, to Portugal. But most of them went to Russia, or to Ukraine because many people have relatives and family there,” Alexey explained.\r\n\r\nSome 50,000 exiled Transnistrians send money home from abroad. It helps keep the economy afloat. The region urgently needs investors – but who wants to put money into an unrecognised breakaway state?\r\n\r\nAt the parliament in Tiraspol, the chairman of the Supreme Soviet, as the assembly is called, has just pushed through a resolution calling on Russia and the UN to recognise Transnistria. Next on the wish list; annexation by Russia, which would require changing existing borders.\r\n\r\n“We believe that the will of the people is the supreme factor,” Chairman Mikhail Burla says.\r\n\r\n“The people’s will prevails over the principle of the integrity of borders, as was proclaimed in Helsinki in 1975. But I insist our goal should only be reached peacefully, by peaceful means. We don’t want any violence.”\r\n\r\nA major question in the debate is to what extent is there a Transnistrian identity? To find out we dropped into a rehearsal of the Viorika ensemble. For years they have been collecting traditional folk songs and dances in villages across the region.\r\n\r\nWe asked the conductor, Alexandru Galatsan, about the roots of Transnistrian folk music.\r\n\r\n“The main essence of the music, the essence of the melodies and also the harmonic structure of the songs are really very close to Moldovan sounds,” he said.\r\n\r\n“No, there is no border,” adds Boris Rosneritsa, the group’s choreographer. “They constructed some artificial borders, but we are one people, really: one people. We share the same dances here, all around in Transnistria and all over Moldova, and also in Romania; the dances are the same.”\r\n\r\nADVERTISEMENT\r\nBig business also looks eastward.The Sheriff conglomerate, which is said to have links to Russian political and security interests, covers much of Transnistria’s private sector, from petrol stations to supermarkets and even a football club. It bought players from Brazil and elsewhere.\r\n\r\nIts homegrown goalkeeper,Dmitri Stazhila, says the ultimate goal is to join the Russian league: “We would have excellent prospects in the Russian league. Probably not in the first year, because you need some time to adjust to the level of the league, but in time FC Sheriff could become serious competition for the top teams in Russia.”\r\n\r\nEuronews accepted an invitation to the Foreign Ministry in Tiraspol, where the OSCE has relaunched talks in the wake of the Ukraine crisis.\r\n\r\nThe foreign minister of this unrecognised state, Nina Shtanski, makes her policy objectives crystal-clear; Transnistria will adopt Russian laws and join the Eurasian Customs Union. A European free trade agreement, she stresses, would be harmful: “The signing of this free trade agreement between the European Union and Moldova will lead in the short term to a downturn of our industrial production of about 60 percent.”\r\n\r\nThat may not be the case if Transnestria itself joined the EU deal. Despite the anti-western rhetoric from officials, three quarters of Transnistrian exports go west. But the benefits are lost on huge public spending deficits.\r\n\r\n“Basically, it’s about $1 billion, the trade deficit of Transnistria, and this $1 billion deficit is financed through financial support from the Russian Federation. A subsidised economy is not sustainable by definition,” says Adrian Lupusor, executive director of think-tank Expert-Grup.\r\n\r\nEducation is another delicate issue. Moldovan language schools are caught in the crossfire. In February, Transnistrian authorities seized salaries paid to teachers by the Moldovan government. The money was given back three months later.\r\n\r\nIn the Moldovan capital, Chisinau, the Eriomenco family is desperately seeking help. We met them at a human rights lawyers’ office. Vitalie Eriomenco, is serving 12 years in a Transnistrian jail after being convicted of fraud by separatist authorities. His sister, Ala Gherman, tells us he was forced to sign a confession. His lawyers say they know of several hundred similar cases and have filed complaints at the European Court of Human Rights.\r\n\r\n“He was threatened to be killed: they set up a mock-up execution,” Ala says. “He was brought outside the police office, to the side of the Dniestr River. He was given a shovel and was told to dig his own grave. They even fired gunshots towards his legs and above his head to scare him to death while he dug his grave.”\r\n\r\nADVERTISEMENT\r\nFrom the police to the judiciary and the economy and trade in many areas Transnistria urgently needs deep and comprehensive reforms, either as part of the Russian Federation or not."],
      "url": "https://www.euronews.com/my-europe/2014/05/30/to-russia-with-love-transnistria-s-yearning-for-the-motherland",
      "scraped_at": "2025-11-14T13:13:55.044482",
      "paragraph_count": 0
    },
    {
      "title": "Transnistrian leader Shevchuk says he wants a ''civilised divorce'' with Moldova",
      "content": ["Transnistrian leader Shevchuk says he wants a ''civilised divorce'' with Moldova\r\nCopyright \r\nBy Euronews\r\nPublished on 07/06/2014 - 19:34 GMT+2\r\nShare\r\nComments\r\nRecent events in Ukraine, notably Russia’s annexation of Crimea, have reopened questions about the future of Transnistria.\r\n\r\nThe tiny pro-Russian region, which is home to about half a million people, broke away from Moldova in 1992 after a short but bloody civil war.\r\n\r\nEuronews’ Hans von der Brelie spoke to Yevgeny Shevchuk, the man who in 2011 was elected as leader of Transnistria (the constitutional term is ‘President of Transnistria’ although the republic is yet to to be recognised internationally) about where he believes the region’s future lies.\r\n\r\neuronews: ‘‘Mr Shevchuk, on the wall over there is a photo of President Putin and behind me there’s a painting of the Kremlin: Are we on Russian or Moldovan soil?’‘\r\n\r\nYevgeny Shevchuk:\r\n‘‘We are on Transnistrian territory… and there is also the photograph of the Russian patriarch.’‘\r\n\r\nADVERTISEMENT\r\neuronews: ‘‘Are you worried that the turmoil in neighbouring Ukraine could spill over to Moldova?’‘\r\n\r\nShevchuk: ‘‘We are very worried about what is going on in Ukraine but we are hopeful this will not have an impact on us.’‘\r\n\r\neuronews: ‘‘What is your message for the government in Kyiv?’‘\r\n\r\nShevchuk: ‘‘Stop using force!’‘\r\n\r\neuronews: ‘‘Moldova is in the process of signing a free trade agreement with the European Union. How will this affect Transnistria?\r\n\r\nShevchuk: ‘‘Generally, the signing of this agreement will have a negative economic impact on us because we did not participate in the negotiations. Of course there are certain positive elements with this free trade deal but there are a lot more negative aspects. That’s why, on the whole, we think that the outcome is unfavourable. Throughout the talks we made it clear to everybody about the bad elements of this agreement and we continue to point them out but it doesn’t seem to be enough.’‘\r\n\r\neuronews: ‘‘Why don’t you simply try to work towards reunifying Transnistria and Moldova in order to overcome such problems?’‘\r\n\r\nShevchuk: ‘‘Well, reunification would be a good idea if there weren’t any conflicts of interest between Transnistria and Moldova. Of course, the people of Transnistria must also want to be reunited with Moldova, but that is not the case, quite the opposite. At the moment the best solution would be what one could term a ‘‘civilised divorce’ with Moldova. After that, Transnistria would have a better chance of external economic growth.’‘\r\n\r\neuronews: ‘‘Does this mean that you completely rule out any reunification with Moldova? Yes or No?’‘\r\n\r\nShevchuk: ‘‘The definitive answer to this question should come from the people of this country rather than the president, and they clearly expressed this in a recent referendum. It is clear the people do not want reunification with Moldova.’‘\r\n\r\nADVERTISEMENT\r\neuronews: ‘‘You want to join Russia. By doing that, don’t you risk destabilising the region, turning a cold conflict into a hot one. Don’t you risk war and bloodshed?’‘\r\n\r\nShevchuk: ‘‘Our first goal, our top-priority is independence and international recognition. That is the first thing. We want the will of the Transnistrian people to be fully taken into account. Of course, there are different countries in the world which have different views. Some of these countries might think that using force is the answer to this issue. In the 21st century I don’t think that is a solution. Nowadays we should solve problems at the negotiating table and we should also respect the will of the people of this country.’‘\r\n\r\neuronews: ‘‘It is claimed armed men from Transnistria crossed into Ukraine, taking part in riots in Odessa. Can you confirm this? Do you know anything about these agent provocateurs.’‘\r\n\r\nShevchuk: ‘‘This information is false. It was spread by the mass media in Ukraine and by some Ukrainian authorities. I had a meeting with the Ukranian ambassador to Moldova and with Ukraine’s special representative who is involved in the talks between Moldova and Transnistria- and both officially denied militants from Transnistria had taken part in unrest in Odessa.’‘\r\n\r\neuronews: ‘‘The European Parliament has described Transnistria as a hub for organised crime, smuggling and human trafficking. This report was published during the term of office of Mr Smirnov, your predecessor. Has anything changed? Or is Transnistria still struggling to deal with the same problems?’‘\r\n\r\nShevchuk: ‘‘Regarding people smuggling, this kind of phenomena exists in many countries in the world including those with well managed borders. Transnistria has been accused of weapons smuggling and human trafficking. We’ve heard those insinuations before and we still hear them today. But I must officially declare the Transnistrian state is not involved in these kinds of smuggling activities. Such rumours are spread with the aim of generating fear inside EU countries to push them to intervene in Transnistria to solve this smuggling problem.’‘\r\n\r\neuronews: ‘‘Do you know how many passports Russia has handed out in the region in the last few years and can you tell me where your passport comes from?’‘\r\n\r\nShevchuk:’‘There are about 200,000 Russian citizens living in Transnistria. In fact, it is possible to have multiple citizenship. The Parliament has adopted a law which allows the people of Transnistria to have multiple citizenship. I want to add that I am a citizen of the Russian Federation but I am NOT a citizen of Moldova… And if a “citizen of the world” passport existed, I would be glad to get one.’‘"],
      "url": "https://www.euronews.com/2014/06/07/interview-transnistran-president-shevchuk-says-he-wants-a-civilised-divorce-",
      "scraped_at": "2025-11-14T13:13:55.149731",
      "paragraph_count": 0
    },
    {
      "title": "The country that doesn’t exist",
      "content": [
        "No other nation recognises Transnistria as a country, but within the sliver of land sandwiched between Moldova and Ukraine, the opinion of the UN doesn’t matter.",
        "The\nlast train out of the country was leaving in 10 minutes, and I was sitting in a\nroom no bigger than a prison cell, across from a border guard who held our\npassports hostage, awaiting his bribe.",
        "No other nation\nacknowledges Transnistria as a country, but at this moment, the opinion of the UN\nand the world’s cartographers only mattered on paper. There in that room,\nsitting across from a man with the power to detain me, I wasn't concerned with documentation.\nMy definition of a country became simple: border controls, armies and\ngovernments, all of which Transnistria has under its red-and-green flag bearing\na gold sickle and hammer. The only paper I was concerned with was cash, even though\nTransnistria’s currency is about as useful as Monopoly money anywhere else on Earth.\nHere, on this sliver of land sandwiched between Moldova and Ukraine –\nofficially known as a breakaway state within Moldova – 550 Transnistrian rubles\nwas worth about $50. And that’s how much we had to bribe the guard to let us board\nthe train departing Transnistria’s capital Tiraspol.",
        "After the\ntransaction, the only local currency I had left was a five ruble note, a Transnistrian\nkeepsake that I would keep indefinitely. My other two souvenirs – a body covered\nin flea bites and three bottles of brandy – would disappear in due time. But\nthat five ruble note, on the back of which sat a picture of theKVINT\nliquor factoryTransnistria was so proud of, would become the hardest-earned member of my\ncurrency collection.",
        "KVINT makes\nnearly nine million litres of alcohol each year, but it is particularly recognised\nwithin Eastern Europe for its brandies, which have won more than 100 medals at\ninternational competitions. KVINT produces its brandy using the same methods as\ncognac – but because the name cognac is reserved only for the alcohol made from\ncertain grapes twice-distilled in copper alembics in the region surrounding the\ncity of Cognac, France, KVINT differentiates its rich brandy by using the\nMoldovan word for the drink,divin.Still,\nmost people I met simply referred to it as cognac, which isn’t surprising in a\nplace that never seemed big on rules.",
        "Transnistria’s\nhistory is short and contentious. The name first referred to a region born in\nWWII that included southern Ukraine and its capital at the time, Odessa. The\nmuch smaller, ethnically Russian territory now known as Transnistria declared independence\nin 1992 after the fall of the Soviet Union through a bloody four-month war with\nRomanian-speaking Moldova, which still lays claim to the area. But while most people in this\nRussian-speaking land\nhave Moldovan passports, a 2006 vote in which 97% of the population voted for independence\nwith free association to Russia illustrates their true allegiance.",
        "Its murky\npast, coupled with strong accusations of KGB government presence and a bustling\nillegal arms trade, doesn’t give Transnistria a lot to be proud of. Other than a\nstate-of-the-art professional football stadium, the one thing Transnistrians\ncan brag about is their brandy.",
        "The quality\nof this fine spirit starts with the grapes, and Transnistria benefits from its\nproximity to the Black Sea and Dniester River (from which it gets its name). Combined\nwith a moderate continental climate and rich soil, the territory is perfect for\ngrowing a large number of grape varieties; KVINT uses more than 20 local and\nEuropean varieties in its products, including bianca and cabernet sauvignon.",
        "But the\nreal alchemy happens in the oak barrels, where the spirit turns from a clear,\nharsh distillate into liquid gold – at least at its best. I can only dream\nabout the divine flavours that seep into a barrel of the 50-year divin, but the\nnine-year – similar to a comparable cognac – was sophisticated and fruity, with\ntastes of caramel and just the right amount of burn. The three-year, on the\nother hand, is better served in a shot glass with something on the side to neutralise\nthe scorching sensation. Then again, the three-year only costs about 33 Transnistrian\nrubles a bottle instead of more than 29,000\nTransnistrian rubles for the 50-year Prince\nWittgenstein.",
        "KVINT produces\nabout 3.5 million litres of divin each year, which is enough to have stores all\nover Tiraspol selling exclusively KVINT products. Its reported 30 million euro revenue\nin 2012 is about 4% of Transnistria’s GDP, according tostatistics\nfrom the Centre for Eastern Studies. This $1bn GDP would make Transnistria\nthe poorest country in Europe.",
        "But\naccording to Timoti Ohotcii, owner\nofTiraspol Hostel– a rundown house with sulphur-water showers\nand flea-ridden, partially reclining chairs for beds – Tiraspol is far from\npoor; it just runs things a little differently. The money that flows through\nTransnistria is off the books, he said, which is believable considering cash Transnistrian\nrubles (or on rare occasion, American dollars or Russian rubles) are generally\nthe only form of accepted payment.",
        "Of course,\nin addition to the off-the-books economy is Transnistria’s notoriety for being\nacesspool of corruption: organised crime, illegal arms sales, human\ntrafficking and money laundering.",
        "At the centre of that corruption, reportedly, isSheriff, a conglomerate started by two ex-KGB\nagents, which holds the reins on Transnistria’s entire economy, owning petrol stations,\na television channel, a mobile phone network, supermarkets, a car dealership\nandFC Sheriff Tiraspol, the football club that plays in\none of Europe’s finest stadiums, a shiny, extremely expensive testament to the\ncountry’s greatness.",
        "Sheriff also\nhappened to purchase KVINT in 2006, which had been state-owned for most of its\n116-year history. It’s the oligopolous result of Transnistria’s slow-moving transition from communism to capitalism, or\nwhat Ohotcii liked to call “old-west capitalism”.",
        "In his\nhostel advertisements, Ohotcii – who was a reasonably knowledgeable tour guide, if not the\ngreatest hostel owner –\npromotes Transnistria as “the last remnants of the Soviet Union” – and in some\nways it still is. While every other country in the former USSR demolished many remnants\nof their Soviet past, Transnistria still clings to what they see as the good\nold days. Soviet monuments still stand guard throughout Tiraspol, and the city\nholds a Soviet-style military parade on their Independence Day, 2 September. It\nis the only post-Soviet land to wave the hammer and sickle on its flag, and a\nlarge bust of an austere Lenin stands in front of Transnistria’s parliament\nbuilding, illustrating that the formation of this quasi nation was as much\nabout ensuring the\ncommunistic future rejected by the rest of the USSR as it was about the right\nto keep Russian over Romanian as its national language.",
        "But at the\nsame time, Tiraspol is a quiet town with smiling faces, beautiful parks and\ntrendy sushi restaurants. I met nothing but friendly people during my stay and –\nuntil we were forced to bribe our way out of the country – the only corruption\nwe heard of was through news articles or internet documentaries. Even when we\nwere detained, the border guard was fully pleasant, kind of funny even. Looking\nback, the whole incident was our fault anyway. We had listened to Ohotcii’s advice and, for reasons I still don’t\nunderstand, purposefully avoided registering with the police when entering the\ncountry.",
        "The 550\nrubles we gave him probably could have fed his family for a month and was a\nsmall price to pay for a story of intrigue to be told over a snifter of my last\nremaining bottle of KVINT brandy.",
        "The BBC has a robust anti-corruption\npolicy in place and BBC Worldwide staff undertake a comprehensive training\nprogramme to ensure that they are aware of the UK Bribery Act and the issues\nthat it raises. Although the tone of this article is relatively light-hearted,\nwith the bulk of the piece focusing on the culture behind Transnistria’s\naward-winning brandy, the individuals concerned were locked in a room and had\ntheir passports taken away during the reporting process, compromising their\nsafety and putting them in a situation of duress – a situation recognized by\norganisations such as Transparency International. Considering Transnistria’s\ndisputed history, BBC Travel editors felt it would paint an inaccurate\npicture if the encounter were left out."
      ],
      "url": "https://www.bbc.com/travel/article/20131212-bribery-and-brandy-in-a-country-that-doesnt-exist",
      "scraped_at": "2025-11-14T13:13:55.311400",
      "paragraph_count": 18
    },
    {
      "title": "Moldova's Trans-Dniester region pleads to join Russia",
      "content": [
        "A sign in Trans-Dniester reminds people: \"We are not Moldova!\"",
        "Pro-Russian politicians and activists in Moldova's breakaway Trans-Dniester region have asked the Russian parliament to draft a law that would allow their territory to join Russia.",
        "The Trans-Dniestrian appeal comes as Moscow moves towards absorbing Crimea into the Russian Federation. Ukraine, the EU and US say that move is illegal.",
        "Russian loyalists dominate Trans-Dniester, with support from Moscow.",
        "The region split from Moldova in a war in 1991-92, as the USSR was collapsing.",
        "Moldova's President Nicolae Timofti said in a news briefing on Tuesday that any decision by Moscow to accept Trans-Dniester \"would be a step in the wrong direction\".",
        "In a September 2006 referendum, unrecognised by Moldova and the international community, the region reasserted its demand for independence.",
        "Irina Kubanskikh, spokeswoman for the Trans-Dniester parliament, told Itar-Tass news agency that the region's public bodies had \"appealed to the Russian Federation leadership to examine the possibility of extending to Trans-Dniester the legislation, currently under discussion in the State Duma, on granting Russian citizenship and admitting new subjects into Russia\".",
        "A pro-Kremlin party, A Just Russia, has drafted legislation to make it easier for new territories to join Russia. The party told the Vedomosti newspaper that the text was now being revised, in order not to delay the rapid accession of Crimea to Russia.",
        "The Duma - Russia's lower house - and the Federation Council (upper house) are dominated by supporters of President Vladimir Putin.",
        "Vedomosti reports that the Trans-Dniester appeal to Russia also warns about a possible further deterioration if Moldova signs an association agreement with the EU.",
        "Moldova's leaders plan to do so. The crisis in neighbouring Ukraine erupted after former President Viktor Yanukovych was expected - and then refused - to sign such an agreement."
      ],
      "url": "https://www.bbc.com/news/world-europe-26627236",
      "scraped_at": "2025-11-14T13:13:55.436295",
      "paragraph_count": 12
    },
    {
      "title": "Russia to annex Transnistria?\r\n",
      "content": ["There are growing signals that Russia may follow its absorption of the Ukrainian region of Crimea with the annexation of Transnistria, a region that broke away from Moldova in 1992.\r\n\r\nCopy Link\r\n37373\r\nMarch 19, 2014 10:40 pm CET\r\nBy Andrew Gardner\r\nReports in Russia suggest that the speaker of Transnistria’s parliament has written to Moscow about the possibility of acceding to the Russian Federation. The request has not been confirmed, but, Moldova’s president, Nicolae Timofti, warned on Tuesday that such a step would be “counterproductive” for Russia, because it “would not improve Russia’s authority in the international arena”.\r\n\r\nTransnistria is already well primed for accession to Russia, as, in 2006, 97.2% of Transnistrian voters supported a referendum on joining Russia. Its absorption would formalise the de facto relationship between the Transnistrian capital, Tiraspol, and Moscow, but it would end a decades-old process aimed at conflict settlement, under the wing of the Organisation for Security and Co-operation in Europe. It would also, in Moldovan eyes, turn the 1,300 Russian military in Transnistria, originally labelled a peacekeeping force, into a potential occupation force. Tiraspol is only 75km from Chisinau, the Moldovan capital, along a good highway, and Russian and Transnistrian troops have reportedly been in a state of heightened readiness since 2 March.\r\n\r\nAt present, though, the principal fear is that Russia is preparing to destabilise the political situation within the rump of Moldova, by stoking separatism in an autonomous region in the country, Gagauzia. Kamil Calus, an analyst at the Warsaw-based Centre for Eastern Studies, said that Russia may be preparing a “Crimean scenario” in the enclave, which is populated by an Orthodox Christian Turkic group that has historically been pro-Russian. In February, 98.4% of Gagauz voted in a regional referendum in favour of joining Russia’s Eurasian Customs Union rather than pursuing deeper integration with the European Union.\r\n\r\nRomania has so far remained silent about the events in Transnistria and Crimea. It has kept its Black Sea fleet in port and its foreign minister, Titus Corlatean, said on Tuesday (18 March) that Romania’s diplomacy was focused on promoting a united stance by the EU. Bulgaria’s foreign minister, Kristian Vigenin, has said his country fully supports the EU’s common line, dismissing reports that Sofia had opposed sanctions on Russia."],
      "url": "https://www.politico.eu/article/russia-to-annex-transnistria/",
      "scraped_at": "2025-11-14T13:13:55.830962",
      "paragraph_count": 0
    },
    {
      "title": "EU defies Russia by granting visa-free travel to Moldovans",
      "content": [
        "Moldovan citizens will no longer require visas to travel to most of the European Union from Monday (28 April), as the bloc presses ahead with deeper ties with east European nations in defiance of Russia.",
        "Moldovan citizens will no longer require visas to travel to most of the European Union from Monday (28 April), as the bloc presses ahead with deeper ties with east European nations in defiance of Russia.",
        "Moldova, Georgia and Ukraine are all seeking tighter links with the European Union as part of Eastern Partnerships with the bloc, which allow for closer trade and business ties without full EU membership.",
        "In response to the Ukraine crisis, the European Union has said it will accelerate the partnerships and from Monday, all citizens of Moldova with a biometric passport can travel visa-free to Europe’s Schengen zone, the European Commission said on Sunday in a statement.",
        "“This decision will further facilitate people-to-people contacts and strengthen business, social and cultural ties between the European Union and Moldova,” said Cecilia Malmström, the EU Commissioner for Home Affairs.",
        "The Schengen zone includes most EU countries and some non-members such as Norway and Switzerland.",
        "Ukraine’s quest for EU ties triggered the current crisis in relations with Moscow, dividing the nation between those seeking to look West and those wanting to stay in Moscow’s orbit.",
        "Following Moscow’s annexation of Ukraine’s Crimea peninsula in March, NATO has cited Moldova’s disputed Transdniestria region as a possible next target.",
        "Moldova’s pro-European prime minister Iurie Leanca has said EU-inspired reforms and visa-free travel for Moldovans are the best hope of resolving the “frozen conflict” of Transdniestria, arguing they would make Moldova more attractive to those in the rebel region.",
        "An official from the European Commission confirmed the visa exemption did not depend on ethnic origins and could include people living in Transdniestria.",
        "A narrow strip of land near the Ukrainian border, Transdniestria has not been recognised by any state as independent, but it is home to Russian troops and half-a-million people – 30 percent of them ethnic Russians – who look to Russia as their patron, much like the ethnic Russian majority in Crimea.",
        "All EU countries apart from Britain and Ireland are either members of the Schengen area or – in the case of Bulgaria, Croatia, Cyprus and Romania – legally bound to join.",
        "A spokesman for Britain’s Home Office said London had no plans to allow visa-free travel to Moldovans visiting Britain, and was not bound by the Schengen decision.",
        "EU partnership deals depend on certain reforms. In its statement, the Commission, the EU executive, said Moldova had reformed its interior ministry, modernised its border police and made progress towards ensuring equality and human rights."
      ],
      "url": "https://www.euractiv.com/news/eu-defies-russia-by-granting-visa-free-travel-to-moldovans/",
      "scraped_at": "2025-11-14T13:13:56.398145",
      "paragraph_count": 14
    },
    {
      "title": "Dorotcaia: the Moldova village caught between Russia and Europe",
      "content": [
        "On the eve of a historic deal with the EU, residents of Dorotcaia are lobbying to join their neighbour - the breakaway Russian enclave of Transnistria.Transitions Online reports",
        "On an early spring day in Dorotcaia in easternMoldova, about 100 people gather in the central square, in front of the renovated House of Culture. Behind them, a monument dedicated to the Red Army soldiers who liberated the village in 1944 shines in the sun. Mostly, the crowd is made up of elderly men and women. The worried faces of the women are framed by the headscarves so ubiquitous in this part of the world.",
        "The group listens intently.",
        "“They don’t invite you intoEurope. They invite you into Europe’s ass,” a man on stage shouts into a microphone. Piotr Dobrinski is the leader of the so-called local soviet, a ghost institution left over from communist times and recognised only by the authorities in Transnistria, the breakaway region of Moldova that sits across the road from Dorotcaia.",
        "Dobrinski, who considers himself the real leader of the village, is trying to mobilise support for a referendum on joining Transnistria, essentially a client territory ofRussia.",
        "Meanwhile behind the crowd an anxious mayor, Andrei Lesco, takes small, nervous steps. He sizes up the audience, looks at Dobrinski, and decides to make a move. He mounts the steps and addresses the people.",
        "“My duty, as the legitimate mayor, is to ensure public order, to make sure that there are representatives of the government who can hear you and your demands,” he tells them. “We all want the Republic of Moldova to listen to our pain and our heart.” He pauses. “But if you don’t want that, go to Transnistria.”",
        "Suddenly, the men and women start cheering happily. “Transnistria! We want to be in Transnistria!”",
        "Lesco stands frozen. At the end, an old woman shouts, “You can stay in Moldova if you want to.”",
        "Moldova is preparing to sign a trade and association agreement with the EU on Friday 27 June, but only a few who went to listen to Dobrinski are likely to care whether the country is headed for EU membership, or whether Transnistria gets its wish to be internationally recognised as an independent state. For them, Russians or Romanians are the same.",
        "What they really care about is the land problem, and they hope Dobrinski can solve it.",
        "When Transnistria declared itself separate from Moldova, some in this village of 3,500 people owned farmland on the other side of the road, and relied on it for subsistence. In 2003 authorities in the breakaway territory started limiting villagers’ access to the land, but international negotiators helped broker an agreement to resolve the impasse.",
        "That pact expired in December, and the parties have not been able to agree on a new one. The only subsequent offer the farmers have received would effectively force them to lease land they once owned. Some have agreed.",
        "Thus, some 2,600 hectares – about 85% of Dorotcaia’s farmland – is now off-limits to its residents unless they sign the new agreement.",
        "The government of Moldova is working on a compensation plan for those who lost their land, according to Alexandru Zubco, a lawyer and member of Promo-LEX, a human rights group in Chisinau that mainly works on issues in Transdniester.",
        "A week after the crowds came to hear Dobrinski, deputy ministers from the Moldovan capital, Chisinau, came to the village to talk about the land situation. They used words such as “complicated”, “patience”, and “political insecurity” and gave the residents little comfort. Across the road in Transnistria, some villagers said, people have a better life.",
        "“The pensions are higher, the utilities are cheaper,” 71-year-old Ana Ivanovna said.",
        "A few weeks later, Dorotcaia seems quiet. On the main street, amid the post office, the House of Culture, and the monument to Soviet heroes, is a tiny history museum crammed into a shack.",
        "Its director, Andrei Berzan, said the village has long been caught between the east and west. It was on the front line in the second world war from 1941 to 1944, and again in 1992 when Transnistria fought a war to split from Moldova. On its streets have walked German, Soviet, Moldovan, and Transnistrian soldiers. The Red Army monument lists 700 Russian soldiers who liberated the village in 1944.",
        "“Those were the real heroes,” Berzan says.",
        "The quiet is only an illusion. In reality, the village is divided: some of its people have Transnistrian passports and dream of a glorious future when Dorotcaia will join the separatist region. Younger villagers, who don’t have nostalgic memories of Soviet times, count the days until 27 June, when Moldova is to sign an agreement on closer ties with the EU. They believe the pact will open the borders and make it easier for them to travel and work in Europe. Only recently Moldovans won the right to travel into the EU without a visa.",
        "While the villagers in Dorotcaia look fretfully across the road at the plots they used to till, some students in a neighbouring village in Transnistria make a daily trip in the other direction; heading to Dorotcaia to learn in a way not permitted by the separatist authorities.",
        "Stefan cel Mare si Sfant school in Grigoriopol was one of only eight schools in Transnistria that obeyed an order from the Moldovan government in 1989 to switch from the Cyrillic to Latin script. A subsequent order from the separatist authorities forced them to adopt the Cyrillic alphabet, and all schools in Transnistria were required to teach in Russian, Ukrainian, or Moldovan, an ungainly hybrid of Romanian and Russian using Cyrillic characters.",
        "In 1996, when administrators at Stefan cel Mare repeatedly asked for permission to switch back to the Latin alphabet, the school came under intense pressure. Three teachers and administrators, including principal Eleonora Cercavschi, were arrested and held for a week. In a2008 lectureshe gave upon receiving a top international human rights award, Cercavschi said she was threatened with never seeing her children again if she persisted in teaching the Romanian language.",
        "The educators were called “enemies of the state” in the local press, and in 2002 police in Transnistria “stormed the school and evicted the teachers, the pupils, and their parents who were inside it,” according to asummary of a casePromo-LEX argued before the European Court of Human Rights in 2009 on behalf of Cercavschi, her colleagues, and other plaintiffs. In anOctober 2012 rulingthe court held Russia liable for violating the educators’ rights and ordered it to pay 1.02 million euros ($1.4 million) in damages. To date the award has not been paid.",
        "The principal and teachers decided to move operations. They rented a couple of buses and – after reaching a tacit agreement with Tiraspol, thede factocapital of Transnistria – they started to teach “abroad” in Dorotcaia.",
        "Every day, three buses filled with kids of all ages cross the border and park at the gates of a school in Dorotcaia. Three hundred pupils pour out of the buses with huge backpacks filled with books in Romanian.",
        "In the building, some of the classrooms have filled up with Romanian-speaking children, while some have only one or two pupils.",
        "“Most of the parents who send their children to our school keep it a secret. It’s a brave and risky decision, but they fight for their right,” Cercavschi says.",
        "Even with the unspoken agreement, the school’s accounts in Tiraspol were temporarily frozen in January 2013, and the teachers could be stopped and arrested at the border at any time.",
        "Not far away, Ana Ivanovna is hoeing weeds outside the broken wooden fence around her front garden. The flowers on her blue headscarf match the tulips on her robe.",
        "She’s cheerful and polite at first but starts crying when asked about the land problem.",
        "“The situation is very bad. People are prohibited from crossing the border to sow seeds, but it’s the right time now. We have nothing else to live off of. What are we supposed to do?”",
        "Ivanovna remembers the war in 1992. She points out the spot in her yard where Moldovan soldiers made camp. “They shot and destroyed my house. The windows, the armchairs, the fridge,” she says.",
        "She leans on the hoe and whispers that she’s afraid of a new war. Asked about recent events inUkraine, she blames the clashes on “Ukrainian fascist nationalists”. She has nephews working in Moscow and all her television channels are in Russian. For her, Ukraine is a land of chaos and anarchy.",
        "“I keep hearing on TV that Moldova will join the EU, then Romania, and all those fascists will come to make us pay taxes on each cow and each chicken. I don’t want that. I’d rather live with Russians,” she says.",
        "In a little shop on the main street, a shopkeeper explains how some people have negotiated the divide.",
        "Valentina, who declines to give her last name, says her husband has a veteran’s pension from fighting on the side of Moldova during the separatist conflict. But it wasn’t enough for the couple to live on, so she took Transnistrian “citizenship” and brings home a pension three times higher.",
        "That math is more or less confirmed by Lesco, the mayor, who says the minimum monthly pension in Moldova is 800 lei ($57), compared with 1,800 lei on the Transnistrian side.",
        "Such largess is possible thanks largely to money and subsidies from Russia. For years Transnistria has not paid for its natural gas. The state-owned Russian energy giantGazprom, which supplies the territory, has not collected on a bill that is nearing $4bn. It also gets $27m annually from Moscow for pensions.",
        "Surrounded by candies, sausages, napkins, and cheap cigarettes, Valentina uses an old abacus to calculate. “If Moldova joined Romania and all these villages remained with Transnistria, we would be very happy,” she says.",
        "Back in his office, Lesco seems angry. Or perhaps he just hates journalists.",
        "“You write about this and the story gets bigger and bigger, while in reality there were only a couple of drunks in the square, demanding something that they don’t even understand,” he declares.",
        "The Moldovan flag is everywhere in this empty room: on the pink wall, on the desk, next to the window.",
        "“The newspapers said I’m the one who doesn’t want to join Transnistria, that I’m the one who doesn’t want to organise the referendum. But that’s a lie,” he says. “If they, the people, want that, I’ll do it tomorrow. But I’m telling you, I can’t let a couple of drunks decide the future of the village. What happens if Moldova joins the EU tomorrow, Ukraine blocks the border with Transnistria, and the region is strangled?”",
        "Lesco, in his third term as mayor, dismisses Dobrinski as a “charlatan\".",
        "“He has no office, no secretary, no legislative or executive power whatsoever. He only jerks people around, promising them a good future,” he exclaims.",
        "Going outside for a much-needed cigarette, Lesco warns that Dobrinski doesn’t give interviews.",
        "It is easy to find Dobrinski – or anyone – in such a small village. Helpful residents lead the way, insisting that he is a good man.",
        "His house is a small, square building with green walls and little white hearts on the gates, which open only when his daughter emerges to explain that he talks only with journalists from Transnistria.",
        "“He will give interviews to anyone else when he gets an actual office and recognition. You’re invited to talk to him on that day. He works a lot to help people,” she says before turning around and walking away from the muddy road.",
        "According to lawyersfrom Promo-LEX, that help includes drawing up petitions supporting recognition of Transnistria’s independence, to be sent to the separatist authorities. One teacher from the Stefan cel Mare school says she saw her name on one such list – although she had not signed anything.",
        "Story and Dorotcaiaphotos byLina Vdovii,a Moldovan freelance journalist in Bucharest, member of the Romanian Center for Investigative Journalism, and fellow at the Balkan Fellowship for Journalistic Excellence"
      ],
      "url": "https://www.theguardian.com/world/2014/jun/26/moldova-russia-europe-transnistria-dobrinski",
      "scraped_at": "2025-11-14T13:13:56.862379",
      "paragraph_count": 53
    },
    {
      "title": "If Transnistria is the next flashpoint between Putin and the west, how should Europe react?",
      "content": [
        "Alexandru Ursu did his bit to bridge the political divide across the river Dniester. A Romanian-speaking cop from Moldova, he bought an apartment across the border inthe breakaway Russian enclave of Transnistria. To understand why that turned out to be a bad idea, you need a quick geography lesson.",
        "From 1940 to 1991,Moldovawas the Romanian-speaking republic in the USSR. In 1992, after it had declared independence from Russia, a civil war broke out, creating Transnistria on the east bank of the river. It has no status under international law and, as Alexandru discovered, the rule of law itself is scant.",
        "Last weekNato's commander in Europe named Transnistria the next flashpoint between Putin and the west. It is home to 2,000 Russian troops and an arms dump that could, if called for, resupply an entire army of Russian troops, should it make the journey across neighbouring Ukraine. That's what the generals are worried about.",
        "I visited Transnistria last week, filming without permission, with an edgy driver in a beat-up car, telling the border guards I wanted to see a football match. The first clue that the picture would be complicated came at the Moldovan border village of Bulboaca. Like much of Moldova, it is a poverty-stricken landscape of tumbledown shacks, crumbling apartment blocks, dogs, chickens, kids and old women. \"It was better in Soviet times, believe me,\" said one of the women. \"It is better in Transnistria,\" said another. Twenty years of orientation to the west has left Moldova the poorest country inEurope, with one third of adults in villages like this working abroad.",
        "To cross into the Russian enclave you go through three checkpoints, manned by the Moldovan police, the Russians and the Transnistrian army itself. Despite this high security, the enclave has been named a major centre for organised crime, with tobacco- and alcohol-smuggling top of the list, and money laundering alleged. But – and here's what the geo-politicians tend to ignore – it is tangibly better-off.",
        "Yes, there are monuments to Lenin. Yes, the supreme soviet is dominated by a political party aligned to a football club. But what's important to the women in headscarves in the estate I visited, once you get to -30C on a winter's night, is the gas price. Thanks to Vladimir  Putin, it is negligible. Pensions are higher than in Moldova. And there is employment: the army pays $300 (£180) a month and sustains a military-related economy.",
        "So while the west thinks of this as a rogue, crime-ridden military outpost, in the region itself there is an upside. While I was there, a village across the border in Moldova even held a demonstration demanding to be allowed to join the Russian side.",
        "While there are language issues – Romanian schools in the Russian enclave are being harassed by the authorities and pressured to close – the real battle is economic. \"Putin cares about us\" was the theme of conversations I had on both banks of the river, while \"Europe could not give a toss\".",
        "Alexandru Ursu's case shows the stakes for individual people. In 2007, the flat he had bought inside Transnistria was seized by the police. They claimed he had duped the seller. They threw him in jail, suffocated him with a gas mask and beat him so badly that he was hospitalised. They forced him to sign a confession and he spent three years in jail. \"The flat was occupied by the policeman who arrested me,\" he says. He was released after international pressure and his case is currently before the European Court of Human Rights.",
        "The jails are full of people trying to scrape together 100,000 rubles (£1,700) to pay what is effectively a ransom to get them out, he alleges.",
        "I stood on the bank of the Dniester thinking about the 150,000 Red Army casualties in the operation to cross here in 1944. If this is to be a new cold war, and the river a new Berlin Wall, then the west needs to know what the stakes are. For men like Alexandru, and others still trapped in Transnistrian jails, a diplomatic freeze would be the end of western leverage. Putin's call on Sunday for the regularisation of the enclave's status would, paradoxically, put human rights on a more stable footing. Moscow's standard response to petitions from people jailed there is \"we don't control it\".",
        "On the Moldovan side, where the grey flag of poverty trumps all other symbols, Europe needs to decide what its offer is. It's likely Moldova will be given a security guarantee and drawn more into the EU's orbit. But \"send your daughters to sweep our floors while we destroy your way of life with agribusiness\" never sounds great anywhere. Here, on the new faultline of Europe, they will have to come up with something better.",
        "Paul Mason is Culture and Digital Editor, Channel 4 News. His report from Transnistria will be shown on Tuesday 1 April at 7pm.",
        "This article was amended on 1 April 2014 to correct the number of Red Army casualties in the operation to cross the Dniester."
      ],
      "url": "https://www.theguardian.com/commentisfree/2014/apr/01/transnistria-putin-west-europe-dniester-river-moldova",
      "scraped_at": "2025-11-14T13:13:57.005718",
      "paragraph_count": 14
    },
    {
      "title": "Russia ready to annex Moldova region, Nato commander claims",
      "content": [
        "Nato's most senior military commander said on Sunday that Russia had amassed a large military force on Ukraine's eastern border, and warned that Moldova's separatist Trans-Dniester region could be the Kremlin's next target.",
        "General Philip Breedlove, Nato's supreme allied commander, described the Russian force that began exercises 10 days ago asvery, very sizeable and very, very ready.",
        "\"There is absolutely sufficient force postured on the eastern border ofUkraineto run to Trans-Dniester if the decision was made to do that. That is very worrisome,\" Breedlove said.",
        "The White House also intimated that Russia may be readying for further action. Tony Blinken, Barack Obama's deputy national security adviser, described the troop build-up as deeply concerning. He told CNN the Moscow's evident goal was to intimidate the Ukrainians, and added: \"It's possible that they're preparing to move in.\"",
        "Following Russia's annexation of Crimea last week there is deep uncertainty as to whatVladimir Putinmay do next. The Russian defence minister, Anatoly Antonov insisted on Sunday that Russian troops near Ukraine's border complied with international agreements. Vladimir Chizov, Moscow's ambassador to the EU, told the BBC that Russia did not have expansionist views.",
        "European diplomats say that Putin's immediate post-Crimea goal is to destabilise Ukraine and to sabotage its pro-western government in Kiev. Beyond this, they add, they believe Putin's ambitions may include creating a zone of Russian influence in the south and east of Ukraine as far as Odessa, which borders Trans-Dniester, cutting off Kiev's access to the Black Sea.",
        "Russia already has a military presence in Trans-Dniester, also known as Transnistria, a Russian-speaking separatist territory in western Moldova that broke away two decades ago.Trans-Dniester's communist leadership has appealed for Russia to annexe the region. Moldova's president Nicolae Timofti, meanwhile, has responded by urging the EU to bring forward the signing of an association agreement scheduled for early summer.",
        "Ukraine's acting foreign minister, Andriy Deshchytsia struck a pessimistic note on Sunday, saying the chances of all out war between Kiev and Moscow were growing. \"The situation is becoming even more explosive than a week ago,\" he told ABC News.",
        "Addressing a rally in Kiev on Sunday, Ukraine's defence minister Andriy Parubiy claimed that Russian forces could attack at any moment. \"Putin's aim is not Crimea but all of Ukraine,\" he said. In a show of national unity, demonstrators unveiled a giant yellow and blue Ukrainian flag on the Maidan, the scene of Ukraine's uprising last month.",
        "In deposed former president Viktor Yanukovych's eastern home town of Donetsk, around 2000 pro-Russian demonstrators gathered in Lenin Square. Speakers denounced the new government in Kiev as a fascist junta. They demanded a referendum on federalisation, a step to greater regional autonomy, and possible union with Moscow. The protesters also criticised Serhiy Taruta, a local oligarch parachuted in by Kiev to be provincial governor.",
        "\"We have an orthodox faith and a common history with Russia and Belarus,\" Roman Protsenko, a 36-year-old IT programmer from Donetsk explained, amid shouts of \"Russia\" and \"Yanukovych\". \"This is Russian civilisation. We're different from the west. We are in favour of friendly relations but againstNatoand the United States.\"",
        "Pyotr Kandybka, a former Soviet marine geologist, now retired, said that British spies had financed the Maidan protest. He said that unless the EU stopped \"supporting fascism\" ultra-nationalists would soon sweep in from Ukraine into Poland and Germany, and cause trouble and mayhem there.",
        "After the rally a crowd marched towards Donetsk's provincial administrative HQ. Riot police guarded the building. In previous weeks angry mobs have smashed windows, broken inside and raised the Russian flag. On Sunday, however, the protesters departed peacefully, in a sign that tensions in the east of the country may be beginning to subside, at least for now.",
        "Europe's biggest geo-political crisis for decades will dominate a nuclear security summit opening in The Hague on Mondaythat will include what may prove to be the most difficult meeting to date between the US secretary of state John Kerry and the Russian foreign minister Sergei Lavrov. The two have talked almost daily but have agreed on practically nothing.",
        "The encounter comes with Russia facing the loss of its coveted seat among the G8 group of leading nations and US financial restrictions imposed on the most powerful members of Putin's inner circle. European leaders appear gloomy about Ukraine's prospects as a single state – and the precedent Moscow's warp-speed annexation of Crimea sets for the rest of Europe.",
        "\"I'm very worried the unlawful attempt to alter the recognised borders of our European neighbourhood, 25 years after the end of the Cold War, will open Pandora's box,\" The German foreign minister Frank-Walter Steinmeier told Welt am Sonntag. Steinmeier visited Donetsk on Saturday. He described the situation there as anything but stable.",
        "Over the weekend, the last Crimean airbase in Ukrainian hands fell to Russian forces following a dramatic onslaught. An armoured personnel carrier burst through the main gate of Belbek airbase near the administrative capital of Simferopol. Two more Russian armoured personnel carriers followed and gunmen fired automatic weapons into the air and threw stun grenades.",
        "Several unarmed soldiers began singing the Ukrainian national anthem. During the operation, Russian troops captured the base commander, Yuri Mamchur. Ukraine's acting president Oleksandr Turchynov demanded the release of Mamchur – the head of the Ukraine air force's 204th tactical aviation brigade – who, he said, had been kidnapped in the early hours of Sunday and taken prisoner."
      ],
      "url": "https://www.theguardian.com/world/2014/mar/23/russia-ukraine-annex-moldova-trans-dniester-nato",
      "scraped_at": "2025-11-14T13:13:57.120253",
      "paragraph_count": 18
    },
    {
      "title": "Defiant Russia absorbs Crimea",
      "content": ["Putin says West pushed Russia “to the brink”, as he signs treaty making Crimea part of Russia.\n\nCopy Link\n9950\nMarch 18, 2014 8:46 am CET\nBy Andrew Gardner\nRussia’s President Vladimir Putin today threw down the gauntlet to the international community and the European Union in particular, by signing an agreement absorbing the Ukrainian region of Crimea into Russia.  \n\nPutin prefaced the signing ceremony with a hardline speech, in which he blamed the European Union for triggering the crisis in Ukraine, which has seen thousands of Russian troops take control of the Crimean peninsula.  \n\nIn a hastily arranged referendum described as illegal by almost every member of the United Nations Security Council, Crimeans on Sunday (16 March) voted to become part of Russia.  \n\nPutin said that the EU had “crossed a line” in seeking to deepen its political and trading relationship with Ukraine, and said that Russia had been “cornered” throughout the 20th century by a “Western policy of deterrence”.   “Russia was on the brink, it could not step back any more,” Putin said.  \n\nPutin also justified the “reunification” of Crimea on historical grounds, arguing that Soviet leader Nikita Khrushchev had been wrong when in 1954 he gave the peninsula to the Soviet republic of Ukraine. Crimea became part of the Russian empire in the 18th century. “Crimea and these cities” – a reference in part to Sevastopol, the base of the Russian Black Sea fleet – “are a symbol of Russian force and might,” he said. “Crimea has always been and remains an inseparable part of Russia.”  \n\nPutin contended that the West could reject Crimean separatism when it set a precedent by recognising Kosovo – formerly part of Serbia – as a state, and cited Western military action in Iraq and Libya in an effort to rebut criticism from Europe and the United States.  \n\nPutin described Russians as the world’s biggest “divided people” and said that Russia had a duty to protect ethnic Russians. He said, however, that Russia has no designs on other parts of Ukraine with large Russian-speaking populations. “We do not want a partition of Ukraine, we do not need this,” he said.  \n\nHowever, in a further sign of the de-stabilisation of the geopolitical situation on the EU’s and Russia’s borders, the parliament in Transnistria – a separatist region that broke away from Moldova in 1992 – today called on the government to start talks on becoming part of Russia.   Putin, who accused nationalists, neo-Nazis, Russophobes and anti-Semites of being behind the “coup” in Ukraine, said that all minorities would be protected in Crimea.\n\nTatars, who account for around 12% of Crimea’s population, were deported to central Asia under Stalin and have been the group in Crimean most visibly opposed to the region’s accession into the Russian Federation.  \n\nMeanwhile, in Crimea, the body of a Tatar activist, Reshat Ametov, has been found, with clear signs that he had been tortured, Human Rights Watch reports.  \n\nSanctions  \n\nThe absorption of Crimea into Russia and Putin’s speech put the pressure on EU leaders, when they meet this week (20-21 March), to carry through on their warning to extend sanctions against Russia if it refuses to “de-escalate” the situation in Ukraine.  \n\nEU foreign ministers yesterday (17 March) imposed personal sanctions against 13 Russian politicians, officials and military serviceman and eight officials and military figures from Crimea. The sanctions, which freeze the assets of those blacklisted and bar them from entering the EU, affected a set of prominent politicians in the Russian parliament, but did not target Putin’s closest aides.  \n\nSanctions announced by the US yesterday reached into Putin’s inner circle, including two of his closest advisers – Sergey Glazyev and Vladislav Surkov – and Dmitry Rogozin, Russia’s deputy prime minister.   At a crisis summit on 6 March, EU leaders warned Russia of “additional and far reaching consequences…” across “a broad range of economic areas” if it did not take steps to ease the crisis in Ukraine.  \n\nFrance’s foreign minister, Laurent Fabius, said today that the group of leading industrialised economies has now suspended Russia’s membership. The seven other members of the G8 – the United States, Canada, Japan, France, Germany, Italy and the UK – had previously said that they halted work for a G8 summit in the Russian city of Sochi in June.   Russia’s foreign ministry today said that it would retaliate against any measures.  \n\nA resolution in the United Nations Security Council condemning the Crimean referendum as illegal won the backing of 13 of its member states. The motion was vetoed by Russia – one of five states with veto powers – but it found itself isolated, as China abstained.  \n\nNonetheless, Putin today praised China and India, which is not currently a member of the Security Council, for what he described as their reserved attitude. "],
      "url": "https://www.politico.eu/article/defiant-russia-absorbs-crimea/",
      "scraped_at": "2025-11-14T13:13:57.274496",
      "paragraph_count": 0
    },
    {
      "title": "Deny Moscow a new front in Bosnia",
      "content": ["The West needs a strategy to prevent Russia stoking the separatist aspirations of the leader of Bosnia’s ethnic Serbs.\n\nCopy Link\n37572\nMarch 26, 2014 9:40 pm CET\nBy Kurt Bassuener\nAs Russian President Vladimir Putin prepared for the preordained results of the stacked referendum in Crimea last weekend (16 March), his foreign minister, Sergei Lavrov, met Milorad Dodik, president of Republika Srpska, one of two sub-state entities that emerged from Bosnia’s war and a leader who has long fomented ethnic separatism. Although the official readout from the meeting was anodyne, the meeting and its timing only fed speculation in Bosnia that something more sinister might be afoot. As one diplomat remarked to me, “Putin will support Dodik’s moves, as his main goal is to foment instability throughout Europe.”\n\nDodik has long insisted that the state of Bosnia is doomed, and that the Republika Srpska should have the right to self-determination. He began spinning this line soon after becoming the entity’s prime minister in 2006, citing the precedent of Montenegro’s independence referendum. He rarely misses a chance to refer to impending or possible independence referenda in Scotland and Catalonia, so it is hardly out of character or surprising that he has now embraced the illegal Crimean referendum, especially since it was engineered by his political idol, Putin. Dodik has openly modelled his development of a ‘vertical of power’ structure on Putin’s operating system in Russia.\n\nBut that has begun to backfire. Violent demonstrations in early February by Bosnians angry at the lack of accountability, rampant corruption and general privation visited upon them have put the entire Bosnian political elite on edge. These were particularly widespread in Bosnia’s other entity, the Federation of Bosnia and Herzegovina, whose principal communities are Bosniaks (Bosnian Muslims) and Croats. But these sentiments hold sway state-wide. In Republika Srpska (RS), Dodik’s concentrated power has enabled him to engage in widespread and blatant intimidation of potential popular opponents, visibly manifest in heavier police patrols to deter gatherings. Even as he claims to be defending the RS from conspiracies, whether foreign or domestic, he has also attempted to tarnish the reputations of protesting Serb war veterans who, unlike him, actually fought for the RS.\n\nDodik reportedly sought credits in Moscow, like those offered to Viktor Yanukovych before he was ousted as Ukraine’s president, so as to be able to avoid relatively mild loan conditions set by the International Monetary Fund and, correspondingly, drive the whole state into further dysfunction. His own economic woes and fears of being toppled in October elections – or even earlier should he not be able to pay the bills – are already driving greater nationalist rhetoric and paranoid behaviour, such as moves to constrain foreign funding of NGOs – just as in Russia. He clearly hopes Russia will support his actions to undermine the Bosnian state.\n\nAs the international community’s former high representative in Bosnia, Paddy Ashdown, said on 18 March in Sarajevo: “We must act to close this new salient decisively.” Luckily, a united West has full capability to do just that. What has been lacking is the will to employ it.\n\nAs has been the case with European and Western responses to Ukraine, the weakest link has been Germany. In Bosnia, this has been manifest in resistance to a long-overdue European Union and Western policy review on how to use their broad array of tools and instruments more effectively. In contrast to its strong advocacy of financial conditionality within the eurozone, Berlin advocates a soft-touch in Bosnia: pacification through throwing more money at the country’s entrenched kleptocrats. This mollifies existing elites, but forestalls progress toward a functioning system. Ukraine demonstrates that such policies lead to greater corruption and less transparency. Yet Germany continues to insist on it.\n\nThe group supervising Bosnia’s compliance with the Dayton peace accords that ended Bosnia’s war in 1995, the Peace Implementation Council (PIC), includes Russia. It does not formally operate by consensus; Russian dissent manifested in footnotes to its periodic communiqués attest to that. Yet for too long Moscow has been able to play the opportunistic spoiler because the West has been divided. As recently as February, German diplomats said a recalibration of the international presence in Bosnia was “impossible” because Russia would not accept it. In the wake of Putin’s dangerous adventurism in Ukraine, such objections are no longer tenable. Berlin must now unequivocally get on-side for a new policy.\n\nTwo practical manifestations of this would be a decision by all Western members of the PIC to replace the current high representative – a European, Valentin Inzko – with a high-stature American politician and to restructure his or her office to enable it credibly to defend clear red lines: enforcing Dayton and protecting state institutions and processes. The other would be to beef up the EU’s military deterrent force, EUFOR, so that it could cope with forseeable security challenges, including any moves by Republika Srpska toward independence. Western unity on these moves can still outflank Russian opposition.\n\nRussia’s capacity for mischief in Bosnia – while far less than in Ukraine, the Caucasus, or Transnistria – is still substantial. It comes at no cost to Moscow so long as the West is divided. This has long been evident in PIC meetings and Russia’s blatant favouritism toward Republika Srpska as its client entity. But given Putin’s clearly growing appetite for confrontation and aggrandisement, it is best to preclude it in the Balkans completely. A new pan-Western strategy is necessary in its own right in Bosnia. It is long overdue. Developing and adopting one now will make clear that the Balkans are off-limits for Russian opportunistic adventurism. Doing so will also dramatically reduce the ability of Dodik and the rest of Bosnia’s unaccountable elites to evade the reckoning with their citizens that they so richly deserve.\n\nKurt Bassuener is a senior associate of the Democratization Policy Council, a think-tank. He lives in Sarajevo."],
      "url": "https://www.politico.eu/article/deny-moscow-a-new-front-in-bosnia-2/",
      "scraped_at": "2025-11-14T13:13:57.444846",
      "paragraph_count": 0
    },
    {
      "title": "Overstepping the boundaries",
      "content": ["Western governments must be prepared to set red lines, and need to be ready to respond if Russia crosses them.\n\nCopy Link\n37568\nMarch 26, 2014 9:50 pm CET\nBy John Wyles\nIt is grim, but not a fairy story. Europe awakes after a long sleep and, disoriented, fails to recognise its surroundings. There is much that is still familiar: the capital cities are where they have always been, road and rail communications are still working and Angela Merkel is still in charge. Nevertheless, everything is the same but very different. All changed by one single act: Russia’s annexation of Crimea.\n\nTo general surprise and shock Vladimir Putin’s land grab has derailed an apparently stable world order whose permanence had been taken for granted in western capitals for more than 20 years. Having believed that 21st-century geopolitics are firmly grounded in collective respect for rules and international law, western governments are now being forced to re-examine their assumptions about Russia’ s approach to foreign policy.\n\n“Russia is acting much more like an adversary than a friend,” says the head of the United States and NATO’s forces in Europe, warning last weekend that the build-up of Russia’s forces on Ukraine’s eastern border is “very, very sizeable and very, very ready”. Norbert Röttgen, chairman of the Bundestag’s foreign affairs committee, was still reeling from shock and spoke for many across Europe when he confessed last week that all his assumptions about the post-Cold War world were in tatters. If someone had asked him a couple of months ago whether Russia was a threat to European stability, “I would have dismissed the idea out of hand.” Now Putin’s Russia “seems to be writing a new chapter in a book we thought we had closed a long time ago”. The Russian president is “openly affirming that he is not willing to play by our rules of international relations”.\n\nCrushingly, the challenge facing western governments begins with having to accept that the Ukraine has lost Crimea and that ipso facto national borders in Europe can be forcibly redrawn. The question now is whether Putin’s ambitions are satisfied. Does he feel that he has gained the respect for Russia he craves or does he need to make a complete meal of Ukrainian sovereignty? Should we, then, expect Russia to foment internal disorder in the east of the country to justify another military intervention in defence of ethnic Russians?\n\nUS and NATO leaders are beginning to realise they need a red lines strategy that sets behavioural barriers for Moscow. The first task is to change mindset and recognise that Putin, who once proclaimed the vision of a “common European house” has now burned it down. But what could this mean? After Crimea, is there now a real danger that Putin will scoop up the ethnic Russian enclaves in Moldova’s Transnistria region together with Abkhazia and South Ossettia in Georgia? Inevitably, strategic planning in the NATO alliance must acknowledge that there is a much greater risk of military conflict with Russia than previously thought. If the Kremlin is to be deterred from playing fast and loose with international law in spurious defence of Russian-speaking minorities, it will need to be convinced that the stakes are high.\n\nIn the meantime, political isolation, though imperative, will do nothing to contain Russia. Effective economic sanctions are needed to impose real costs on the Russian economy. Those so far adopted by the US and European Union – travel bans and asset freezes for three or four dozen of Putin’s ruling elite – are inflicting pain but will not be decisive. Moscow will retaliate by imposing crippling gas-price rises on Ukraine and implying that Germany and eastern Europe should not take Russian gas supplies for granted. A tit- for-tat game is in prospect with Putin gambling on Europe’s extreme reluctance to levy really costly sanctions. De-escalation – the current objective of sanctions policy – will be as difficult to achieve as it is to define.\n\nThis is a defining moment for the EU and, particularly for Germany. The country’s instincts are anything but martial and foreign policy is determinedly driven by economic interest. An internal debate on whether Germany needs to assume more international responsibilities has been meandering inconclusively since last September’s elections. It now has real meaning for Germany and for Europe. If Berlin is fundamentally indulgent and confirms Putin’s view that its real economic interests will not be put on the line, then short-term policies will be weak and ineffective.\n\nAngela Merkel is the only European leader with the power to ensure that the EU’s short-term policy has enough backbone to defend red lines. But she also has to encourage other heads of government to reshape medium-term policies towards Russia. The need to diversify energy supplies is a no-brainer. Europe takes 30% of its gas supplies from Russia and should take much less in future. Technology transfers and arms sales to Moscow must also be reviewed. Most difficult of all, perhaps, is the need to spend more on defence and security. Neither the US nor Europe wants a return to the Cold War in Europe, but if you set red lines you must ultimately be prepared to defend them.\n\nJohn Wyles is an independent consultant based in Brussels."],
      "url": "https://www.politico.eu/article/overstepping-the-boundaries-3/",
      "scraped_at": "2025-11-14T13:13:57.648316",
      "paragraph_count": 0
    },
    {
      "title": "Showing determination",
      "content": ["If we cannot send soldiers, let us at least send observers to Ukraine (and to Moldova).\n\nCopy Link\n37707\nApril 2, 2014 8:50 pm CET\nBy Grzegorz Gromadzki\nThe coming weeks and months will see Russia making an effort to destabilise Ukraine at all costs, especially in the east and south of the country. The aim will be to engender chaos and prevent the Ukrainians from conducting presidential elections, scheduled for 25 May.\n\nThe Russian foreign ministry has already officially announced that it will not recognise the result of these elections, and President Vladimir Putin will want to show that the current Ukrainian government does not control the country. That is why it must be a priority for the European Union’s aid policy to counter further Russian aggression against Kiev. We must not permit a repeat of the sequence of events in Crimea, when the EU and the West as a whole merely reacted to Russian actions, always a few steps behind. We must take the initiative and hinder Russia’s efforts to destabilise Ukraine, efforts that could lead to armed aggression.\n\nApart from sanctions, one of the key weapons we have at our disposal is the option of mobilising the greatest possible number of international observers and sending them to Ukraine and especially to the south and the east of the country.\n\nThe presence of observers would, clearly, not guarantee that Russia would desist from taking action against Kiev, but it would certainly make life more difficult for them, and would demonstrate the EU’s resolve. This is why the Organization for Security and Co-operation in Europe (OSCE) observation mission currently in place should be speedily boosted to 500 people.\n\nAt the moment the mission has approval from member states for 100 observers and could be augmented by a further 400. If there is delay in sending a further 400 OSCE observers, the EU must revive its idea of sending a separate mission of least 400. The majority of these should be sent to southern and eastern Ukraine.\n\nAt the same time, the EU Border Assistance Mission on the Ukrainian border with Moldova should be strengthened by at least 50% (at the moment, it numbers around 100 people from the EU and a further 120 from Moldova and Ukraine). More personnel should be sent to the stretch of the Moldovan-Ukrainian frontier controlled by Transnistria, a breakaway region of Moldova in which Russian soldiers are stationed.\n\nThe Kremlin will certainly try to disrupt the presidential election. This is why the OSCE’s separate election-observation mission – created by its Office for Democratic Institutions and Human Rights (ODIHR) – should be supplemented by a strong mission from the European Parliament and missions organised by EU member states. The ODIHR mission comprises 100 long-term and 900 short-term observers. The international community as a whole should ensure that several thousand international observers are eventually in place.\n\nThe Russians might also seek to destabilise the situation in Moldova. Moldova is de facto defenceless, making it easier for groups of masked ‘unknown’ soldiers to act in Chisinau and other Moldovan towns. The EU should therefore also send an observation mission to Moldova, made up of a minimum of 100 people.\n\nIf we cannot send soldiers, let us at least send observers. Let us show Putin and his friends that we are determined to protect the right of the Ukrainians to choose their own future. We can be sure that the Russian president will make very determined efforts to hinder the Ukrainian people from that sovereign choice.\n\nGrzegorz Gromadzki is a co-ordinator of an informal group of Polish non-governmental think-tanks dealing with international affairs."],
      "url": "https://www.politico.eu/article/showing-determination/",
      "scraped_at": "2025-11-14T13:13:57.823151",
      "paragraph_count": 0
    },
    {
      "title": "A year of crisis and instability on the EU’s doorstep",
      "content": ["Major problems in the east and in the south.\\n\\nCopy Link\\n37735\\nApril 2, 2014 9:10 pm CET\\nBy Andrew Gardner\\nIn its annual review of the European Union’s neighbourhood, the European Commission described 2013 as “a year of crises”. That was on Thursday (27 March). Hours earlier, on Wednesday, the chief of Egypt’s army, Abdel Fattah al-Sisi, had announced he would run for the presidency, a move that augurs another crisis between the military and large parts of Egyptian society.\\n\\nThe Commission had already delayed the report by a week, to accommodate the thoughts of EU leaders at a summit on 20-21 March that was dominated by Ukraine. At present, there does not seem to be a crisis-free week in which to publish a report.\\n\\nIn their dry, neutral tone, the Commission’s country reports display the impact of the multiple crises on the region and on relations with the EU – Syria’s destabilising impact on Jordan and Lebanon, and Russia’s on Ukraine and Armenia, both of which decided at the last minute last year not to sign landmark agreements with the EU. Even where little changes, in the Palestinian territories, a sense of looming crisis emerges. And there is a separate category, of countries where the crises are too big for the EU to have established a work plan for the relationship – Syria and Libya – or where the rulers are too unwilling to agree one, Belarus and Algeria.\\n\\nThere are some bright spots. A sense of genuine dynamism emerges from the report on Moldova. In Georgia, too, the progress is notable. Both, though, are also highly vulnerable to the uncertainty created by Russia: in both cases, Russian troops are already stationed on soil that they consider theirs – Moldova’s Transnistrian region and Georgia’s regions of South Ossetia and Abkhazia. Tunisia this year passed a relatively liberal constitution. It is, as one national diplomat put it, “the brightest hope of reform for democratic politics” and a country where “we think the EU can be particularly supportive”. But the report itself is more toughly worded than such assessments might suggest – or perhaps the Commission’s candour there is a measure of how diplomatic its wording is in many other reports.\\n\\nAnother potential method to measure countries’ progress is to look at the money (see table). The EU’s guiding principle in its neighbourhood is ‘more for more’ – more progress, more money. That is a reasonable way to understand the low support for Belarus and Azerbaijan. But the principle is affected by need and the EU’s political commitment, hence the large figure for Palestine. In many cases, the EU’s political commitment – the money offered – far outstrips neighbours’ willingness or ability to meet the conditions. The gaps between what is on offer and what is absorbed are striking in many countries. Again, a trio of small states – Moldova, Georgia and Tunisia – emerge at the front of the pack.\\n\\nThe variance in progress – in willingness or ability (or both) – demonstrates the challenge for the European Commission in establishing policies for or relationships with the EU’s neighbours. The notion of the EU as a pole of attraction for its neighbours does not emerge well from the reviews.\\n\\nAn alternative view may soon gain traction. EU officials and diplomats are now used to talking about an ‘arc of instability’ across Africa’s Saharan and Sahel regions; but Greece’s defence minister, Dimitris Avramopoulos, last Thursday applied the term to another region. Addressing the annual conference of the European Defence Agency, Avramopoulos said: “If we take a look at the neighbouring regional reality, we will clearly see an arc of instability stretching from the Ukraine to the northern shores of Africa.”\\n\\nThe next European Commission and the EU’s next foreign policy chief have much to ponder.\\n\\nTHE REPORTS IN BRIEF\\nThe European Union’s neighbourhood policy covers 16 countries. Four countries – Algeria, Belarus, Libya and Syria – have not agreed ‘action plans’ with the EU on steps to be taken to improve the rule of law and democracy and to develop a market economy. Below are developments during 2013 that were highlighted by the European Commission in the annual progress reports on the 12 countries that have agreed action plans. The most beneficial – and demanding – agreements that the EU currently offers to countries in the neighbourhood are political agreements of association, which include a new generation of trade provisions called ‘deep and comprehensive free-trade agreements’ (DCFTAs).\\n\\nUKRAINE\\nPolitical relationship: Prepared but did not sign association agreement; late in the year a political crisis erupted, leading to mass street protests and (this year) the departure of President Viktor Yanukovych and a Russian invasion. Trade and business relationship: Prepared but did not sign DCFTA; initialled aviation agreement; failed to resolve trade cases (car-recycling fees, local content of renewable energy equipment); needs to do more to comply with Energy Community Treaty.\\n\\nVisas and migration: Addressed “some” recommendations in visa liberalisation action plan with EU, including adoption of legislation.\\n\\nOther successes: “Positive developments” with reform of judiciary and self-governance; “some progress” on cases of selective use of justice; “good progress” against human trafficking; “improvement” in anti-corruption legislation.\\n\\nOther weaknesses: “No work” on improving laws on presidential and local elections; corruption; “backsliding” on public procurement and budget transparency; media freedom worsened during Euromaidan protests. Need for: Constitutional reform; “reliable and uniform” electoral system; reform of prosecutor-general’s office, judiciary, police; anti-corruption efforts in “all areas of public life”; compliance with international refugee and human-rights law. Need to improve the business climate and prepare for IMF support.\\n\\nMOLDOVA\\nPolitical relationship: Political crisis in early 2013, but managed to initial association agreement; “significant efforts” to implement agreement on civil protection, participate in EU agencies and programmes, and co-operate with EU common security and defence policy.\\n\\nTrade and business relationship: Initialled DCFTA; “significant efforts” to implement agreements on aviation and agriculture.\\n\\nVisas and migration: Completed implementation of visa liberalisation action plan.\\n\\nOther successes: Addressed “many” key recommendations, including reform of judiciary, law enforcement, regulations and business sectors; restructured anti-corruption framework; progressed with human-rights action plan and plan for Roma minority; and continued to de-politicise and professionalise public administration.\\n\\nOther weaknesses: Need to revise the constitution, to implement DCFTA and association agreement and to deepen reform of public administration. Need to make greater efforts to curb corruption, to reform justice and law enforcement, to consolidate systems related to human rights and fundamental freedoms, to reform public broadcaster and education system. Business climate needs improving, including continued privatisation. “Little development” in talks with breakaway region of Transnistria.\\n\\nTUNISIA\\nPolitical relationship: Developed at “moderate pace” (‘national dialogue’ accelerated late in the year); new ENP action plan yet to be finalised.\\n\\nTrade and business relationship: Signed pan-Euro- Mediterranean rules of origin; continued talks on aviation agreement; preparations for DCFTA talks not yet completed.\\n\\nVisas and migration: Established dialogue on migration, mobility and security.\\n\\nOther successes: Progress on consolidation of democracy (including on a new constitution, legal and financial reforms, judiciary, corruption, torture); progress on electoral procedures; “significant progress” on public finances.\\n\\nOther weaknesses: “No progress” on military courts; “significant barriers” to freedom of assembly and expression; “excessive use of force” against demonstrators; journalists and activists jailed; “significant concern” about violence against women. Concerns also include: treatment of migrants and asylum-seekers; reform of judiciary and security and law-enforcement sectors; business climate; uneven economic development; energy subsidies; banking sector; public-finances funding.\\n\\nMOROCCO\\nPolitical relationship: “Particularly dynamic” year.\\n\\nTrade and business relationship: Began talks on a DCFTA; “good progress” on harmonisation of rules on industrial goods.\\n\\nVisas and migration: Established a ‘mobility partnership’.\\n\\nOther successes: “Most” recommendations acted on, including some progress on discrimination, corruption, justice reform; worked on anti-corruption strategy; strengthened laws on money-laundering and terrorist financing.\\n\\nOther weaknesses: “Limited” implementation of “ambitious” political reforms; “disproportionate” force used against demonstrators; reform of media law not completed; use of military courts; implementation of migration and policy plans; social-security systems; corruption; subsidies system.\\n\\nEGYPT\\nPolitical relationship: “Politically a very challenging year”; “no particular progress” with EU action plan.\\n\\nTrade and business relationship: Signed pan-Euro- Mediterranean preferential rules of origin; “limited progress” on harmonisation of technical rules on industrial products; “little interest” in starting talks on a DCFTA.\\n\\nVisas and migration: Not highlighted.\\n\\nOther successes: “Some signs of [economic] stabilisation.\\n\\nOther weaknesses: Constitution; conditions for civil society; freedom of assembly and press “deteriorated”; women’s rights; asylum rules; torture camps; judiciary, including military courts; weak social-safety net.\\n\\nLEBANON\\nPolitical relationship: Despite political, security and refugee crises, still committed to “strong” engagement with EU. Lebanon started start implementing second ENP Action Plan; EU “substantially” increased “extent and intensity” of support.\\n\\nTrade and business relationship: “Limited progress” on harmonisation of rules on industrial goods; need for WTO accession and ratification of Euro-Mediterranean preferential rules of origin.\\n\\nVisas and migration: Not mentioned.\\n\\nOther successes: “Commendably” open to refugees; “took up several” EU recommendations; drafted laws on public procurement, corruption, and migration; human rights and freedoms “generally well-respected”.\\n\\nOther weaknesses: Social and political systems under strain from Syrian refugees; need for electoral and judicial reform; public finance management; “urgent” energy-sector problems; some censorship.\\n\\nAZERBAIJAN\\nPolitical relationship: Negotiations continuing on association agreement and on ‘strategic modernisation partnership’.\\n\\nTrade and business relationship: Azerbaijan is selected route for gas pipeline to Europe; “no significant progress” toward World Trade Organization accession (a pre-condition for DCFTA talks).\\n\\nVisas and migration: Signed visa-facilitation agreement and mobility partnership in 2013.\\n\\nOther successes: Pipeline “should reinforce” Europe’s energy security; some anti-corruption measures.\\n\\nOther weaknesses: “Very little progress” on democratic governance and human rights; “serious concerns” about elections; failure to honour commitments to Council of Europe; stalemate over Nagorno-Karabakh conflict, including refusal to give access to EU officials.\\n\\nJORDAN\\nPolitical relationship: Increased EU aid because of the ‘severe’ effects of Syrian crisis.\\n\\nTrade and business relationship: Ratified pan-Euro- Mediterranean preferential rules of origin. Progress in three areas on harmonising rules on industrial goods.\\n\\nVisas and migration: Talks began on a establishing a ‘mobility partnership’.\\n\\nOther successes: “Acted upon a number of key recommendations”, including anti-corruption strategy.\\n\\nOther weaknesses: Arrests of opponents; websites blocked; restrictive media laws; corruption a “serious concern”; “no progress” on independence of the judiciary. Need to repeal or amend constitutional amendments from 2011, to integrate women, to sign IMF programme, to improve business climate and to modernise controls of public finance.\\n\\nARMENIA\\nPolitical relationship: Negotiations completed for an association agreement, but deal not initialled.\\n\\nTrade and business relationship: Negotiations on DCFTA completed, but not initialled.\\n\\nVisas and migration: Visa facilitation and readmission agreements entered into force on 1 January 2014.\\n\\nOther successes: Addressed “some” of the EU’s key recommendations; law on equal rights; preparation for electoral, rights and anti-corruption reform; “generally well-administered” elections; freedoms of association and assembly “generally respected”.\\n\\nOther weaknesses: “Mistrust” of judiciary, “lack of convincing results” on corruption, “allegations of use of torture”, increased violence against activists, stalemate over Nagorno-Karabakh conflict.\\n\\nISRAEL\\nPolitical relationship: EU offers ‘special privileged partnership’ if peace deal is struck; agreement on Israel’s participation in EU’s Horizon 2020 research programme.\\n\\nTrade and business relationship: Agreement on harmonisation of technical rules for industrial goods enters force. Signed aviation agreement; signed pan-European rules of origin. Some sanitary and food issues, and technical barriers to trade remain.\\n\\nVisas and migration: No discussions.\\n\\nOther successes: Addressed “some” recommendations, including “limited progress” on decreasing use of administrative detention of Palestinians.\\n\\nOther weaknesses: Increased settlement activity and demolitions; “heavy restrictions” on Gaza Strip; respect for international law and human rights in occupied territories; treatment of irregular migrants and asylum-seekers; internal procedures for stateless people; minority rights; intellectual property rights; carbon emissions; independence of the Equal Employment Opportunities Commission.\\n\\nPALESTINE\\nPolitical relationship: “Major step forward” in form of a new ENP action plan; EU continues rule-of-law mission; EU ready to reactivate Rafah border mission; EU offers ‘special privileged partnership’ if peace deal is struck.\\n\\nTrade and business relationship: Signed pan-Euro- Mediterranean preferential rules of origin; comprehensive National Export Strategy is “a major achievement”; Israeli restrictions “severely” limit effectiveness of EU measures to stimulate the private sector.\\n\\nVisas and migration: Not mentioned.\\n\\nOther successes: “Increasing” investigations into corruption.\\n\\nOther weaknesses: Israeli occupation “biggest obstacle to reforms, especially to the [Palestinian Authority’s] financial sustainability”; PA’s authority “not effective in the Gaza Strip”; Legislative Council “paralysed”; deteriorating freedom of expression in Gaza; “most” key recommendations not addressed; transparency and accountability of justice and security sectors; human-rights standards; integration of women; public-sector reform; water and waste-water management system.\\n\\nGEORGIA\\nPolitical relationship: Initialled association agreement; “intensive” political dialogue with EU; “important” progress on security co-operation.\\n\\nTrade and business relationship: Initialled association agreement. Visas and migration: “Significant progress” in implementing visa facilitation and readmission agreements.\\n\\nOther successes: Acted “on most of the [EU’s] key recommendations”; elections “in line with international standards”.\\n\\nOther weaknesses: More action needed on separation of powers, judicial and policing reforms, media pluralism, “zero tolerance” on hate speech, preparations to implement DCFTA.\""],
      "url": "https://www.politico.eu/article/a-year-of-crisis-and-instability-on-the-eus-doorstep/",
      "scraped_at": "2025-11-14T13:13:57.987853",
      "paragraph_count": 0
    },
    {
      "title": "Pro-EU parties ahead in Moldova",
      "content": ["Pro-Russian party wins in late surge, but the balance of seats favours pro-European parties.\r\n\r\nCopy Link\r\nHigh turnout expected in pivotal Moldovan vote\r\nDecember 1, 2014 10:58 pm CET\r\nBy Andrew Gardner\r\nPro-European parties in Moldova have emerged with a narrow parliamentary majority from national elections that international observers said were characterised by a battle over the country’s geopolitics.\r\n\r\nWith 94% of votes counted, the strongest party in the parliament is the Socialist Party (PSRM), whose leadership Russia has been courting. It secured 21.2% of the votes cast in the election yesterday (30 November). The third-largest group in parliament, the Communist Party of Vladimir Voronin (PCRM), has also adopted policies seen in Moldova as favouring Russia. Its share of the vote is 17.9%.\r\n\r\nHowever, they may lose out in the post-election coalition-forming to three pro-European parties that operated together in government from 2009 until March 2013. The combined tally of the three parties – the Liberal Democrats (PLDM), with 19.6%, the Democrats (PD) with 15.8%, and the Liberals (PL) with 9.5% – is 44.9%. The PSRM and PCRM have 40.1%. A third left-wing party, the Communist Reformist Party, gained 5.0% of the vote, but fell short of the 6% needed to gain seats in parliament.\r\n\r\nCurrent calculations give the potential pro-European alliance 56 seats in the 101-member parliament, against 45 for the Socialists and Communists.\r\n\r\nPast tensions between the Liberal Democrats, Democrats and Liberals could, however, make the formation of a pro-EU government uncertain. The Liberals left the government last year.\r\n\r\nVlad Filat, the Liberal Democrats’ leader, said: “Moldova must remain an independent state and not a vassal state”, referring to Russia.\r\n\r\nIgor Dodon, the Socialists’ leader, said that his party would make “the European integrationists shake with fear”. Both the Socialists and Communists have been advocating closer economic integration with Russia, which has invited Moldova to join the Russia-dominated Eurasian Economic Union (EEU), a customs union. Dodon said today that he would call a motion in parliament in favour of a referendum on joining the EEU.\r\n\r\nThe election process\r\n\r\nIn the closing days of the election campaign, which saw the governing parties stage a powerful comeback after a year-long slump, the central election commission banned a pro-Russian party, Patria (Homeland), on the grounds that it had received illegal funding from abroad.\r\n\r\nElection monitors from the Organization for Co-operation and Security in Europe (OSCE), a 57-country group whose members include Russia, said that voters had a wide choice, parties’ access to the media was “unimpeded”, the elections were “generally well administered”, and the legal framework was “adequate”. It also said that the campaign had been “largely substantive” and that language and identity issues “did not feature predominately in the campaign”.\r\n\r\nHowever, the OSCE said that Patria’s de-registration “raised questions about the timing and circumstances”, while the head of the OSCE’s team, Emin Önen, said that “the late removal of a highly visible party from the ballot cast a shadow over the final days”.\r\n\r\nÖnen also stated that “geopolitical aspirations” were “at the heart of the campaign”, an oblique reference to Moldova’s emergence as another point of friction between the EU and Russia.\r\n\r\nMoldova shares a border with Ukraine, which over the past nine months has lost control of parts of two eastern regions and seen another – Crimea – annexed by Russia since pro-EU and anti-government protests led to the emergence of a pro-EU administration in Kiev. Like Ukraine, Moldova has this year taken a major step in the direction of the EU by signing a political and trade deal – an association agreement – with the EU that would, if implemented by Moldova, lead to far-reaching reform of its economy and governance.\r\n\r\n“The EU now looks forward to the swift formation of an inclusive and accountable government, as well as a constructive opposition,” the EU’s foreign policy chief, Federica Mogherini, and the European commissioner for the EU’s neighbourhood, Johannes Hahn, said in a joint statement. They said that they EU would support Moldova “on its path towards more transparency, rule of law and a stronger market economy”.\r\n\r\nDmitry Rogozin, one of Russia’s deputy prime ministers, accused the Moldovan authorities of disenfranchising the many Moldovans who live in Russia.\r\n\r\nAccording to Sputnik, a news outlet funded by the Russian government, Rogozin claimed that there are 700,000 Moldovans in Russia and argued that inclusion of their votes and those of Patria supporters would have rendered the real proportion of pro-European voters “insignificant”.\r\n\r\nRogozin, who is subject to sanctions by the EU and the United States for his role in Russia’s annexation of Crimea in March, also reportedly said that the Moldovan government should “think carefully about the country’s European integration”.\r\n\r\nThe OSCE has not commented specifically on the conduct of the elections abroad. However, it noted “the lack of transparency with regard to the criteria for determining the number and location of polling stations abroad” and said that this had “contributed to the perceptions of a number of stakeholders” that the government was trying to discourage voting in Russia. “The number and locations of polling stations abroad was widely discussed during the campaign,” it said.\r\n\r\nIn all, 95 polling stations were opened in 31 countries, five of them in Russia. Figures on the number of Moldovans living abroad vary from 300,000 – from the statistics office – to about 700,000, from the central bank. A minority of diaspora Moldovans live in Russia.\r\n\r\nThe central election commission put the number of eligible voters at 3.2 million, up from 2.7 million in the 2010 parliamentary elections. According to the OSCE, the election commission attributed this increase of roughly 500,000 to population growth and the inclusion of voters living abroad and voters in Transnistria. Voting was impossible in Transnistria, which broke away from Moldova in 1992. It is unclear how many of the estimated 500,000 Transnistrians were considered eligible to vote by the election commission.\r\n\r\nThe election campaign\r\n\r\nThe election campaign saw pro-EU parties come from behind and produce a major change in the balance of power on the left, with the Socialists gaining as much as 18 percentage points over the campaign. Its surge was helped by the roughly 10% of Moldovans who had told pollsters that they would support Patria prior to the party’s de-registration. The Communists had begun the campaign with a sizeable advantage over all other parties. Their final tally was a little over half of their best rating during the campaign.\r\n\r\nKamil Całus of the Warsaw-based Centre for Eastern Studies (OSW), says that during the campaign Russia switched its support away from the Communists in favour of Patria and the Socialists. The Socialists had benefited from strong support on Russian media, which are widely viewed and listened to in Moldova, and by a visit by Dogon to Moscow on 4 November to meet Russian President Vladimir Putin.\r\n\r\nDuring the campaign, Russia increased its economic pressure on Moldova, banning all imports of live animals and meat products. It had already barred imports of Moldovan wine, fruit and vegetables, and some meat products. However, it also chose to extend a gas-supply agreement with Moldova by a year, rather than act on an earlier threat to turn the taps off.\r\n\r\nMoldova’s relationship with the EU has deepened significantly over the past year. Moldova is already benefiting from trade privileges contained in the association agreement between Moldova and the EU, which was signed on 27 June and which is now being ratified by the EU’s member states. On 28 April, the EU also granted Moldovans with biometric passports the right to travel to the EU without visas for up to three months. The EU has also said it is willing to provide Moldova with between €335 million and €410m between 2014 and 2017 to develop its agricultural sector, reform public administration, and modernise its policies and border management."],
      "url": "https://www.politico.eu/article/pro-eu-parties-ahead-in-moldova/",
      "scraped_at": "2025-11-14T13:13:58.122111",
      "paragraph_count": 0
    },
    {
      "title": "Moldova election: Pro-EU parties edge pro-Russian rivals",
      "content": [
        "This video can not be played",
        "Ben Bland reports on results from Moldova's parliamentary elections",
        "Latest results from Moldova's parliamentary elections show that pro-EU parties have a narrow lead over those backing closer ties with Russia.",
        "With most of the votes counted, the three pro-Western parties have about 44%. The opposition has 39%.",
        "No party appears to be able to form a government, and tough post-election bargaining is predicted.",
        "The elections have taken on a wider significance in the shadow of the conflict in neighbouring Ukraine.",
        "Moldova and Ukraine have signed far-reaching partnership agreements with the EU, bitterly opposed by Russia.",
        "On the eve of the vote, one pro-Russian party was banned from Sunday's poll - a move criticised by Russia.",
        "Residents of the Russian-backed breakaway region of Trans-Dniester did not take part in the election.",
        "Analysis by Nick Thorpe, BBC Central Europe correspondent",
        "The three pro-EU parties will have a big enough majority to form a government. But those aspirations have been dented by the strong showing of the Socialist Party, which wants Moldova to join Russian President Vladimir Putin's planned Eurasian Union instead.",
        "As the largest single party in the new parliament, Socialist leader Igor Dodon promised that his party in opposition would make the \"European integrationists shake with fear\".",
        "Tough bargaining lies ahead. One reason for the fall in support for the pro-European parties - from 52% at the 2010 elections, to 44.6% per cent now - was their history of infighting. Another reason was their perceived corruption.",
        "The election also showed a change in popularity for the three main pro-Russian parties. The younger and more outspoken Socialists overtook the Communists.",
        "According to latest results, the three pro-European parties are set to have 57-58 seats in Moldova's 101-seat parliament, while the two pro-Russian opposition parties are expected to hold 43-44 seats, reports say.",
        "The pro-Russian Socialist Party came first with 21% of the vote. The Communist Party was in third with almost 18%. The party is a Soviet-era survivor that still uses the hammer and sickle as its symbol, although it is not seen as fundamentally opposed to EU integration.",
        "The pro-EU Liberal Democrats were in second place with 19%. The party wants Moldova to achieve EU candidate status by 2017 and full membership by 2020. Two other pro-Europe parties - the Democrats and the Liberals - were on  16% and 9% respectively.",
        "There have been reports that the pro-EU parties may now try to form a \"grand coalition\" with the communists to keep the country on the European track.",
        "Between East and West - Russian dolls can be bought in Chisinau markets",
        "Ukraine has been in crisis since last November, when the former leadership made a last-minute U-turn, refusing to sign a landmark association and free trade deal with the EU - under huge pressure from Russia.",
        "This triggered mass protests in Ukraine that ousted President Viktor Yanukovych, and Kiev later signed the EU deal. But the protests, in turn, led to Russia annexing southern Crimea peninsula in March and throwing support behind separatist rebels in eastern Ukraine.",
        "Ahead of the Moldova vote, analysts said poll ratings of the Socialists, who want Moldova to turn its back on the EU and join a Russia-dominated economic bloc, had been boosted by their populist campaigning, including concerts by Russian pop stars.",
        "Moldova remains one of the poorest countries in Europe",
        "The pro-Moscow parties had been expected to pick up additional votes after the decision to ban the pro-Russian Fatherland party, on the grounds that it had illegally received foreign funding.",
        "Fatherland, whose leader fled to Russia, denies the claim.",
        "Turnout was just under 56%, the central electoral commission said, out of a total of 2.7 million eligible voters.",
        "Parties need to get at least 6% of the vote to gain seats in parliament.",
        "The opposition was also hoping to capitalise on the growing economic problems under the pro-Western government in Moldova - one of Europe's poorest countries.",
        "The situation worsened after a Russian ban on imports of Moldovan agricultural products - including wine, meat, fruit and vegetables.",
        "Will Moldova choose EU or Putin?",
        "Russian wine ban hits Moldova",
        "Putin wants say in Moldova-EU trade",
        "Moldova country profile",
        "The plight of Moldova's orphanage children",
        "Liberal Democratic Party"
      ],
      "url": "https://www.bbc.com/news/world-europe-30265985",
      "scraped_at": "2025-11-14T13:13:58.257399",
      "paragraph_count": 35
    },
    {
      "title": "The plight of Moldova's orphanage children",
      "content": [
        "Reliance on the state partially explains the number of children brought up in institutions",
        "More than 7,000 children have been placed in state-run institutions in Europe's poorest country, Moldova, and only 2% are orphans.",
        "While the horror stories of the orphanages of 1990s Romania were widely publicised, the conditions facing children in neighbouring Moldova are not well known.",
        "Widespread poverty and a lack of basic social services are blamed for a situation which aid groups argue violates a child's right to a family, as enshrined in theUN Convention on the Rights of the Child,external.",
        "In the capital, Chisinau, the institutions are surprisingly well maintained.",
        "From the outside, the one I was able to visit looked like a school, with plants and a play area, while inside there were pictures on the walls and toys on display.",
        "Yet the first thing you notice is how quiet it is: dozens of young children live in the institution, but you do not hear any noise.",
        "The toys are not being played with; instead children are lying in cots. In one room is a group of about a dozen toddlers.",
        "Some parents leave Moldova to seek work, and leave their children behind",
        "They believe their children will be better off under the care of the state",
        "These youngsters rarely go outside, says Lavinia (not her real name), who works with Hope and Homes for Children, a charity that tries to return children to their families.",
        "Instead, the children spend almost all of their time in just two rooms.",
        "In the corner, a disabled child is left lying in vomit.",
        "No pictures indoors are allowed.",
        "The manager says there are not enough staff to take the children outside, although there appear to be more staff than children.",
        "Lavinia is clearly frustrated by the attitude, but there is little she can do, even though she is working with local authorities on reforming childcare services.",
        "\"What we need is to inform and educate families,\" she says.",
        "\"If we can develop family alternatives, this would prevent more children having to live like this.\"",
        "In another room, 10 newborns lie alone in cots. The institution's manager does not know their sexes.",
        "The standards are shocking for Sarah Butterworth, a UK mental-health specialist on children in care who is visiting at the same time.",
        "\"[Knowing] how the brain develops in the first few months of life means I can only imagine the damage that is happening before our eyes,\" she says.",
        "But experts say institutions are often the worst way to raise children",
        "In one institution, the children simply did not go outside",
        "Although basic needs appear to have been met, these do not look like valued children.",
        "Most of them are not even orphans; they have families but have been abandoned because of poverty and an outdated social reliance on state care.",
        "Moldova's Soviet legacy still remains, and reliance on the state care is embedded in people's attitudes and the law, according to Dr Delia Pop of Hope and Homes for Children.",
        "\"For many, institutional care has become the only option,\" she says. \"The irony is that it gets called 'childcare', even though this is one of the most damaging systems for children.\"",
        "The authorities accept changes are needed but say one of the biggest obstacles is the weakness of the Moldovan economy.",
        "\"We want to reform institutions for babies and young children,\" says Svetlana Chifa, head of the Child Protection Department in Chisinau.",
        "Unemployment in Moldova is high and young adults often head abroad to find work, leaving their children behind to the state.",
        "They believe what they are doing is for the best.",
        "There is also the stigma of disability. A three-year-old I visited, who has been helped into a foster family, was abandoned simply because he was born without an arm.",
        "The situation is even harder  in the breakaway eastern region of Trans-Dniester, which is technically part of Moldova but sees itself as a separate country.",
        "\"Trans-Dniester has an attitude for independence, and has strong connections with former Soviet countries,\" says Dr Pop.",
        "This gives aid workers additional challenges in encouraging co-operation to get children out of institutions and back with their families.",
        "Visiting the region is like going back in time.",
        "The region of Trans-Dniester lies on the Ukrainian border, and considers itself independent",
        "Placing children in such institutions is simply firefighting an ever-expanding, complex social problem rather than offering a long-term solution for the many children within their walls, says children-in-care specialist Sarah Butterworth.",
        "Even when compared with children living in the most deprived of households, children in care are more likely to grow up as dysfunctional adults.",
        "\"Years of research have shown the importance of family-based care and attachment, which children in institutions just aren't offered,\" she says.",
        "Developmental needs, attachment, love and consistency are overlooked.",
        "The authorities in Moldova acknowledge solving this problem is about changing ingrained attitudes and will not happen overnight, partly because many who work in such institutions have a vested interest in them remaining open.",
        "\"People are cautious about changes,\" says Svetlana Chifa.",
        "\"The institutions are their livelihoods and people could lose their jobs when they close.\"",
        "The children left behind",
        "Moldova country profile"
      ],
      "url": "https://www.bbc.com/news/world-europe-29204924",
      "scraped_at": "2025-11-14T13:13:58.368178",
      "paragraph_count": 46
    },
    {
      "title": "Moldova goes to the polls torn between Europe and Russia",
      "content": [
        "The small motorcade arrived along potted mud roads and past single-storey peasant homes and pulled up in the village of Parcani, near Moldova’s northern border with Ukraine. Out stepped the prime minister, Iurie Leanca, greeted by a small brass band, and he entered the village hall to try to pitch his vision for the country’s future.",
        "Behind him as he addressed a crowd of around 200 mostly elderly men and women, a banner read “Forward towards a European future”. Two flags were on display, the Moldovan one and that of the EU.",
        "“My strong belief is that 99% of Moldovans, irrespective of ethnicity or the language they speak, are Europeans. We want to get back to the family,” Leanca told the Guardian shortly after the speech. “Why these elections are so critical is that if our opponents win we will see a reversal of everything we’ve done.”",
        "On Sunday Moldova holds parliamentary elections that could decide whether the former Soviet nation continues on the path it has followed for the last five years, towards the EU, or turns back towardsRussia. Polls suggest the vote will be close, with the latest showing the pro-EU parties holding a slim majority. Arcadie Barbarosie, executive director of the Institute for Public Policy, a Chisinau-based thinktank, said: “The percentage of undecideds is very high, so it’s difficult to predict the results.”",
        "Moldova, home to a population of 3.5 million, is often described as the poorest country in Europe. Chisinau, the capital, is filled with faded Soviet-era apartment blocks. Beyond the main cities, paved roads quickly disappear. A quarter of the country’s GDP is estimated to come from remittances of Moldovans working abroad, most of them in Russia.",
        "The official language is Romanian, but many Moldovans’ first language is Russian and, like Ukraine, the country is divided between those who feel they are more European and those who feel closer to Russia. Moldova even has its own breakaway self-governing region in the east, Transnistria, where 1,500 Russian soldiers are stationed, the legacy of a 1992 civil war.",
        "Following the last parliamentary elections, in 2009, a coalition of three pro-EU parties formed a working majority in the 101-seat parliament, replacing the Communist party, which had dominated since independence in 1991.",
        "On 27 June this year Moldova, alongside Ukraine and Georgia, signed an association agreement with the EU allowing for greater economic relations and visa-free travel across Europe. Members of the governing coalition saw it as the latest step towards full EU membership, but not all Moldovans were happy. Moscow certainly wasn’t; it would prefer Moldova to become part of its custom union.",
        "Russia has applied strong economic pressure, banning the import of Moldovan wine and then fruit, vegetables and finally meat. Moldova relies on Russia for gas, and in the past Moscow has threatened to cut off supplies unless Chisinau toes the line.",
        "“Yes, the sanctions hurt us,” said Leanca. “We had to look for additional resources to compensate for those who grow apples, prunes, sell meat. The decisions made in Moscow on trade had an immediate impact but in middle and long term they help us to become stronger. What doesn’t kill you makes you stronger.”",
        "The bigger problem for Leanca and his coalition is domestic dissatisfaction with the government. A weak economy and little progress in dealing with endemic corruption have left many voters disenchanted and looking for a change. Political infighting among the coalition has not helped.",
        "“This government hasn’t done a good job on social issues,” said Vitalie Dorogan, a 41-year-old priest from Soroca, in the north of Moldova, who was undecided on whom to vote for and whether the EU was the right direction. “I think we should stay in the middle. The middle way is also a decision – to have good relations with both, but not joining either.”",
        "Last year the economy grew by 8.9%, the highest rate since independence, but this year growth is expected to be closer to 2%, despite the fact that exports to the EU have offset lost trade with Russia and its allies.",
        "“People are associating the bad economic situation with the EU integration process,” said Adrian Lupusor, executive director of Expert-Grup, an economic thinktank in Chisinau. “They associate the EU with the current government, which is seen as corrupt.” A recent report by the Institute of Public Policy suggested that if Moldovans were to choose between the EU and Russia’s custom union right now, 39% would vote for the former and 43% the latter.",
        "Sunday will be the first election since Moldova signed the EU association agreement, and the issue has been at the forefront of much of the political campaigning, with a lot of uncertainty surrounding what closer ties with the EU, and perhaps full membership down the line, actually mean.",
        "“Communication is essential,” said Leanca. “Unfortunately citizens of Moldova are targets of a campaign of disinformation without precedents. The level of lies that are disseminated, they are primitive, but unfortunately they are quite effective.”",
        "On Thursday Moldova’s appeal court disqualified a pro-Russian party from competing in the election, following allegations it had illegally used foreign funds to finance its campaign. The party, Patria – created a few months ago by Moldovan businessman Renato Usatii – is pro-Russian and opposes joining the EU. Usatii said on Friday that he had fled to Russia fearing arrest.",
        "In Parcani, Julita Caruntu, 68, who had come to listen to the prime minister speak, said: “I will vote for Leanca’s Liberal Democrat party. I think he’s a good man, his party has given a lot of help to our village. I am with Europe, I want Moldova to be inEuropean Union.”"
      ],
      "url": "https://www.theguardian.com/world/2014/nov/28/moldova-elections-torn-europe-russia",
      "scraped_at": "2025-11-14T13:13:58.486431",
      "paragraph_count": 18
    },
    {
      "title": "Will Ukraine's neighbour Moldova be the next east-west Europe flashpoint?",
      "content": [
        "It's a state that lived under Moscow's aegis for decades with a leadership that favours closer EU ties and a chunk of pro-Russian territory in the east that wants to secede. But it's notUkraine.",
        "Moldova's perilous geopolitical situation has become more urgent in the wake of the Ukrainian crisis, which appears to have deepened a 20-year-old division in Europe's poorest nation.",
        "Pulling east is the breakaway region of Trans-Dniester, a territory of just 300,000 which fought a short war with Moldova in 1992 and is technically recognised by no country, not evenRussia, even though Moscow supports it financially and militarily. Pulling west is the government in Chisinau, which is worried about what Russia might do next, not least to maintain a supply line for its troops in Trans-Dniester. Currently, this runs through Ukraine, but Moscow might now classify it as hostile territory that would have to be secured.",
        "\"First they would have to move their troops into Ukraine, which we hope will not happen,\" says Moldovan prime minister Iurie Leanca. \"But this crisis teaches us something very important about secessionist problems. They need to be addressed and not allowed to become contagious flashpoints. Hopefully, we can now addressCrimeaand Trans-Dniester through international mechanisms and see light at the end of the tunnel.\"",
        "Hedging his bets, though, Leanca is also trying to consolidate Moldova's status as a Nato ally, pushing for an EU association agreement as soon as possible and setting a personal, albeit optimistic, target of joining in 2019.",
        "The two capitals – Chisinau in Moldova and Tiraspol in Trans-Dniester – couldn't be more different, the former thrumming with traffic and FM radio debate, the latter redolent of a bygone Soviet vision of monolithic order and stability.",
        "Barely the size of a small provincial town, Tiraspol has a spotless main boulevard, named after thee date 25 October from the Russian revolution. On one side is a giant block of Soviet architecture that houses Trans-Dniester's parliament, still called the Supreme Soviet. In its forecourt stands a statue of Lenin and on the other side by the Dniester river flicker flames of a war memorial where each name of the dead is listed on a black wall – more than 800 from the 1992 war.",
        "This week, the breakaway authorities repeated their call this week for formal membership of the Russian Federation, and on the streets people were not coy about explaining why. \"It would be good,\" said one woman cleaning the memorial. \"Our lives would be more prosperous and stable.\"",
        "When explaining their support for Vladimir Putin, the handful of people willing to talk all used the Russian word – stabilnost – for stability. They felt their lives were less unpredictable than those in the EU and that they were materially better off.",
        "\"Our pensions are more than twice as those in Moldova,\" said a mother in a coffee shop. \"And our gas is a quarter of the price.\"",
        "Nadejda Kostiurina, curator of a Tiraspol museum, had no time for European high-mindedness, despite her son living in Germany. \"You tell me,\" she challenged. \"What can the EU do for me – except start a war against us?\"",
        "In Chisinau, however, attitudes are very different. On steep slopes running down to a lake is the Poiana vineyard where winemaker Sergio Galvsca has felt the brunt of the Russian backlash. In 2006, after a political row, Russia banned imports of Moldovan wine.",
        "\"We relied on it and we hit rock bottom,\" he said. \"But it also changed our mentality for the better. We were exporting a lot of poor quality wine to Russia. Now we are concentrating on very good wine, which we hope to sell to Europe, China and rising wine markets.\"",
        "With an empty glass, he knelt down by a steel drum marked cabernet sauvignon 2013. \"The EU gives us hope,\" he continued. \"When we join, we will buy more land and grow more vines.\"",
        "He opened the tap and poured the cabernet. \"The 2013 harvest was not so good. There was a lot of rain so the body is not so strong.\" He handed over the glass. \"But try it. Tell me if we can sell to Tesco?\""
      ],
      "url": "https://www.theguardian.com/world/2014/mar/20/will-ukraine-neighbour-moldova-next-east-west-europe-flashpoint",
      "scraped_at": "2025-11-14T13:13:58.616139",
      "paragraph_count": 15
    },
    {
      "title": "Edginess and a reluctance to rattle Russia's cage in former Soviet republics",
      "content": [
        "Russia's takeover of the Crimean peninsula has drawn condemnation from the west, but reaction has been more varied in the 14 former Soviet republics in Russia's \"near abroad\". Many have played a balancing act betweenRussiaand the west, and almost all have significant Russian-speaking populations – like the one that served as a justification for Moscow's intervention in Crimea.",
        "The oil-rich country in the South Caucasus has carefully played the United States and Russia off against each other, previously hosting a Russian radar base and American troops facilitating the transit of goods to Afghanistan. \"It happened in South Caucasus and it's happening now in Ukraine, it's sort of the Soviet Union coming back,\" said Emin Milli, a journalist and activist in Baku. \"This is what we feel inAzerbaijan, whether you're in government or civil society.\"",
        "Reaction has perhaps been strongest inGeorgia, which lost about 20% of its territory when Russia cemented its control of two breakaway republics in the 2008 war. \"What you hear a lot is that Russia is repeating in Ukraine what they did to Georgia in 2008,\" said Koba Turmanidze, president of the CRRC Georgia research centre. \"The government is trying to be diplomatic … because they came to power promising to improve relations with Russia and negotiate a deal over the territories they took from us.\"",
        "A rising oil-and-gas power and the most influential country in central Asia, sparsely populatedKazakhstanis one of only two full members of Putin's customs union and hosts Russia's Baikonur Cosmodrome. Nargis Kassenova, director of the Central Asian Studies Center at KIMEP University, said: \"There is a considerable chunk of the population whose opinions are formed by Russian media, and there are increasingly vocal patriotic and liberal community that are getting more and more upset with Russian politics and policies.\"",
        "In 2013,Armeniadeclined an EU association agreement similar to the one offered to Ukraine and began moving towards membership of Russia's customs union. \"Anti-Russian people have criticised [Moscow's takeover]; pro-Russian people have mostly kept silent,\" said musician Artyom Babayan. \"Neutral people have mostly just drawn their own conclusions about what lessons Armenia should learn.\"",
        "A revolution in impoverished, mountainousKyrgyzstanin 2010 brought in a regime which voted decisively to close the US airbase at Manas, the main transport hub for the war in Afghanistan, in 2014. \"We can imagine very vividly how the Russian airbase in Kant [in Kyrgyzstan] could be used to land paratroopers to 'restore constitutional order' at the behest of an ousted kleptocrat,\" said Edil Baisalov, a Bishkek-based political analyst. \"But most Kyrgyz, including most of the political class, view the world through the prism of the dichotomy of good Russia versus evil America.\"",
        "The US leased an airbase there until strong-arm president Islam Karimov, who has ruled the country since 1989, ended the arrangement in 2005 in an apparent move to improve relations with Russia and China. \"Officials in Tashkent are seriously worried about the domino-effect consequences from an unbound Russia: in the minds of security-freak Uzbek officials, the fall of Ukraine will inevitably lead to the fall ofUzbekistan,\" said Alisher Khamidov, a researcher on central Asian affairs. \"After Ukraine, Uzbekistan will move to beef up its military and build even closer military partnerships with China and the west.\"",
        "Located on the border with Afghanistan,Tajikistanis the former republic most dependent on remittances, with half its GDP coming from Tajik citizens working in Russia. \"All the countries in the former Soviet Union are on their guard; they understand that the strategy used in Ukraine, Ossetia, and Abkhazia could be used against them,\" said Parviz Mullodzhanov, a political analyst in Dushanbe. But the majority of the population doesn't criticise the intervention in Crimea, he added.",
        "Estonia joined the EU and Nato in 2004 and has had frequent political clashes with Russia, including over the removal of a Soviet-era war monument in Tallinn. \"People fear that Russia could use these methods againstEstoniaalthough we are members of Nato,\" said Silver Meikar, of the Institute of Digital Rights. \"People living near the Russian border watch the Russian news, and then when they talk to another Estonian they have a very different understanding of what's going on in Ukraine … and it's because of the propaganda war.\"",
        "Often called the last dictatorship in Europe,Belarushas not seen many of the market reforms and investment that many other former Soviet republics have, and its strongman leader Alexander Lukashenko is a persona non grata in Europe and a firm ally of Putin. \"Speaking selfishly, a Russian Crimea is more preferable and comfortable as a vacation destination for Belarusians, but they see Hitler in Putin's methods,\" said photographer Andrei Dubinin. \"If it wanted to, the Kremlin wouldn't have much trouble joining the whole country to Russia with economic and political methods.\"",
        "Lithuania joined the EU and Nato in 2004 but retains a sizable population of ethnic Russians. \"Most people know there is a small chance for something similar to happen here, but the Russian minority is too small here,\" said Jonas Bidva, a logistics manager in Vilnius. \"Latvia and Estonia would be more on the radar. But the majority of the people do not believe that Nato or EU would do anything to defend us if it happened in the Baltics.\"",
        "Russia has propped up Moldova's breakaway republic of Transnistria, but the country has had mixed relations with Moscow. About 1 million Moldovans work in Russia and half as many work in the EU. \"Part of the population is more inclined toward EU, and it considers this to be Russian imperial expansion,\" said Tatyana Nita, international secretary for Moldova's Social Democratic party. \"But others consider Russia to be a superpower that supportsMoldovaand other former Soviet republics, and that Europe wants to get revenge on Russia through economic ties with other former Soviet republics, like Belarus, Georgia, and Ukraine.\""
      ],
      "url": "https://www.theguardian.com/world/2014/mar/08/russia-former-soviet-republics",
      "scraped_at": "2025-11-14T13:13:58.723843",
      "paragraph_count": 12
    },
    {
      "title": "Russian troops may be massing to invade Ukraine, says White House",
      "content": [
        "Blinken: troop buildup on eastern border 'deeply concerning'Nato chief: force is 'very, very sizeable and very, very ready'",
        "Russian forces gathering onthe border with eastern Ukrainemay be poised to invade, the White House warned on Sunday, as the government in Kiev said that the prospect of war with Moscow was continuing to grow after the annexation of Crimea.",
        "Speaking afterNato's top commander in Europevoiced alarm about the size and preparedness of the Russian troop buildup, President Barack Obama's deputy national security adviser, Tony Blinken, said President Vladimir Putin may indeed be readying further action.",
        "“It's deeply concerning to see the Russian troop buildup on the border,” Blinken told CNN. “It creates the potential for incidents, for instability. It's likely that what they're trying to do is intimidate the Ukrainians. It's possible that they're preparing to move in.”",
        "Thousands of Russian troops held a military exercise near the border even before Putin last week formally annexed Ukraine's southern Crimea region followinga referendum–condemned as illegalby western governments – that endorsed unification with Russia.",
        "General Philip Breedlove, Nato's supreme allied commander in Europe, said earlier on Sunday that the Russian military force gathered near the Ukrainian border was “very, very sizeable and very, very ready” and could even pose a threat toMoldova, on the other side of the country.",
        "Andriy Deshchytsia, Ukraine's acting foreign minister, said the chances of all-out war between his government and Moscow “are growing”, adding: “The situation is becoming even more explosive than it was a week ago.”",
        "Deshchytsia told ABC News: “We are ready to respond. The Ukraine government is trying to use all the peaceful diplomatic means … to stop Russians, but the people are also ready to defend their homeland.",
        "“At this moment, when Russian troops would be invading the eastern region,” Deshchytsia went on, “it would be difficult for us to ask people who live there not to respond on this military invasion”.",
        "Russian forces in the Crimean city of Belbek on Saturdayaggressively seized a military basethat was one of the last strongholds of the Ukrainian military in the region. Moscow, meanwhile, allowedcivilian observersfrom the Organisation for Security and Cooperation in Europe (OSCE) to begin monitoring elsewhere in Ukraine.",
        "The Russian deputy defence minister, Anatoly Antonov, told state media on Sunday: \"The Russian defence ministry is in compliance with all international agreements limiting the number of troops in the border areas with Ukraine.\"",
        "Speaking from the Georgian capital, Tbilisi, Mike Rogers, the chair of the House of Representatives intelligence committee, said US intelligence officials were convinced “that Putin is not done in Ukraine”.",
        "“It is very troubling,” Rogers told NBC's Meet the Press. “He has put all the military units he would need to move into Ukraine on its eastern border and is doing exercises. We see him moving forces in the south in a position where he could take the southern region over to Moldova.”",
        "Nato officials are concerned that Putin could have designs on Transnistria, a restive Russian-speaking region inwestern Moldovaalso known as Trans-Dniester, where separatist leaders have demandedto be allowed to join Russiafollowing the annexation of Crimea.",
        "Breedlove, the Nato commander, said during remarks at an event held by the Marshall Fund thinktank that in the Kremlin's view, the region was the “next place where Russian-speaking people may need to be incorporated”.",
        "“There is absolutely sufficient force postured on the eastern border of Ukraine to run to Trans-Dniester if the decision was made to do that,” said Breedlove, “and that is very worrisome.”",
        "Moldova's President Nicolae Timofti warned Putin last week against considering the annexation of Transnistria.",
        "Pressed on whether Obama was managing to punish Putin, Blinken claimed that the Russian president had already seen “a real cost” economically, and that the US president would continue working to “bring the world together in support of Ukraine, to isolate Russia” on a visit to Europe next week.",
        "“We see investors looking at Russia and sitting on the fence, because they are looking for three things – they are looking for stability, looking to see if the country makes good on its international agreements, and to see if the country is integrated with the world economy,” said Blinken.",
        "“On all three of those areas Putin holds tremendous doubts, and we have extended those doubts.”",
        "However, Rogers, a Michigan Republican, said “I don't think the rhetoric matches the reality on the ground” and called for increased US action in support of Ukraine to allow those potentially in Putin's sights to “protect and defend themselves”.",
        "“We're talking about small arms so they can protect themselves. Maybe medical supplies, radio equipment … defensive-posture weapon systems,” said Rogers.",
        "Asked if the White House would consider direct military aid, Blinken said: “All of that is under review.”",
        "Meanwhile, the former Republican presidential candidate Mitt Romney said that President Barack Obama could have done more to persuade Russia not to annex Crimea.",
        "During the 2012 presidential race, Romney took criticism from Obama for saying Russia was America's \"number one geopolitical foe\" not al-Qaida. Now Romney has told CBS's Face the Nation that Obama's \"naivete\" and \"faulty judgment\" about Russia has led to a number of foreign policy challenges. Romney said the US should have worked sooner with allies to make clear the penalties that Russia could have faced if it moved into Ukraine."
      ],
      "url": "https://www.theguardian.com/world/2014/mar/23/russian-troops-may-invade-ukraine-white-house",
      "scraped_at": "2025-11-14T13:13:58.841147",
      "paragraph_count": 25
    },
    {
      "title": "Ukraine: what will happen now?",
      "content": [
        "In his 14 years in power grieving the loss of the Soviet empire, Vladimir Putin has launched three wars against Russia's neighbours and territories formerly under the Kremlin's domination. As a newly appointed prime minister in 1999, before becoming president on New Year's Day 2000, he began with a war inChechnya, brutally suppressing an armed insurrection against Moscow's rule in the north Caucasus and razing the provincial capital, Grozny.",
        "In 2008, the former KGB officer ordered a blitzkrieg against Georgia,partitioning the country in five days. He remains in control of 20% of Russia's Black Sea neighbour: the territories of South Ossetia and Abkhazia. The Russian military also controls a slice of Moldova known as Transnistria in a frozen conflict dating from the collapse of the Soviet Union.",
        "In the Crimea andUkraine, however, in the event of full-scale war, Putin has opted for a game-changer with the potential to be Europe's worst security nightmare since the revolutions of 1989 and the bloodiest since Slobodan Milosevic's attempts to wrest control of former Yugoslavia resulted in four lost wars, more than 100,000 dead, and spawned seven new countries in the Balkans. Ukraine is a pivotal country on the EU's eastern and Russia's south-western borders. Territorially it is bigger than France. Its population is greater than those of Poland or Spain at 46 million. It has a proper military and is well armed. Ukraine was the Soviet Union's arms manufacturing base; it remains in the top league of global arms exporters.",
        "Ukraine's military machine is no match for Russia's. It has around 130,000 troops compared to around 850,000 in Russia. Its forces inCrimeaare no match for the 15,000-plus men serving with the Russian Black Sea fleet in Sevastopol. Russia has more men in its western military division than there are in the entire Ukrainian armed forces. Ratios of fighter aircraft, attack helicopters, special forces units and Black Sea warships are similarly one-sided.",
        "But Ukraine's forces could inflict a lot of damage if forced to defend their country. With this in mind, three broad scenarios suggest themselves:",
        "The most benign outcome is that Putin envisages a Georgia-style incursion, a brief week of creating new facts on the ground, limiting the campaign to taking control of the Crimean peninsula with its majority ethnic Russian population, and then negotiating and dictating terms from a position of strength to the weak and inexperienced new leadership in Kiev.",
        "Putin made no public comments after the revolution in Kiev that saw the flight ofPresident Viktor Yanukovychto Russia until his Crimea operation, well-planned and activated without a shot being fired, was in effect over. The military operation was accompanied by political moves – the regional parliament and political leadership calling for Russian help, declaring loyalty to Moscow, disowning the new administration in Kiev and ordering a referendum on Crimea's status by the end of the month.",
        "If that is the aim, it is virtually mission accomplished. The goals were achieved even beforeNatoambassadors could gather in Brussels on Sunday or EU foreign ministers could assemble to ponder their options on Monday. But there are plenty of signs that controlling or even annexing Crimea may not sate the Russian appetite in Ukraine. A more ambitious and much more dangerous scenario is also entirely conceivable.",
        "If the Crimean seizure has been easy and bloodless, it is because of the heavy Russian military assets there, the support of much of the local population and because the Ukrainian forces were caught off-guard by the speed of the takeover, and because they are under orders not to fight back (yet), for fear of provoking a significant and bloody escalation.",
        "All the signs are that Putin, with his proprietorial approach to large stretches of the former Soviet Union, will refuse to accept the legitimacy of a Ukrainian state that has turned west to secure its future, cutting the umbilical cord that the Kremlin thinks makes it Russia's baby. The aim, as Ukraine's acting president speculated on Sunday, may be to wreck Ukraine economically – to disable it as a genuinely independent state.",
        "That aim would encourage Putin to expand his influence from Crimea into eastern Ukraine, dismissing Kiev's authority, and broadly cutting the country in two – Kiev and the west versus the east and the south.",
        "That raises the prospect of civil war. Already, in the initial skirmishing, the tactics and the methodology that made Serbia's Slobodan Milosevic so ascendant in the Yugoslav wars of 1991-95 and Kosovo in 1998-99 (although he lost them all in the end) are evident. There is the establishing and no doubt arming of local loyal militias, new pro-Russian leaders handpicked by the Russian security services, quick referendums to lend a \"democratic\" veneer to pre-ordained decisions taken in Moscow, the funding of loyalist forces, the staging of \"provocations\" then amplified by outrage and the clamour for retaliation in the Kremlin-controlled media, the creation of parallel state structures, say, in Kharkov in the east – Ukraine's second city and its capital during the Russian civil war because it was \"red\" and Kiev was \"white\". There are also the ethnic, confessional and cultural divisions that sunder Ukraine, between the Catholic and nationalist west and the Orthodox and often pro-Russian east, also recalling Yugoslavia.",
        "These, however, are far from insuperable problems. There is nothing inevitable about an east-west clash, given benign and careful political leadership.",
        "But if the state is resolved to magnify these underlying tensions into a casus belli, it is easily, as Milosevic proved, accomplished.",
        "If Putin opts to be the new Milosevic, the west will be staring a new division ofEuropein the face.",
        "The diplomatic scenario",
        "There appears little appetite in the west for getting seriously embroiled beyond diplomacy. The responses have been slow. The Ukrainian turmoil started in November with the Kiev protesters opposing a pro-Russian president to demand a European alignment.",
        "But the EU is split, lumbering and reactive. There is no European foreign or security policy. It is difficult to imagine Germany spilling blood for Ukraine. It is not difficult to envisage Russia spilling blood for Ukraine. The default EU position in these crises, fromRobert Mugabe in ZimbabwetoAlexander Lukashenkonext door to Ukraine in Belarus, is to impose sanctions and travel bans on leadership cliques. However, there is too much at stake in Ukraine for that to have much impact.",
        "But John Kerry, the US secretary of state, has upped the ante, warning of a sanctions package that would isolate Russia economically. That is an intriguing suggestion because the Russian economy is entirely dependent on raw materials, on oil and gas exports.",
        "Isolating Russia economically would entail quarantining, for example, the gas sector and the world's largest gas producer,Gazprom. But Gazprom is Europe's biggest gas supplier. The US would be barely affected by such sanctions. Europe and Germany would be hammered. All of the Baltic, and central and eastern Europe, including Ukraine itself, is utterly dependent on Gazprom, while Germany, Europe's biggest energy consumer, gets more than a third of its gas from Russia.",
        "More likely is Yugoslav-style western mediation, with \"contact groups\" of diplomats or UN envoys charged with running negotiations between the warring parties, monitoring ceasefires and dispatching observers under the UN or the Organisation for Security and Co-operation in Europe.",
        "Ukraine will start to sound like Switzerland. There will be lots of talk of new arrangements entailing \"federalisation\" or \"confederalisation\", with the Russian aim being to maximise its control over much of Ukraine while arguing it recognises its territorial integrity."
      ],
      "url": "https://www.theguardian.com/world/2014/mar/02/ukraine-what-will-happen-crimea-europe-west",
      "scraped_at": "2025-11-14T13:13:58.950632",
      "paragraph_count": 22
    },
    {
      "title": "Ukraine’s painful realities",
      "content": [
        "There is one thing that neither fans of Russia nor patriots of Ukraine in Odessa or Nikolayev can dispute: all totally agree that Russia attacked Ukraine, writes Ram?nas Bogdanas.",
        "There is one thing that neither fans of Russia nor patriots of Ukraine in Odessa or Nikolayev can dispute: all totally agree that Russia attacked Ukraine, writes Ram?nas Bogdanas.",
        "Ram?nas Bogdanas is a commentator atEN.DELFI.LT.",
        "Odessa and Nikolayev, where I gave lectures, are part of the so-called zone of Novorossia (New Russia) which Russia dreams of uniting with the stolen Crimea and the zombified Transnistria further east, ripped away from Moldova. And it is a loop that would cut Ukraine off from the sea.",
        "Everybody knows that a large force of the aggressor is already concentrated in the area just off the Crimean peninsula. People debate if the Russians are going to attack their cities. And they just can’t come to terms with the fact that it’s actually Russians who are now behaving like this with the Ukrainians, because they believe a truth repeated for countless years – that they are two brotherly nations. It’s a conviction which is now drawing blood.",
        "I heard explanations in an attempt to make allowance for objection. There’s fighting because “the powers that be” haven’t shared something or other. An explanation like this comes from the eternal gap between government and the people. The war is perceived as a fight between two governments, and not as defence of the country against occupation.",
        "For the people, their country’s independence is not theirs when the government has become just another set of VIPs who hand out golden baguettes, and where oligarchs rule by succession like grand dukes. Privilege and coruption are a colossal foe to statehood in the democratic world.",
        "Since 1990, Ukraine has simply drifted, and its businessmen and politicians have for the most part tarnished it. Lithuania is no saint, but its wheels are turning albeit with squeaks. We have attained EU and NATO membership, entered the Schengen area and achieved goals that Ukraine can only dream about.",
        "When President Petro Poroshenko bombastically states that no other country in Europe has paid such a price to be a part of Europe as Ukraine has, all he is doing is proclaiming his own exaggerated Ukrainian pride. The silent and unpleasant reality is that it took a belated 20 years to pay this price.",
        "Heroism without routine work is a mere flash in the dark. For there to be constant light, there must be constant energy. The jubilation of the first Maidan has remained an unrealised opportunity, because the elected government measures not by country size but by the size of its own pockets.",
        "Not far from Nikolayev is the town of Vitovka, reminiscent of the times of the Grand Duchy of Lithuania and of Vytautas the Great. It will not be forgotten that it was here, after theBattle of Grunwald, that the Lithuanians celebrated for three days and missed their chance to consolidate their victory by occupying an important Crusader castle. And when they realised this, it was too late, because the enemy garrison managed to ambush them.",
        "It would be good to hope that Lithuania has rid itself of this trait – one which pre-war independence taught us, and that the road back to Europe has been covered. The Ukrainians still need to show that they are moving toward Europe, not only with demonstrations, but with work.",
        "A driver for the Odessa morgue said that recently the bodies of dead soldiers had been brought back from Donbass. For him, it is especially painful that it was Russian bullets that killed them. He does however know that in Crimea, Russian pensions will be three times higher. What he doesn’t think of is that things there are also more expensive. His salary is 1,500 hryvnia (€92). It’s difficult to conceive of a country that measures everything by work. The defining factor is not who speaks Russian or Ukrainian, but rather how each person perceives public spirit.",
        "You could tell students in Odessa that in 1990 Lithuania’s GDP per person was lower than that of the Ukraine and that today, it’s three times higher. It’s clear that the path we’ve chosen seems more constructive. But you can’t by any measure smooth over the daily wage on which it’s impossible to survive. Few have any regard for a place where there’s no underlying structure, something with which it becomes a fortress in which most people feel secure. Without it you could rob shamelessly or leave in disgust.",
        "All people spoken to acknowledged that the Ukrainian army is poorly armed. Everything has been stolen. Yet aren’t they and their friends glad that they can buy military goods for next to nothing at the markets? And that they can trade in anything, be it selling weapons to other countries, or shoes at the market.",
        "Now people opt for money to buy weapons, helmets and armour. A village has collected money for a helmet for a volunteer going off to join a battalion. And after finding out, a local politician who has nothing to do with the place flew in with the cameras and ceremoniously presented the helmet. Nikolayev University lecturers have decided that their contribution will be a “professor armour “who at his own expense will buy up what’s in storage, and prepare for battle.",
        "For Ukrainians who previously enjoyed a porous border across which you can take whatever you want, you nevertheless still had to pay off the border guards. The ones who bribed so that they could smuggle were the ones who taught the border services to eventually let the first tanks through, for money from Russia, to the separatists.",
        "Recently there’s been a feeling of déjà vu in Ukraine. It’s already evident. Students question whether Ukraine can survive intact, or not without full links with a very powerful Russia. Before answering, remember Algirdas Brazauskas’s lament that without the Soviet Union, the Lithuanian maiden will surely perish [Brazauskas is the first President of post-Soviet Lithuania].",
        "Ukrainians still have to answer the questions, the answers to which we are pointing. As a visitor, there is a clear perception that Lithuania is already on the long road that awaits the Ukrainians. It’s important that we take stock and not be in awe of what we’ve achieved, because on the reverse side there are sores that must be treated and cut out with a scalpel, so that in the future we’ll be able to show good practice as an example to Ukraine. We are, after all, waiting for them with baited breath in Europe. Aren’t we?"
      ],
      "url": "https://www.euractiv.com/opinion/ukraine-s-painful-realities/",
      "scraped_at": "2025-11-14T13:13:59.352431",
      "paragraph_count": 19
    },
    {
      "title": "Eastern Ukraine drifts away from Kyiv in controversial referendum",
      "content": [
        "Pro-Moscow rebels declared a resounding victory in a referendum on self-rule for eastern Ukraine held Sunday (11 May), with some saying that meant independence and others eventual union with Russia, as fighting flared in a conflict increasingly out of control.",
        "Pro-Moscow rebels declared a resounding victory in a referendum on self-rule for eastern Ukraine held Sunday (11 May), with some saying that meant independence and others eventual union with Russia, as fighting flared in a conflict increasingly out of control.",
        "Organizers in the main region holding the makeshift vote said nearly 90% had voted in favor.",
        "Well before polls closed, one separatist leader said the region would form its own state bodies and military after the referendum, formalizing a split that began with the armed takeover of state buildings in a dozen eastern towns last month.",
        "Another said the vote simply showed that the East wanted to decide its own fate, whether in Ukraine, on its own, or as part of Russia.",
        "“Eighty-nine percent, that’s it,” the head of the separatist electoral commission in Donetsk, Roman Lyagin, said by telephone when asked for the result of a vote that the pro-Western Ukrainian government in Kiev has condemned as illegal.",
        "A festive atmosphere at makeshift polling stations in some areas belied the potentially grave implications of the event. In others, clashes broke out between separatists and troops over ballot papers and control of a television tower.",
        "Zhenya Denyesh, a 20-year-old student voting early at a university building in the rebel stronghold of Slaviansk, said: “We all want to live in our own country”. But asked what he thought would follow, he replied: “It will still be war.”",
        "In the southeastern port of Mariupol, scene of fierce fighting last week, there were only eight polling centers for a population of half a million. Queues grew to hundreds of meters in bright sunshine, with spirits high as one center overflowed and ballot boxes were brought onto the street.",
        "On the eastern outskirts, a little over an hour after polls opened, soldiers from Kiev seized what they said were falsified ballot papers, marked with Yes votes, and detained two men.",
        "They refused to hand the men over to policemen who came to take them away, saying they did not trust them. Instead they waited for state security officers to interview and arrest them.",
        "On the edge of Slaviansk, fighting broke out around a television tower shortly before people began making their way through barricades of felled trees, tires and machinery for a vote the West says is being orchestrated by Moscow. The Ukrainian Defense Ministry said one serviceman was wounded.",
        "A man was later reported killed in a clash in the eastern town of Krasnoarmeisk, Interfax-Ukraine news agency said, adding to a toll so far in the dozens but creeping higher by the day.",
        "Western leaders, faced with Russian assertiveness not seen since the Cold War, have threatened more sanctions in the key areas of energy, financial services and engineering if Moscow disrupts a presidential election planned in Ukraine on 25 May.",
        "The European Union also declared the vote illegal on Sunday and may announce some modest measures as soon as Monday, limited by the bloc’s reluctance to upset trade ties with Russia.",
        "Moscow denies any role in the fighting or any ambitions to absorb the mainly Russian-speaking east, an industrial hub, into the Russian Federation following its annexation of the Black Sea peninsula of Crimea after a referendum in March.",
        "But, in a sign it may have set its sights beyond Crimea, Russian Deputy Prime Minister Dmitry Rogozin said he had brought a petition by residents of Moldova’s Russian-speaking breakaway region of Transnistria backing union with Russia.",
        "Ukraine’s Interior Ministry called the eastern referendum a criminal farce, its ballot papers “soaked in blood”. One official said two thirds of the territory had not participated.",
        "Ballot papers in the referendum in the regions of Donetsk, which has declared itself a “People’s Republic”, and the much smaller Luhansk, were printed without security provision, voter registration was patchy and there was confusion over what the vote was for. Separatists in Luhansk said only 5% had voted against.",
        "A man who identified himself as a 33-year-old engineer with the first name of Sergei, voting in the industrial center of Mariupol, said he would answer “Yes” to the question printed in Russian and Ukrainian on the ballot: “Do you support the act of state self-rule of the Donetsk People’s Republic?”",
        "“We’re all for the independence of the Donetsk republic,” he said. “It means leaving behind that fascist, pro-American government [in Kyiv], which brought no one any good.”",
        "Autonomy, independence, annexation",
        "But in the same queue of voters, 54-year-old Irina saw a “Yes” vote as endorsement of autonomy within Ukraine.",
        "“I want Donetsk to have its own powers, some kind of autonomy, separate from Kiev. I’m not against a united Ukraine, but not under those people we did not choose, who seized power and are going to ruin the country,” she said.",
        "Others see the vote as a nod to absorption by Russia.",
        "Annexation is favored by the more prominent rebels, but the ambiguity may reflect their fears of an explicit call for full “independence” might not have garnered the support they seek and could leave them in an exposed position towards Kiev.",
        "The present government came to power when President Viktor Yanukovich was toppled in February after mass protests in Kiev.",
        "Pro-Western activists were angered by his decision to discard a cooperation accord with the European Union in favor of closer ties with Moscow. They also accused him of corruption penetrating all areas of the Ukrainian state.",
        "After voting ended in the hastily arranged referendum in 53 locations, the rebels hoped to have the ballots counted by Monday afternoon, although its outcome will not be widely recognized internationally or by Kyiv.",
        "With several hours of polling to go, Russian news agencies were already reporting a turnout of more than 75%, although a separatist spokesman in Luhansk said troops had prevented the movement of ballot papers in several areas.",
        "One way or another it is likely to show a large “yes” vote, and one leading separatist said Ukrainian troops would be declared illegal occupiers once results were announced.",
        "“It is necessary to form state bodies and military authorities as soon as possible,” Denis Pushilin, a leader of the self-styled Donetsk republic said, according to Interfax news agency.",
        "Lyagin, head of the rebel central electoral commission in Donetsk, also took a strong position on the results.",
        "“That can be considered the final and official result,” he said, reporting exact figures of 89.07% for and 10.19% against. “We demand the right to self-determination, and we will get it.”",
        "He said that the result meant Ukraine’s 25 May presidential election would not take place in the Donetsk region.",
        "Speaking to reporters earlier, he had appeared to have a less radical position.",
        "“With the announcement of the results the status of the Donetsk region does not change in absolute terms. We do not cease to be a part of Ukraine, we do not become a part of Russia,” he said, although he left those options open.",
        "Moscow has massed troops on the border and Kyiv fears they may be called in as peacekeepers. Serhiy Pashinsky, head of the Ukrainian presidential administration, said a column of armored vehicles on the Russian side of the border bore the colors of UN peacekeeping forces. He offered no evidence or detail.",
        "“We warn the Kremlin that the appearance of these forces on the territory of Ukraine would be assessed as military aggression and we would react as we would in the case of military aggression,” he told reporters.",
        "Ukrainian leader Oleksander Turchinov has urged eastern political leaders to join a “Round Table” discussion on devolution of powers in Ukraine. But he says he would not negotiate with “terrorists”, a formulation meant to exclude most of the more prominent rebel leaders.",
        "Pashinsky said Ukrainian forces had “destroyed” a separatist base and checkpoints in a broad operation around Slaviansk and nearby Kramatorsk in retaliation for attacks on their posts.",
        "“This is not a referendum. This is a desultory attempt by killers and terrorists to cover their activity,” he said."
      ],
      "url": "https://www.euractiv.com/news/eastern-ukraine-drifts-away-from-kyiv-in-controversial-referendum/",
      "scraped_at": "2025-11-14T13:13:59.956017",
      "paragraph_count": 42
    },
    {
      "title": "Ukraine official: Putin’s plans have failed",
      "content": [
        "Russian President Vladimir Putin has failed to take over Ukraine in his attempt to resuscitate the former Soviet Union. But he hasn't given up, and nobody knows where his tanks will stop, Andriy Parubiy, Secretary of the National Security and Defense Council of Ukraine told EURACTIV in an exclusive interview.",
        "Russian President Vladimir Putin has failed to take over Ukraine in his attempt to resuscitate the former Soviet Union. But he hasn’t given up, and nobody knows where his tanks will stop, Andriy Parubiy, Secretary of the National Security and Defense Council of Ukraine told EURACTIV in an exclusive interview.",
        "Andriy Parubiy is a former commandant of Euromaidan. He spoke to EURACTIV’s Senior Editor Georgi Gotev.",
        "We are speaking in Brussels on 20 May, just days ahead of the Presidential elections in Ukraine next Sunday. What brings you here? Who have you met with, and what are your messages?",
        "I came to participate in a session of the Ukraine-NATO working group. The problems Ukraine is facing today reveal that a lot of tactical questions need a solution, while in a strategic sense the entire security and defence sector in Ukraine needs an overhaul. This concerns not only the Ministry of Defence, but also the National Guard and the Ministry of Interior.",
        "Ukraine has been faced with a new way of waging war. This is the so-called hybrid war, which was developed by experts in the USA, but was adapted by the Russian Federation. According to the mechanism of hybrid warfare, the army only plays the role of intimidation and containment. The main role is played by diversion groups, by criminal groups, by the support they may get from ethnic groups in one region or another.",
        "One important aspect of hybrid warfare is the information war. The classic military methods against this type of warfare cannot always be effective. The way that the army and the police behave often leaves them helpless when confronted with such tactics. In Ukraine, 20 armed people seize a building, and in front of it stands a group of some 50 people. From this moment on, all the classic ways of conducting a police or an anti-terrorist operation fail.  You need to evacuate the people. But in this case you cannot, because armed people can shoot at them. When I was in Luhansk, I saw it myself.",
        "That’s why my main task with the NATO meeting has been (explaining why) their experts should come to Ukraine and prepare the much-needed reform of our security and defence sector.",
        "But Russian propaganda says that the Americans are already in place in Ukraine’s security and defense forces, and that your intelligence and special services are run by the CIA…",
        "…and by Polish snipers. [Polish foreign minister Radoslaw] Sikorski told me that Russians have almost convinced him that the Right Sector in Ukraine is trained by Polish snipers…",
        "You were the commandant of Euromaidan, so you must have first-hand information?",
        "[The allegation about Polish snipers is] absolutely absurd. We are facing Goebbels-type propaganda [Joseph Goebbels was the Minister of Propaganda in Nazi Germany] which is unbelievable, but people listen to Putin and some consider that such a point of view is also legitimate. This is complete nonsense.",
        "Talking about Maidan, there was nobody there except Ukrainians on our side. Now that we are conducting investigations, we have found that 18 Spetsnaz [Russian special commando forces], including snipers, were in Maidan. The investigation will reveal from which points they were shooting, but I can already say that they did everything they could to spill blood and provoke civil unrest. What happened on Maidan and what happens now [in Eastern Ukraine] is part of the same plan conducted by Russian special forces, aimed at taking control of Ukraine.",
        "What I can further say is that had we been unable to oust [the then President Viktor] Yanukovich, he would have called the Russian army and a completely different scenario would have unfolded. We know that Russian snipers shot at both sides.  It is not by chance that Russian troops have stood at the borders of Ukraine since the days of Maidan.",
        "So you recognise that you ousted Yanukovich?",
        "But he ran away because he was afraid for his life?",
        "Yes of course. After so many deaths and such national tension, he understood that if he didn’t run away, the personal consequences could be very bad.",
        "But let’s return to the issue of US assistance. Five billion US dollars have reportedly been spent by Washington to bring about this transition, to prepare Maidan, to finance it?",
        "This is complete absurdity. Forget about the USA. The Ukrainian political parties weren’t even ready for Maidan. I was at Maidan from the start. With a megaphone, I started a rally on Maidan. At that time, political parties had no idea about what was about to begin. If someone believes that such streams of energy as Maidan can be planned or prepared, he is completely wrong. There was no preparation for Maidan, none whatsoever, neither material, nor ideological. Maidan started as a force of nature. First came the journalists. Then came the students. Maidan started as a force from below, as a force of the people.",
        "But what was Maidan? A pro-European revolution or a putsch by fascist forces, as Russian propaganda says?",
        "To have a putsch by fascists, you need fascists first. Nobody saw any fascists on Maidan. That’s one more Russian propaganda cliché, aimed at discrediting Maidan. What kind of fascists?",
        "They say the Right Sector are fascist.",
        "There were so many journalists. I have guided Western journalists to where the Right Sector were located. Right Sector is a wing which is radical indeed, but they always strongly stood against fascism, against Nazism. But you see, the fact that you ask me this question is a result of Russian propaganda. What they say is absurd, and by commenting on it, we serve their purpose. People on Maidan were students, journalists, middle class people. How could they be called fascist?",
        "But you are also accused of having sympathies for Stepan Bandera, a controversial figure during World War II.",
        "But what has Bandera to do with fascism or Nazism? The Bandera brothers were killed by Nazis. [Stepan] Bandera was in a Nazi concentration camp, as many patriotic leaders were. The line “you advocate for Bandera, therefore you advocate fascism” is Russian propaganda. It has nothing to do with reality. Indeed, in the 1940s there was a nationalist movement. These people fought for Ukrainian statehood. Actually they fought equally against the Nazi system and the Soviet system. As a Ukrainian patriot, I believe they did a lot for our country, and that their memory should be preserved. By the way, the first who took arms against the Nazis were Ukrainian patriots in Trans-Carpatian Ukraine, at a time when Hitler took Austria and Czechoslovakia without anyone opposing him. But this is a historic discussion.",
        "Regarding the snipers at Maidan, you say the investigation is ongoing. How about this tragedy, this carnage in Odessa on 4 May?",
        "This is a classic example of how Russia provokes, aiming at unleashing civil unrest and bloodshed. On that day, there was a football match. The fans had gathered and when they started marching with Ukrainian flags, a group of people started shooting at them with military guns. A few people were killed on the spot. In this group were citizens of Russia, which had come from Transnistria [a Russia-controlled breakaway territory of Moldova].",
        "When the explosion happened in the House of the Trade Unions, experts have shown that the substance that provoked it had been stored there a long time ago. The House of the Trade Unions was a kind of headquarters for the separatists, it was not controlled by the authorities, nor by the opposition. And the substance that provoked the blaze was brought there during this period of time [when the separatists controlled the building]. I’m not saying that this substance was inflamed on purpose. But when Molotov cocktails were thrown from the fourth floor at the participants of the Ukrainian rally, the substance inflamed.",
        "It is true that the Russian propaganda is very strong today. Because it moves like a tactical corps and looks stronger than the free press, which will always show all points of view. We ask those interested to come and take part in the investigation. We invited international experts to participate in an international committee, so they could base their opinion on facts, and not on what Russian TV says.",
        "Odessa was a classic provocation in which pro-Russian groups had to seize the administration buildings in the same way it happened in Donetsk and Luhansk.",
        "The presidential election will take place on Monday. What can we expect – that things will go smoothly, except in the Donetsk and Luhansk regions?",
        "For the remaining regions there is no issue. Normal preparation for elections is ongoing. But not even the Donetsk and Luhansk regions are a problem, but rather some cities and towns in those regions. In many parts, including in the Luhansk region, there are no separatists, no terrorists. The situation is under the control of the local authorities.",
        "But in Slaviansk, an anti-terrorist operation is ongoing. Yes, there will be locations where it would be dangerous for the international observers to go, and we know that this danger will come from Russia. Because Putin’s major aim is scuppering the 25 May election. That’s why we expect aggression and provocation on that day. But this would happen only in isolated places, and by no means in the entirety of Donetsk and Luhansk. Besides, according to the Ukrainian constitution, there is no requirement as to thresholds of voter turnout. So it’s not a legal problem, but a political and psychological one.",
        "If Russia wants an excuse for not recognising the election result, they will find it. But how many thousands of people will be excluded from the election in your view?",
        "It would depend on the evolution of the situation in the coming days. The firm position taken by Ahmetov [Rinat Akhmetov, the oligarch who controls the coal business in Donetsk region and employs 300.000 people] plays a role. [Akhmetov said yesterday Ukrainians – including his own employees – should stage a “peaceful warning protest” against separatists and that action should continue daily “until peace is established”.] More than 80% in Donbass support a united Ukraine, but the infiltrators are instigating fear. That’s why people are silent. But when Akhmetov takes his miners to the street, the situation changes. Miners don’t want Russia, because they know that Moscow will close their mines for being non-profitable.",
        "That’s why we can see very important changes in Donetsk and Luhansk regions. And that’s why it’s difficult for me to answer with concrete numbers.",
        "Why do you call the Russian infiltrators “terrorists”?",
        "We could call then infiltrators, but it’s a mild word, because they are killers.",
        "But Russians call you fascists and it’s a spiral which doesn’t augur for détente?",
        "There is no comparison. If Ukrainians went to Rostov, or to Pskov [in Russia], and seized buildings and killed people, we could make comparisons. We speak of armed forces of Spetsnaz who come to Ukraine, who cynically kill our civils and our military. We cannot be milder.",
        "Coming back to the 18 Spetsnaz troops at Maidan…",
        "What else can you say about what you know about them?",
        "I think they escaped from Ukraine. We have a working hypothesis which would be confirmed or rejected by the investigation, that in the most difficult days they shot equally – at Berkut [the Ukrainian anti-riot forces] and at the Maidan activists. Their aim was to instigate a more violent civic unrest. That was the tactic. The same tactic was applied in Odessa, in Donetsk, aiming at dividing the society and dividing Ukraine.",
        "And the aim is that Russia could warm its hands at this fire. When we speak about fighting terrorists, the best way is to find their centre of coordination, of financing. In this case, this centre is one person, it is Putin.",
        "That’s why I say – we have no crisis in Slavyansk, in Donetsk, in Luhansk. We have a crisis in Putin’s head.",
        "What is he trying to achieve?",
        "He once said that the worst disaster of the 20thcentury was the collapse of the Soviet Union. His maniac idea is to resuscitate this space, he thinks this is his historic mission. And as Brzezinski  [Zbigniew Brzezinski, former National Security advisor to US President Jimmy Carter] said, without Ukraine the Russian empire will not be rebuilt. That’s why after the Georgia events [the brief war between Georgia and Russia in August 2008] he prepared his coup against Ukraine for a very long time.",
        "Our security forces can say today precisely that the groups in Ukraine that interact with Spetsnaz have been prepared by them over the last two years. When Putin prepared his plan for Ukraine, it comprised the whole of the country. But he had to change it when Yanukovich ran away. And his new plan is for the eight regions: Donetsk, Luhansk, Odessa, Kharkiv, Zaporozhie, Kherson, Dnipropetrovsk, Nikolayev. And he was sure that when Russians enter there they will be received with flowers. And the fact that we have limited his influence in such a small part of the country is a major political blow for him.",
        "What did Putin expect?",
        "He thought that those regions would march into Russia waving Russian flags. It must be hard for him to swallow what reality proved. Actually, Putin doesn’t need Donetsk and Luhansk. These are miners’ regions and he knows that he needs to finance those regions if he wants to rule over them. Actually, Putin’s plan for Ukraine has failed. What remains is political objectives: to have a zone of instability in Ukraine, not to allow the further EU integration, to prevent the visa-free regime for Ukrainians to become effective, to not allow Ukraine to join NATO, and to keep a political influence there.",
        "So Putin will continue in this direction. He will try to create another Transnistria, another region of instability, but his major goal and his plan for the eight regions, known as “Russian Spring”, has failed.",
        "What doesn’t the West understand?",
        "The crisis we are talking about is not the Ukrainian crisis. It’s a global crisis. And if Putin succeeds in Ukraine, nobody can tell where his tanks will be tomorrow. His maniac idea I mentioned is also global. To stop Putin is not only Ukraine’s major goal. It should be the goal of the entire civilised world."
      ],
      "url": "https://www.euractiv.com/interview/ukraine-official-putin-s-plans-have-failed/",
      "scraped_at": "2025-11-14T13:14:00.540385",
      "paragraph_count": 53
    },
    {
      "title": "Moldova: EU Commission clarifies intentions about Transnistria",
      "content": [
        "The European Commission has fleshed out its plans for Moldova following acid comments from the Russian ambassador to the EU, Vladimir Chizhov, on Monday (13 January), deriding Europe’s capacity to deal with Moldova's break-away province of Transnistria, which has close ties with Moscow.",
        "The European Commission has fleshed out its plans for Moldova following acid comments from the Russian ambassador to the EU, Vladimir Chizhov, on Monday (13 January), deriding Europe’s capacity to deal with Moldova's break-away province of Transnistria, which has close ties with Moscow.",
        "Asked to comment about Russian officials’threats towards MoldovaconcerningTransnistria,Chizhovquestioned the EU’s ability to come up with a solution for the break-away province– a frozen conflict zone whose independence is notrecognisedby the UN – in the framework of the EU-Moldova free trade deal.",
        "“Nobody questions the territorial integrity of Moldova but practically in that country there are two independently functioning economies. How will that fit in the Deep and Comprehensive Free Trade Agreement (DCFTA)? I discussed this with Moldovan representatives, they acknowledged that the question is legitimate but they say 'we’re sure that the EU will think of something,' I have nothing else to add!”",
        "The question however seems much less worrying to EU officials.",
        "“Of course we thought of everything, regardless of what people who have actually nothing to do with these agreements are saying,” said Peter Stano, spokesperson for EU Neighbourhood Policy Commissioner Stefan Füle.",
        "In e-mailed comments to EURACTIV, the Commissioner’s office detailed its plans. “The DCFTA will apply to the territory of the Republic of Moldova in its internationally recognised borders”, the Commission says but, it will be up to the Transnistrian authorities to apply the provisions of the deal and to “put in place all conditions necessary”.  The Commissionner's office added that it “encourages” Transnistrian authorities to adapt.",
        "'The economies are de facto one'",
        "The DCFTA is an integral part of a deal initialed last November at the EU Eastern Partnership Summit in Vilnius and goes hand in hand with an Association Agreement (AA) aimed at bringing the countries of the Eastern neighbourhood closer to the Union.",
        "EU heads of states and governments announced last December that they plan to sign the deals with Georgia and Moldova alreadyin August 2014 to avoid another Ukraine-like fiasco.",
        "Many experts consider that the economies of Chi?in?u and Tiraspol are so intertwined and linked to the EU’s markets that Russian threats and “doubts” about how the DCFTA will work in practice bear little significance.",
        "Nicu Popescu, senior analyst at the Paris-based EU Institute for Security Studies (EUISS), said that virtually every single Transnistrian company that was exporting goods or services to the EU was registered in the Moldovan Republic with Moldovan documents, stamps and bank accounts, for example.",
        "Moreover, 30% of Tiraspol exports are directed to Moldova, while another 40% are directed to EU countries, meaning companies already have to comply with EU standards.",
        "“Once the DCFTA is signed, Tiraspol’s companies will need to retain their status registered in Chisinau,” Popescu explained.",
        "“Currently, Moldovan and Transnistrian exports to the EU take place under the autonomous trade preference regime. After the DCFTA is signed [in the summer of 2014], Moldova will have another trade regime with the EU while a transitional period will be extended to 2015 for Transnistria to give the province time to adapt.”",
        "Popescu highlights the fact that since the Transnistrian economy is almost completely oriented westwards, only “political motivations stand behind a possible refusal to follow the DCFTA” rules in the future.",
        "“All complications are easy to solve once Transnistra follows its own economic interests,” he assured, adding that the political agitation on the part of Moscow and of the local authorities will lead to “killing what’s left of Tiraspol’s economy because of political slogans”.",
        "Russia could of course use other types of pressure – as the signature of the DCFTA and the Association Agreement approaches – such as trade bans, expulsion of migrant workers and even security threats inside the frozen conflict zone.",
        ">>Read also:Moscow placing pieces on Moldova chess board, analysts say",
        "“If Russia puts economic pressure over Moldova it will be damaging but not unbearable,” the expert assured. As for security risks in Transnistria, he said “in the worst possible case some clashes or exchange of fires could be expected, and even that is unlikely, but I do not expect any big war or serious conflagration.”"
      ],
      "url": "https://www.euractiv.com/news/moldova-eu-commission-clarifies-intentions-about-transnistria/",
      "scraped_at": "2025-11-14T13:14:01.157217",
      "paragraph_count": 20
    },
    {
      "title": "Ukraine and the west: hot air and hypocrisy",
      "content": [
        "Public clashes between Ukrainians and Russians in the main square in Sevastopol. Ukrainians protesting at Russian interference; Crimean Russians demanding the return of Sevastopol to Russia, and that parliament recognise Russian as the state language. Ukrainian deputies barred from the government building; a Russian \"information centre\" opening in Sevastopol. Calls from the Ukrainian ministry of defence for an end to the agreement dividing the Black Sea fleet between the Russian and Ukrainian navies. The move is labelled a political provocation by Russian deputies. The presidium of the Crimean parliament announces a referendum on Crimean independence, and the Russian deputy says that Russia is ready to supervise it. A leader of the Russian Society of Crimea threatens armed mutiny and the establishment of a Russian administration in Sevastopol. A Russian navy chief accusesUkraineof converting some of his Black Sea fleet, and conducting armed assault on his personnel. He threatens to place the fleet on alert. The conflict escalates into terrorism, arson attacks and murder.",
        "Sound familiar? All this happened in 1993, and it has been happening, in some form or other, since at least the 14th century.",
        "Instead of blustering into their microphones in a frenzy of self-righteous indignation, the leaders of the US and EU would do well to spend a few minutes swotting up on the history of this volatile region. They would learn that Crimea has a long history of conflict between its Ukrainian, Russian and Tartar communities, and has been ping-ponging back and forth between Ottoman, Russian and Ukrainian jurisdiction for years. Thelast time the British got involvedwas in 1853-6, and that, too, was a shambles. This time, the west's intervention has been foolish and inept, and its hypocrisy is shameful.",
        "Less than a month ago, a violent insurrection in the streets of Kiev against the elected government was greeted in the west as an uprising of \"the people of Ukraine\" choosing the west against closer ties withRussia. Everyone knows, if they stop to think about it, that such a simplistic characterisation of \"the people of Ukraine\" is wilfully naive, but the breathless journalists and huffy politicians gushing their stuff never stop to think. Thinking is dangerous. It can lead you to see the other person's point of view.",
        "The one thing we know for sure is that we don't know what's going on. The situation is volatile and murky. But that doesn't stop western politicians jumping in feet first. We don't know exactly what forces are at play, but we still desperately want to pin our naive \"goodies\" and \"baddies\" labels on to somebody.",
        "When things turned nasty in Kiev as armed protesters,some of them with fascist insignia, seized control of government buildings, the police cracked down, and snipers gunned down police and protesters in the streets. But who exactly were these snipers? The Estonian foreign minister, Urmas Paet, not a natural ally of Moscow, thought it was at least credible that they belonged to the anti-government Maidan protesters.\"Gosh!\" said the EU's Lady Ashtonin a leaked phone call.",
        "For a moment, the frothing stopped and a truce was negotiated, with the help of Poland, Germany and France, and supported by the US, Russia and the Kiev protesters, all realising that things had gone too far. The agreement allowed for a return to the old constitution, and new elections. Order was restored. Phew!",
        "But this compromise was quickly sabotaged by extreme elements among the protesters, including some sinister far-right elements who are now a de facto part of the government. They pre-empted the outcome of the elections by continuing the occupations and installing themselves in power. (But it's OK: it's not a coup, because they are pro-west.) The Russians were alarmed. What was the point of negotiating, if the agreements were not respected, the Russian interior minister demanded to know.",
        "As if in answer, president Viktor Yanukovych resigned. Victory was declared. Hurray! Neither the EU nor the US stood up for the agreement they brokered. Yanukovych fled, with his ill-gotten wealth.Yulia Tymoshenko was releasedfrom jail, with her ill-gotten wealth (which is OK in her case, because she is pro-west).",
        "Let us just pause to remember, before we gallop on to the next crisis, that Yanukovych, for all hisgrotesque self-enrichment, was democratically elected, as few of the new self-appointed government have been. We shouldn't feel too sorry for him, though. His allegedly pilfered billions will have already been safely stashed abroad,no doubt in some western-administered tax-haven, where they will be protected by our very own financial whizzes.",
        "And so it goes on. Unfortunately, someone in the new Ukrainian government flexes his anti-Russian muscles, and the Russian language is stripped of its official status throughout Ukraine. Fortunately, someone else sees sense and the move is cancelled. But if you were a Russian speaker, wouldn't you be rattled? Wouldn't you look around for support? Sixty per cent of Crimea's population is Russian. Suddenly, Russian troops appear in Crimea. Is it an annexation or a rescue? It depends on your point of view. Is there any evidence that Russia was behind the Crimean move to secede from Ukraine, or was it a homegrown initiative, as in 1993? The Russian Black Sea fleet had been docked on territory controlled by anti-Russians. And rumour has it that Nato is sniffing around for a new place to park its ICBMs. (But that's OK, because Nato is on our side.)",
        "I am no fan of Vladimir Putin, who is, in my opinion, a loathsome, anti-democratic tyrant with physique issues. But the EU and the US have played right into his grubby little hands. His popularity has soared enormously, because he has been doing exactly what a leader is supposed to do: he has been sticking up for the interests of his people. Would any western government allow its fleet to fall into the hands of its enemies? I hope not, though given the level of incompetence we have witnessed so far, anything is possible. Would any western government allow its enemies to station missiles a few miles off shore? Kennedy was hailed a hero for putting his foot down over Cuba. And Putin is being hailed a hero over Crimea. Whether the threats are real or not is irrelevant at this point.",
        "The Crimean peninsula itself had been ruled by Russia for centuries until Nikita Khrushchev gave it away to Ukraine in 1954, a move that was deeply unpopular in Russia – some say Khrushchev was drunk at the time –and most ordinary Russians – as well, it seems, as a majority of Crimeans themselves – would like to see it returned to Russia. Putin is also off the hook over the Ukrainian economy. Previously, Russia had agreed to bail out Kiev, but it seems that now this cost will be borne by European taxpayers. Will Ukraine also be offered membership of the EU? This is what most of the Maidan protesters were hoping for, but in truth, it was never on offer.",
        "All this makes me immensely sad, because Ukraine is a wonderful country, and Ukrainian people are clever, hard-working, resourceful, passionate, generous and good fun. They deserve better than to be pawns in this cynical east-west power game of spheres of influence, which has nothing at all to do with Iron Curtain anti-communism any more, and has even less to do with the wellbeing and happiness of ordinary people. Of course Ukrainians should be part of the EU: they have much to contribute, and were less of an economic basket-case before western advisers introduced them to casino capitalism. Maybe Russia will also one day be part of the EU. Why not? Of course Ukraine should not turn its back on its eastern neighbour. Putin is not to everyone's taste, for sure, but the Russian people are not the enemies of the Ukrainian people; on the contrary, in many cases, as in my own family, they are friends, colleagues, cousins, in-laws, husbands and wives.",
        "The cynicism and hypocrisy with which some politicians have tried to pick apart the seams in this delicate and ancient fabric fills me with rage and despair. The histories of Russia and Ukraine have been entwined since at least the ninth century, and so have Russian and Ukrainian families. Only in some fascist paradise are people ethnically \"pure\".",
        "In fact, Kiev was the original capital of Kievan Rus', the proto-Russian Slavic state of the early middle ages, but became too vulnerable during the Mongol invasions, and the administrative and royal headquarters were moved north, near Moscow, which gradually became the dominant region. The languages of north and south drifted apart, too, but are mutually comprehensible, and closer than, say, Italian and Spanish. Many people, like my own family, speakSurzhyk, a mongrel mixture of the two. During the 17th and 18th centuries, the western part of Ukraine was annexed by the Polish empire, which imposed Catholicism on a previously Orthodox population. During the 19th century, this region,Galicia, centred on the city of Lviv, belonged to the Catholic Austro-Hungarian empire. Not surprisingly, these regions of Ukraine are still predominantly Catholic, and see themselves as belonging in the west. In a way, this historic tug of war between Poland and Russia over Ukraine is still being played out, with Poland being the strongest champion of Ukraine in the EU. Poles sometimes refer to Ukrainians as \"Eastern Poles\", while Russians still sometimes call them \"Little Russians\".",
        "At the end of the second world war, when Churchill and Stalin met in Yalta to define the boundaries of the new world order, western-born Ukrainians who were refugees orostarbeiterworking under the Third Reich were allowed to stay in the west, like my family, whereas those who came from further east were sent back, often to face the gulag. This is why most Ukrainians now living in western countries hail from that western Catholic part of Ukraine, and are likely to support the Maidan protesters.",
        "The second world war has left its gory mark on this part of Ukraine in another way, too. Galicia was home to the notorious pro-NaziUkrainian Insurgent Army, whose leader, Stepan Bandera,was viewed as a hero by some Ukrainian nationalists(including my maternal grandfather), but a fascist antisemite by others (including my paternal aunt).",
        "The staggering wartime losses suffered during the second world war, which is still called the Great Patriotic war by those in Russia and the east of Ukraine, also underlies much of the bitterness now surfacing on the streets, since a member of the new Ukrainian government actually tried to ban the use of the term. Some 20 million Soviet citizens perished in the war against fascism, an almost unimaginable sacrifice; hostility towards those seen as neo-fascists is easily ignited. It is a defining historical sacrifice for eastern Ukrainians, in a way that Stalin's famine of the 1930s has become a defining sacrifice for Ukrainians in the west. In 2006, the authorities in Lviv erected a statue of Bandera in the central square, which provoked outrage in the east. It is Bandera's spiritual descendants who provided much of the organised violent muscle on the streets of Kiev. To tar the whole of the protest with the fascist brush would be very unfair, since most of the protesters are clearly just ordinary citizens fed up with the suffocating corruption of the old regime. But the western powers should be careful not to collude with neo-Nazis (though, to judge from much media coverage, their snipers and molotov cocktails are OK, because they're on our side).",
        "What will happen next? I predict that nothing will happen. There will be a tremendous amount of huffing and puffing of hot air; well-oiled muscles will be flexed and machinery moved about. Some kleptocratic Russian and Ukrainian ladies will have to put on hold their next shopping trip to Harrods or Gucci. But for the bankers, oligarchs and oilmen, it will be business as usual. They will still own big chunks of London. And, fortunately, their offspring will still be able to enjoy their elite education in some of the world's finest private schools cut-price, thanks to the generosity of the British taxpayers who have deemed those institutions to be charities.",
        "Let us hope I am right, because the alternative is civil war: people slaughtering each other in the streets over some fabricated notion of ethnicity. And even a bit of hot air and hypocrisy is preferable to that.",
        "Marina Lewycka is the author of A Short History of Tractors in Ukrainian. Her new book, Various Pets Alive and Dead, is published by Penguin."
      ],
      "url": "https://www.theguardian.com/world/2014/mar/10/ukraine-and-west-hot-air-hypocrisy-crimea-russia",
      "scraped_at": "2025-11-14T13:14:01.265985",
      "paragraph_count": 22
    }
  ]
}