{
  "total_articles": 4,
  "scraped_at": "2025-11-02T15:01:33.379868",
  "articles": [
    {
      "title": "Moldova's Trans-Dniester region pleads to join Russia",
      "content": [
        "A sign in Trans-Dniester reminds people: \"We are not Moldova!\"",
        "Pro-Russian politicians and activists in Moldova's breakaway Trans-Dniester region have asked the Russian parliament to draft a law that would allow their territory to join Russia.",
        "The Trans-Dniestrian appeal comes as Moscow moves towards absorbing Crimea into the Russian Federation. Ukraine, the EU and US say that move is illegal.",
        "Russian loyalists dominate Trans-Dniester, with support from Moscow.",
        "The region split from Moldova in a war in 1991-92, as the USSR was collapsing.",
        "Moldova's President Nicolae Timofti said in a news briefing on Tuesday that any decision by Moscow to accept Trans-Dniester \"would be a step in the wrong direction\".",
        "In a September 2006 referendum, unrecognised by Moldova and the international community, the region reasserted its demand for independence.",
        "Irina Kubanskikh, spokeswoman for the Trans-Dniester parliament, told Itar-Tass news agency that the region's public bodies had \"appealed to the Russian Federation leadership to examine the possibility of extending to Trans-Dniester the legislation, currently under discussion in the State Duma, on granting Russian citizenship and admitting new subjects into Russia\".",
        "A pro-Kremlin party, A Just Russia, has drafted legislation to make it easier for new territories to join Russia. The party told the Vedomosti newspaper that the text was now being revised, in order not to delay the rapid accession of Crimea to Russia.",
        "The Duma - Russia's lower house - and the Federation Council (upper house) are dominated by supporters of President Vladimir Putin.",
        "Vedomosti reports that the Trans-Dniester appeal to Russia also warns about a possible further deterioration if Moldova signs an association agreement with the EU.",
        "Moldova's leaders plan to do so. The crisis in neighbouring Ukraine erupted after former President Viktor Yanukovych was expected - and then refused - to sign such an agreement."
      ],
      "url": "https://www.bbc.com/news/world-europe-26627236",
      "scraped_at": "2025-11-02T15:01:32.561955",
      "paragraph_count": 12
    },
    {
      "title": "The country that doesn’t exist",
      "content": [
        "No other nation recognises Transnistria as a country, but within the sliver of land sandwiched between Moldova and Ukraine, the opinion of the UN doesn’t matter.",
        "The\nlast train out of the country was leaving in 10 minutes, and I was sitting in a\nroom no bigger than a prison cell, across from a border guard who held our\npassports hostage, awaiting his bribe.",
        "No other nation\nacknowledges Transnistria as a country, but at this moment, the opinion of the UN\nand the world’s cartographers only mattered on paper. There in that room,\nsitting across from a man with the power to detain me, I wasn't concerned with documentation.\nMy definition of a country became simple: border controls, armies and\ngovernments, all of which Transnistria has under its red-and-green flag bearing\na gold sickle and hammer. The only paper I was concerned with was cash, even though\nTransnistria’s currency is about as useful as Monopoly money anywhere else on Earth.\nHere, on this sliver of land sandwiched between Moldova and Ukraine –\nofficially known as a breakaway state within Moldova – 550 Transnistrian rubles\nwas worth about $50. And that’s how much we had to bribe the guard to let us board\nthe train departing Transnistria’s capital Tiraspol.",
        "After the\ntransaction, the only local currency I had left was a five ruble note, a Transnistrian\nkeepsake that I would keep indefinitely. My other two souvenirs – a body covered\nin flea bites and three bottles of brandy – would disappear in due time. But\nthat five ruble note, on the back of which sat a picture of theKVINT\nliquor factoryTransnistria was so proud of, would become the hardest-earned member of my\ncurrency collection.",
        "KVINT makes\nnearly nine million litres of alcohol each year, but it is particularly recognised\nwithin Eastern Europe for its brandies, which have won more than 100 medals at\ninternational competitions. KVINT produces its brandy using the same methods as\ncognac – but because the name cognac is reserved only for the alcohol made from\ncertain grapes twice-distilled in copper alembics in the region surrounding the\ncity of Cognac, France, KVINT differentiates its rich brandy by using the\nMoldovan word for the drink,divin.Still,\nmost people I met simply referred to it as cognac, which isn’t surprising in a\nplace that never seemed big on rules.",
        "Transnistria’s\nhistory is short and contentious. The name first referred to a region born in\nWWII that included southern Ukraine and its capital at the time, Odessa. The\nmuch smaller, ethnically Russian territory now known as Transnistria declared independence\nin 1992 after the fall of the Soviet Union through a bloody four-month war with\nRomanian-speaking Moldova, which still lays claim to the area. But while most people in this\nRussian-speaking land\nhave Moldovan passports, a 2006 vote in which 97% of the population voted for independence\nwith free association to Russia illustrates their true allegiance.",
        "Its murky\npast, coupled with strong accusations of KGB government presence and a bustling\nillegal arms trade, doesn’t give Transnistria a lot to be proud of. Other than a\nstate-of-the-art professional football stadium, the one thing Transnistrians\ncan brag about is their brandy.",
        "The quality\nof this fine spirit starts with the grapes, and Transnistria benefits from its\nproximity to the Black Sea and Dniester River (from which it gets its name). Combined\nwith a moderate continental climate and rich soil, the territory is perfect for\ngrowing a large number of grape varieties; KVINT uses more than 20 local and\nEuropean varieties in its products, including bianca and cabernet sauvignon.",
        "But the\nreal alchemy happens in the oak barrels, where the spirit turns from a clear,\nharsh distillate into liquid gold – at least at its best. I can only dream\nabout the divine flavours that seep into a barrel of the 50-year divin, but the\nnine-year – similar to a comparable cognac – was sophisticated and fruity, with\ntastes of caramel and just the right amount of burn. The three-year, on the\nother hand, is better served in a shot glass with something on the side to neutralise\nthe scorching sensation. Then again, the three-year only costs about 33 Transnistrian\nrubles a bottle instead of more than 29,000\nTransnistrian rubles for the 50-year Prince\nWittgenstein.",
        "KVINT produces\nabout 3.5 million litres of divin each year, which is enough to have stores all\nover Tiraspol selling exclusively KVINT products. Its reported 30 million euro revenue\nin 2012 is about 4% of Transnistria’s GDP, according tostatistics\nfrom the Centre for Eastern Studies. This $1bn GDP would make Transnistria\nthe poorest country in Europe.",
        "But\naccording to Timoti Ohotcii, owner\nofTiraspol Hostel– a rundown house with sulphur-water showers\nand flea-ridden, partially reclining chairs for beds – Tiraspol is far from\npoor; it just runs things a little differently. The money that flows through\nTransnistria is off the books, he said, which is believable considering cash Transnistrian\nrubles (or on rare occasion, American dollars or Russian rubles) are generally\nthe only form of accepted payment.",
        "Of course,\nin addition to the off-the-books economy is Transnistria’s notoriety for being\nacesspool of corruption: organised crime, illegal arms sales, human\ntrafficking and money laundering.",
        "At the centre of that corruption, reportedly, isSheriff, a conglomerate started by two ex-KGB\nagents, which holds the reins on Transnistria’s entire economy, owning petrol stations,\na television channel, a mobile phone network, supermarkets, a car dealership\nandFC Sheriff Tiraspol, the football club that plays in\none of Europe’s finest stadiums, a shiny, extremely expensive testament to the\ncountry’s greatness.",
        "Sheriff also\nhappened to purchase KVINT in 2006, which had been state-owned for most of its\n116-year history. It’s the oligopolous result of Transnistria’s slow-moving transition from communism to capitalism, or\nwhat Ohotcii liked to call “old-west capitalism”.",
        "In his\nhostel advertisements, Ohotcii – who was a reasonably knowledgeable tour guide, if not the\ngreatest hostel owner –\npromotes Transnistria as “the last remnants of the Soviet Union” – and in some\nways it still is. While every other country in the former USSR demolished many remnants\nof their Soviet past, Transnistria still clings to what they see as the good\nold days. Soviet monuments still stand guard throughout Tiraspol, and the city\nholds a Soviet-style military parade on their Independence Day, 2 September. It\nis the only post-Soviet land to wave the hammer and sickle on its flag, and a\nlarge bust of an austere Lenin stands in front of Transnistria’s parliament\nbuilding, illustrating that the formation of this quasi nation was as much\nabout ensuring the\ncommunistic future rejected by the rest of the USSR as it was about the right\nto keep Russian over Romanian as its national language.",
        "But at the\nsame time, Tiraspol is a quiet town with smiling faces, beautiful parks and\ntrendy sushi restaurants. I met nothing but friendly people during my stay and –\nuntil we were forced to bribe our way out of the country – the only corruption\nwe heard of was through news articles or internet documentaries. Even when we\nwere detained, the border guard was fully pleasant, kind of funny even. Looking\nback, the whole incident was our fault anyway. We had listened to Ohotcii’s advice and, for reasons I still don’t\nunderstand, purposefully avoided registering with the police when entering the\ncountry.",
        "The 550\nrubles we gave him probably could have fed his family for a month and was a\nsmall price to pay for a story of intrigue to be told over a snifter of my last\nremaining bottle of KVINT brandy.",
        "The BBC has a robust anti-corruption\npolicy in place and BBC Worldwide staff undertake a comprehensive training\nprogramme to ensure that they are aware of the UK Bribery Act and the issues\nthat it raises. Although the tone of this article is relatively light-hearted,\nwith the bulk of the piece focusing on the culture behind Transnistria’s\naward-winning brandy, the individuals concerned were locked in a room and had\ntheir passports taken away during the reporting process, compromising their\nsafety and putting them in a situation of duress – a situation recognized by\norganisations such as Transparency International. Considering Transnistria’s\ndisputed history, BBC Travel editors felt it would paint an inaccurate\npicture if the encounter were left out."
      ],
      "url": "https://www.bbc.com/travel/article/20131212-bribery-and-brandy-in-a-country-that-doesnt-exist",
      "scraped_at": "2025-11-02T15:01:32.871591",
      "paragraph_count": 18
    },
    {
      "title": "Moldova election: Pro-EU parties edge pro-Russian rivals",
      "content": [
        "This video can not be played",
        "Ben Bland reports on results from Moldova's parliamentary elections",
        "Latest results from Moldova's parliamentary elections show that pro-EU parties have a narrow lead over those backing closer ties with Russia.",
        "With most of the votes counted, the three pro-Western parties have about 44%. The opposition has 39%.",
        "No party appears to be able to form a government, and tough post-election bargaining is predicted.",
        "The elections have taken on a wider significance in the shadow of the conflict in neighbouring Ukraine.",
        "Moldova and Ukraine have signed far-reaching partnership agreements with the EU, bitterly opposed by Russia.",
        "On the eve of the vote, one pro-Russian party was banned from Sunday's poll - a move criticised by Russia.",
        "Residents of the Russian-backed breakaway region of Trans-Dniester did not take part in the election.",
        "Analysis by Nick Thorpe, BBC Central Europe correspondent",
        "The three pro-EU parties will have a big enough majority to form a government. But those aspirations have been dented by the strong showing of the Socialist Party, which wants Moldova to join Russian President Vladimir Putin's planned Eurasian Union instead.",
        "As the largest single party in the new parliament, Socialist leader Igor Dodon promised that his party in opposition would make the \"European integrationists shake with fear\".",
        "Tough bargaining lies ahead. One reason for the fall in support for the pro-European parties - from 52% at the 2010 elections, to 44.6% per cent now - was their history of infighting. Another reason was their perceived corruption.",
        "The election also showed a change in popularity for the three main pro-Russian parties. The younger and more outspoken Socialists overtook the Communists.",
        "According to latest results, the three pro-European parties are set to have 57-58 seats in Moldova's 101-seat parliament, while the two pro-Russian opposition parties are expected to hold 43-44 seats, reports say.",
        "The pro-Russian Socialist Party came first with 21% of the vote. The Communist Party was in third with almost 18%. The party is a Soviet-era survivor that still uses the hammer and sickle as its symbol, although it is not seen as fundamentally opposed to EU integration.",
        "The pro-EU Liberal Democrats were in second place with 19%. The party wants Moldova to achieve EU candidate status by 2017 and full membership by 2020. Two other pro-Europe parties - the Democrats and the Liberals - were on  16% and 9% respectively.",
        "There have been reports that the pro-EU parties may now try to form a \"grand coalition\" with the communists to keep the country on the European track.",
        "Between East and West - Russian dolls can be bought in Chisinau markets",
        "Ukraine has been in crisis since last November, when the former leadership made a last-minute U-turn, refusing to sign a landmark association and free trade deal with the EU - under huge pressure from Russia.",
        "This triggered mass protests in Ukraine that ousted President Viktor Yanukovych, and Kiev later signed the EU deal. But the protests, in turn, led to Russia annexing southern Crimea peninsula in March and throwing support behind separatist rebels in eastern Ukraine.",
        "Ahead of the Moldova vote, analysts said poll ratings of the Socialists, who want Moldova to turn its back on the EU and join a Russia-dominated economic bloc, had been boosted by their populist campaigning, including concerts by Russian pop stars.",
        "Moldova remains one of the poorest countries in Europe",
        "The pro-Moscow parties had been expected to pick up additional votes after the decision to ban the pro-Russian Fatherland party, on the grounds that it had illegally received foreign funding.",
        "Fatherland, whose leader fled to Russia, denies the claim.",
        "Turnout was just under 56%, the central electoral commission said, out of a total of 2.7 million eligible voters.",
        "Parties need to get at least 6% of the vote to gain seats in parliament.",
        "The opposition was also hoping to capitalise on the growing economic problems under the pro-Western government in Moldova - one of Europe's poorest countries.",
        "The situation worsened after a Russian ban on imports of Moldovan agricultural products - including wine, meat, fruit and vegetables.",
        "Will Moldova choose EU or Putin?",
        "Russian wine ban hits Moldova",
        "Putin wants say in Moldova-EU trade",
        "Moldova country profile",
        "The plight of Moldova's orphanage children",
        "Liberal Democratic Party"
      ],
      "url": "https://www.bbc.com/news/world-europe-30265985",
      "scraped_at": "2025-11-02T15:01:33.140563",
      "paragraph_count": 35
    },
    {
      "title": "The plight of Moldova's orphanage children",
      "content": [
        "Reliance on the state partially explains the number of children brought up in institutions",
        "More than 7,000 children have been placed in state-run institutions in Europe's poorest country, Moldova, and only 2% are orphans.",
        "While the horror stories of the orphanages of 1990s Romania were widely publicised, the conditions facing children in neighbouring Moldova are not well known.",
        "Widespread poverty and a lack of basic social services are blamed for a situation which aid groups argue violates a child's right to a family, as enshrined in theUN Convention on the Rights of the Child,external.",
        "In the capital, Chisinau, the institutions are surprisingly well maintained.",
        "From the outside, the one I was able to visit looked like a school, with plants and a play area, while inside there were pictures on the walls and toys on display.",
        "Yet the first thing you notice is how quiet it is: dozens of young children live in the institution, but you do not hear any noise.",
        "The toys are not being played with; instead children are lying in cots. In one room is a group of about a dozen toddlers.",
        "Some parents leave Moldova to seek work, and leave their children behind",
        "They believe their children will be better off under the care of the state",
        "These youngsters rarely go outside, says Lavinia (not her real name), who works with Hope and Homes for Children, a charity that tries to return children to their families.",
        "Instead, the children spend almost all of their time in just two rooms.",
        "In the corner, a disabled child is left lying in vomit.",
        "No pictures indoors are allowed.",
        "The manager says there are not enough staff to take the children outside, although there appear to be more staff than children.",
        "Lavinia is clearly frustrated by the attitude, but there is little she can do, even though she is working with local authorities on reforming childcare services.",
        "\"What we need is to inform and educate families,\" she says.",
        "\"If we can develop family alternatives, this would prevent more children having to live like this.\"",
        "In another room, 10 newborns lie alone in cots. The institution's manager does not know their sexes.",
        "The standards are shocking for Sarah Butterworth, a UK mental-health specialist on children in care who is visiting at the same time.",
        "\"[Knowing] how the brain develops in the first few months of life means I can only imagine the damage that is happening before our eyes,\" she says.",
        "But experts say institutions are often the worst way to raise children",
        "In one institution, the children simply did not go outside",
        "Although basic needs appear to have been met, these do not look like valued children.",
        "Most of them are not even orphans; they have families but have been abandoned because of poverty and an outdated social reliance on state care.",
        "Moldova's Soviet legacy still remains, and reliance on the state care is embedded in people's attitudes and the law, according to Dr Delia Pop of Hope and Homes for Children.",
        "\"For many, institutional care has become the only option,\" she says. \"The irony is that it gets called 'childcare', even though this is one of the most damaging systems for children.\"",
        "The authorities accept changes are needed but say one of the biggest obstacles is the weakness of the Moldovan economy.",
        "\"We want to reform institutions for babies and young children,\" says Svetlana Chifa, head of the Child Protection Department in Chisinau.",
        "Unemployment in Moldova is high and young adults often head abroad to find work, leaving their children behind to the state.",
        "They believe what they are doing is for the best.",
        "There is also the stigma of disability. A three-year-old I visited, who has been helped into a foster family, was abandoned simply because he was born without an arm.",
        "The situation is even harder  in the breakaway eastern region of Trans-Dniester, which is technically part of Moldova but sees itself as a separate country.",
        "\"Trans-Dniester has an attitude for independence, and has strong connections with former Soviet countries,\" says Dr Pop.",
        "This gives aid workers additional challenges in encouraging co-operation to get children out of institutions and back with their families.",
        "Visiting the region is like going back in time.",
        "The region of Trans-Dniester lies on the Ukrainian border, and considers itself independent",
        "Placing children in such institutions is simply firefighting an ever-expanding, complex social problem rather than offering a long-term solution for the many children within their walls, says children-in-care specialist Sarah Butterworth.",
        "Even when compared with children living in the most deprived of households, children in care are more likely to grow up as dysfunctional adults.",
        "\"Years of research have shown the importance of family-based care and attachment, which children in institutions just aren't offered,\" she says.",
        "Developmental needs, attachment, love and consistency are overlooked.",
        "The authorities in Moldova acknowledge solving this problem is about changing ingrained attitudes and will not happen overnight, partly because many who work in such institutions have a vested interest in them remaining open.",
        "\"People are cautious about changes,\" says Svetlana Chifa.",
        "\"The institutions are their livelihoods and people could lose their jobs when they close.\"",
        "The children left behind",
        "Moldova country profile"
      ],
      "url": "https://www.bbc.com/news/world-europe-29204924",
      "scraped_at": "2025-11-02T15:01:33.378194",
      "paragraph_count": 46
    }
  ]
}