{
  "total_articles": 27,
  "scraped_at": "2025-11-14T14:42:05.438077",
  "articles": [
    {
      "title": "I am scared Putin will come': How tensions are rising on the border with Transnistria",
      "content": ["Yana standing outside her house in Serby \r\nCopyright Credit: Stefan Weichert\r\nBy Stefan Weichert\r\nPublished on 16/05/2022 - 16:08 GMT+2 •Updated 17/05/2022 - 19:03 GMT+2\r\nShare\r\nComments\r\n“I don’t know where we would go if the Russian troops came here. There is nowhere to run.”\r\nYana stands in her pink flip-flops about 15 kilometres from the Moldova border. She is scared. \r\n\r\nLike others in the towns and villages in this region, she is worried the focus of Russia's war in Ukraine will spread toward Transnistria. \r\n\r\nTransnistria is a small pro-Russia breakaway region sandwiched between Ukraine and Moldova, both formerly part of the Soviet Union. It unilaterally declared itself independent in the early 1990s but is not recognised by any other country worldwide. Russia has a small contingent of 1,500 troops in the region it says are peacekeepers. \r\n\r\n“We see more and more Ukrainian military here,\" said Lana, 30, who lives with her husband and two children in Serby. \"They are here to protect us, and while they say that all will be okay, I know they are here for a reason. I am scared that [Russian President Vladimir] Putin might eventually come.”\r\n\r\nIt comes after a senior Russian commander Major General Rustam Minnekayev said in April that Moscow's objective was to take full control of southern Ukraine and the eastern Donbas region, giving it access to Crimea -- which it annexed from Ukraine in 2014 -- and Transnistria. \r\n\r\nADVERTISEMENT\r\n\"Control over the south of Ukraine is another way out to Transnistria, where there are also facts of oppression of the Russian-speaking population,\" said Maj Gen Minnekayev.\r\n\r\nI don’t know where we would go if the Russian troops came here. There is nowhere to run.\r\nUkraine sees Russian claims that people in Transnistria are oppressed as a Russian attempt to justify an intervention into Moldova. \r\n\r\nYana, meanwhile, told Euronews she doesn’t know what to do at this point. \r\n\r\nShe might want to evacuate if things worsen but she also knows that all she owns is the family's house and doesn’t want to leave that.\r\n\r\n“I never thought that it could be dangerous to live here. We always had a quiet relationship with Pridnestrovie (the other name for Transnistria),” she said. “I don’t know where we would go if the Russian troops came here. There is nowhere to run.”\r\n\r\nIs Russia trying to destabilise Moldova?\r\nThe concern that Russia might want to reach Transnistria has spiked in recent weeks after several explosions inside Transnistria. \r\n\r\nThe breakaway region, which has close ties to Moscow, said administrative buildings such as its state security headquarters have been attacked. In addition, they reported that two radio towers and a military unit has been hit.\r\n\r\n“According to preliminary data, the traces of those who organised the attacks are leading to Ukraine,” Transnistrian foreign minister Vitaly Ignatiev told Interfax.\r\n\r\nKyiv has denied having anything to do with the explosions and claims Russia is behind them. \r\n\r\nUkraine President Volodymyr Zelenskyy said Moscow was using false flag attacks -- committing a bombing to disguise the source and pin the blame on someone else -- as a pretext for attacking Moldova.\r\n\r\nADVERTISEMENT\r\n\"We clearly understand that this is one of the steps of the Russian Federation,\" said Zelenskyy. \"The goal is obvious — to destabilize the region's situation and threaten Moldova. They show that if Moldova supports Ukraine, there will be certain steps.\"\r\n\r\nThere has also been speculation that Russian forces inside Transnistria could attack Ukraine to open another front in the war and stretch the Ukrainian troops.\r\n\r\n“This is a distinct possibility, in the sense that it would fit with Putin's strategy to reconstitute as much as possible of the former Soviet Union as a Russian sphere of influence as the basis for Russia's great power status,” Stefan Wolff, an international security professor at Birmingham University, told Newsweek.\r\n\r\n“For that to work in Moldova, Putin needs a land connection which he might now seek to establish. The other issue, of course, is that the Russians need military capabilities to achieve this. For now, it does not seem they are making much progress, even in Donbas.”\r\n\r\nCredit: Stefan Weichert\r\nSergei Credit: Stefan Weichert\r\n'I don’t mind if Russia comes'\r\nSergei, 60, is sitting at a small plastic table drinking vodka and beer with his friends outside a small kiosk in Otaci, Moldova, about 60 kilometres from Transnistria. \r\n\r\nHe and his friends have heard the rumours that Russia might want to reach Transnistria and potentially invade all of Moldova to reclaim some of the former Soviet Union. \r\n\r\nHowever, they find it hard to believe.\r\n\r\nThey cannot understand that Putin would have any interest in Moldova, which they say is a friendly nation to Russia. \r\n\r\nSergei, who doesn’t want to give his last name, argues that Ukraine is partly responsible for the war.\r\n\r\n“There are many Nazis in Ukraine. They have such bullshit,” said Sergei, echoing the Russian narrative -- dismissed by scholars of Nazism as Russian propaganda -- that Moscow is intervening in Ukraine to \"denazify\" the country.\r\n\r\nSergei says he used to serve in Soviet Army in Afghanistan, where he was wounded. He said as someone who knows about war, conflict is the last thing he wants. But, he added, it wouldn’t be bad if Russia had a more influence here in Moldova, he argues.\r\n\r\nADVERTISEMENT\r\nHis friends agree. They argue the economic situation in Otaci and Moldova overall has worsened since the collapse of the Soviet Union.\r\n\r\n“We are helping so many Ukrainian refugees here in Moldova and giving them everything, and at the same time, we, the Moldovian people, are suffering,” argues the 49-year-old kiosk owner Inna.\r\n\r\n“Gas and electricity prices have risen. Everything is more expensive now. I can’t even turn the heating on in winter.”\r\n\r\nAlena, 40, who is sitting and drinking a beer while her five-year-old son Artem waits quietly next to her, says she would welcome the Russian troops here.\r\n\r\n“I don’t think that Russia will come here. In Moldova, everyone is for Russia, not for Ukraine, but for Russia,\" she said.\r\n\r\n\"But I would love to see Putin interfere in our Moldova and take us away. I wish I could [see this].” \r\n\r\nCredit: Euronews\r\nTransnistria is sandwiched between Ukraine and Moldova Credit: Euronews\r\nSoviet nostalgia\r\nVolodymyr Fesenko, chairman of the Penta Center of Applied Political Studies in Ukraine, says that it isn’t unusual that people's opinion of Russia is split close to the border with Transnistria. It is similar to what was seen in Eastern Ukraine before the war.\r\n\r\n“As a rule, many people of older generations show nostalgia for the Soviet times,\" Volodymyr Fesenko, chairman of the Penta Center of Applied Political Studies in Ukraine, told Euronews, referring to Moldovans. \r\n\r\n\"Therefore, the gap between generations in this respect really exists. But not only between generations but also between regions. \r\n\r\n\"In the Russian-speaking regions, nostalgia for the USSR manifested itself more strongly, and in the west of Ukraine, a critical attitude towards the USSR dominates.\"\r\n\r\nHe points out that some people's nostalgia for the Soviet times often can transits into support for Russia, despite the two being very different.\r\n\r\n“In the older generations, nostalgia for the USSR is primarily due to social reasons,” he added. “Under the socialist system, there were no large gaps in income; there was a system of social guarantees, somewhat higher pensions, low utility rates. At the same time, many do not even understand how the pension fund is formed, and that in the USSR, there were two workers for one pensioner, and now there is one pensioner for one worker.\r\n\r\nADVERTISEMENT\r\n“Many have forgotten that during the Soviet era, there was a shortage of many goods, even meat and sausage.”\r\n\r\nA Politico poll showed that 46% of respondents in Moldova view the Russian invasion as an “unjustified attack”. \r\n\r\nBy comparison, 18% believed the Kremlin narrative that Russia is liberating Ukraine from Nazism. \r\n\r\nCredit: Stefan Weichert\r\nLiubov Credit: Stefan Weichert\r\n'Putin is a crazy leader'\r\nBack in Ukraine, at Kodyma, near Transnistria, Euronews speaks to 63-year-old Liubov in her garden, while her husband mows the lawn. She just got back from the hospital after a stroke and is enjoying the sun. She says that some people in the city think life was better here during the Soviet Union, but Liubov says it is nonsense.\r\n\r\n“The only good thing under the Soviet Union was stability. With stability, I mean that you always had a job, but besides that, nothing was stable,” said Liubov, “Somebody always took care of you back then, but you were also very poor. We didn’t have any cars; now we have two. Back then, you could also not say anything. You were locked.\r\n\r\n“I think that people forget this. And I think that Putin thought that we were the same people now in Ukraine as in the Soviet Union, but we are not. Some might believe that things were better back then, but most of us have tasted too much freedom ever to be able to go back to restrictions of the Soviet life.”\r\n\r\nShe says that generally, the people across the Moldovian and Ukrainian border are the same people who just want peace. \r\n\r\nPutin is the only one who wants war, she adds.\r\n\r\n“Putin is just a crazy leader. I do not believe that he will get here. I am sure that we will push them back. We didn’t attack anyone. Putin did,” said Liubov.\r\n\r\nShe begins going red in the face as she speaks about Putin. Her husband reminds her the doctor told her only to watch television for ten minutes a day due to the recent stroke and how emotional Liubov becomes when seeing the horrors of war.\r\n\r\n“You need to stop this interview,” he said to her. “It is worse for you than watching the news.”"],
      "url": "https://www.euronews.com/my-europe/2022/05/17/i-am-scared-putin-will-come-how-tensions-are-rising-on-the-border-with-transnistria",
      "scraped_at": "2025-11-14T14:41:49.095049",
      "paragraph_count": 0
    },
    {
      "title": "Ukraine war: Blinken condemns 'barbaric' Russian strikes; new director at Zaporizhzhia nuclear plant",
      "content": ["The Ukrainian flag flatters at half mast near the Ukrainian Motherland monument in Kyiv.\r\nCopyright AP Photo/Bernat Armangue\r\nBy Euronews with AFP, AP, Reuters\r\nPublished on 30/11/2022 - 17:37 GMT+1\r\nShare\r\nComments\r\nHere is our summary of the latest news around Russia's war in Ukraine.\r\n1. 'Barbaric' Russian strikes on Ukraine 'will not work,' says Blinken\r\nThe US Secretary of State Antony Blinken has denounced Russia's \"barbaric\" strikes against civilian infrastructure in Ukraine.\r\n\r\nBlinken said on Wednesday that Russian President Vladimir Putin had focused his \"fire and ire\" on Ukraine's civilian population but would not divide them.\r\n\r\nThe US Secretary of State was speaking after a two-day NATO meeting in Bucharest.\r\n\r\n\"Russia has bombed more than a third of Ukraine's energy system, leaving millions of people in the cold and dark,\" Blinken told a news conference.\r\n\r\n\"Heat, water, electricity ... these are President Putin's new targets, he's hitting them hard. This brutalisation of Ukraine's people is barbaric.\"\r\n\r\nADVERTISEMENT\r\n\"This strategy has not, and will not, work. We will continue to prove him wrong.\"\r\n\r\nRussia has carried out huge attacks on Ukraine's energy infrastructure in recent weeks, leaving millions of people without heating and power amid sub-zero temperatures. Kyiv has labelled the strikes as a \"war crime\".\r\n\r\nRussia has denied targeting Ukrainian civilians and has blamed the attacks on Kyiv's failure to negotiate a peace deal.\r\n\r\nThe United States has concentrated their attention on supporting Ukraine's energy resilience.\r\n\r\nBlinken's comments came after former Russian President Dmitry Medvedev warned NATO against providing Ukraine with Patriot missile defence systems.\r\n\r\nKyiv has asked its Western partners for air defences, including US-made Patriot systems, to protect it from Russian attacks on its energy infrastructure.\r\n\r\nNATO Secretary-General Jens Stoltenberg has confirmed that deliveries of sophisticated surface-to-air missile systems are being considered by some allies.\r\n\r\nRelated\r\nUkraine war: Kherson 'shelled 258 times in a week'; Pope slams 'Russian cruelty'; and NATO meeting\r\nNATO meets to talk Ukraine at scene of one of its most controversial decisions\r\nNATO backs Ukraine’s future membership and pledges more aid to Kyiv\r\n2. Several killed in fires after latest Russian strikes - Ukrainian officials\r\nSeveral people have been killed by fires after Russian strikes on Ukraine's power infrastructure, authorities say.\r\n\r\nADVERTISEMENT\r\nUkraine’s state emergency service said there had been more than 130 fires in the last 24 hours, with many people resorting to emergency generators and gas cylinders.\r\n\r\nPower outages have led to a surge in accidents “due to the violation of fire safety rules”, the service said.\r\n\r\nNine people are so far reported to have died, with at least eight others injured. \r\n\r\nUkrainian officials have also reported the deaths of two people after Russian shells hit a hospital in the northern Sumy region and a residential building in the southern city of Kherson.\r\n\r\nFive Ukrainian civilians were killed by Russian forces on Tuesday, according to a senior government official.\r\n\r\nRussian forces pulled back from Kherson earlier this month but have dug in on the eastern bank of the Dnipro river and have continued to carry out missile strikes in the area.\r\n\r\nMany Russian soldiers have moved from Kherson to the eastern Donetsk region, where Moscow claims it has captured two Ukrainian villages near Bakhmut.\r\n\r\nThe city -- which has been partially destroyed by missile strikes -- remains under Kyiv's control amid intense fighting.\r\n\r\nThe US-based Institute for the Study of War says that Russian advances in the Donetsk region are \"marginal\".\r\n\r\nRelated\r\nWar in Ukraine: Kherson remains vulnerable as weather stalls frontline fighting\r\nUkraine War: Kherson is free, but still under bombardment\r\nMeanwhile, the governor of the Russian region of Bryansk has reported that a fuel depot was on fire.\r\n\r\nThe blaze broke out around 150 kilometres from the border with Ukraine. No casualties have so far been reported.\r\n\r\n\"Teams of firefighters and rescue workers are on the scene,\" governor Alexander Bogomaz wrote on Telegram.\r\n\r\nADVERTISEMENT\r\nUkrainian shells have previously struck Russian oil depots in the region, causing major power outages.\r\n\r\n3. Ukrainian engineer appointed new director of Zaporizhzhia plant\r\nThe chief engineer of the Zaporizhzhia nuclear power plant has agreed to become the new director of the site.\r\n\r\nUkrainian Yuri Chernichuk said it was the \"only possible and correct decision\" to run Europe's largest nuclear facility, which is not producing electricity but is still run by its Ukrainian staff to keep it safe.\r\n\r\nHis appointment was confirmed by Rosenergoatom, the Russian nuclear power operator at the plant.\r\n\r\nThe Zaporizhzhia site has been occupied by Russian forces since March, while the region is one of the four that Moscow annexed in September.\r\n\r\nMoscow said in October it was putting the plant under Russian control, a move the Ukrainian government says is illegal.\r\n\r\nRelated\r\nUN nuclear chief pushes for safety zone at Zaporizhzhia power plant in visit to Kyiv and Moscow\r\nUkraine war: Zaporizhzhia nuclear power plant disconnected after Russian shelling\r\n‘Playing with fire’: More strikes recorded at Zaporizhzhia power plant\r\nBoth Ukraine and Russia have accused each other of shelling near the facility, prompting fears of a nuclear disaster.\r\n\r\nThe UN's International Atomic Energy Agency (IAEA) has repeatedly condemned the \"unacceptable\" missile strikes near the plant.\r\n\r\n\"We have done and are doing the possible and the impossible to ensure that the world does not experience new [accidents] Fukushima and Chernobyl,\" Chernichuk said in the statement.\r\n\r\nAccording to Kyiv, Russia has positioned 500 soldiers at the Zaporizhzhia plant.\r\n\r\nUkraine had also accused Russian authorities of abducting the previous director of the facility, Ihor Murashov, before releasing him.\r\n\r\nAP Photo/File\r\nA Russian serviceman guards in an area of the Zaporizhzhia Nuclear Power Station. AP Photo/File\r\n4. EU proposes UN-backed court to investigate Russian war crimes\r\nEuropean Commission President Ursula von der Leyen has suggested setting up a UN-backed specialised court to investigate possible war crimes committed by Russia in Ukraine.\r\n\r\nADVERTISEMENT\r\nvon der Leyen said on Wednesday that the bloc would also continue to support the work of the International Criminal Court (ICC).\r\n\r\nUkraine has been pushing for the creation of a special court to prosecute Russian military and political leaders. Moscow has always denied the allegations of war crimes.\r\n\r\nThe Hague-based ICC has already launched probes into suspected war crimes in Ukraine but it does not have the authority to prosecute.\r\n\r\nVon der Leyen also stated that the EU wants to use frozen Russian assets to repair an estimated €600 billion worth of damage in Ukraine.\r\n\r\nThe bloc has currently sanctioned around €300 billion of Russian central bank reserves and €19 billion of Russian oligarchs' money.\r\n\r\nMany assets of blacklisted Russian citizens are difficult to seize or even freeze because they are registered abroad to family members.\r\n\r\n\"We will work on an international agreement with our partners to make this possible. And together, we can find legal ways to get to it,\" von der Leyen said on Wednesday.\r\n\r\nThe EU said the restrictions on Russian assets could be lifted if a peace deal between Ukraine and Russia settled the question of damages reparation.\r\n\r\nRelated\r\nRussia has committed war crimes in Ukraine, say UN investigators\r\nThere's no safe haven for impunity, ICC's chief prosecutor tells Euronews\r\nUkraine war: EU proposes UN-backed specialised court to probe alleged Russian war crimes\r\n5. Concerns grow over Russian influence on neighbours\r\nAt Wednesday's meeting in Romania, NATO diplomats also focused on Russia's influence over its neighbours and in the western Balkans.\r\n\r\nThe foreign ministers of Bosnia, Georgia and Moldova met with their NATO counterparts to discuss ways that the alliance may be able to support them through political, energy and territorial uncertainty.\r\n\r\nDutch Foreign Minister Wopke Hoekstra said the meeting is aimed at ensuring “more safety and security on the European continent.”\r\n\r\n\"It is a signal on how important it is to create stability not only for NATO countries itself but also beyond,\" he added.\r\n\r\nBosnia has witnessed a number of recent protests following regional elections won by the pro-Russian Bosnian Serb leader.\r\n\r\nADVERTISEMENT\r\nBosnian Foreign Minister Bisera Turkovic said her country “is very concerned about the future.”\r\n\r\n\"We have Russian proxies in our government and division in our country is deep,\" she said.\r\n\r\nRelated\r\n'Friend of our country': Putin praises separatist Bosnian Serb leader during his Kremlin visit\r\nHow Russian strikes on Ukraine heighten Moldova’s energy crisis\r\n'You are not welcome': Border protest calls for Georgia to stop influx of Russians\r\nNATO has promised Georgia that -- like Ukraine -- it will one day join the 30-nation alliance, although a breakaway Georgian region has this year threatened to hold a referendum on joining Russia.\r\n\r\nRussia’s war in Ukraine has impacted Moldova, which is currently facing a severe energy crisis due to its reliance on Russian energy.\r\n\r\nIn recent weeks, Moldova has suffered massive power outages after Russian strikes on Ukraine’s energy grid. Blasts have also occurred in the country’s Russian-backed breakaway region of Transnistria — where Moscow bases around 1,500 troops.\r\n\r\nNATO members have previously called on the alliance to ensure that Russia could not destabilise other countries and \"dictate security options\".\r\n\r\n\"The stability in western Balkans is important for peace. We need to stop the Russians in the western Balkans, we need more Europe,\" said Italian foreign minister Antonio Tajani.\r\n\r\n\"We need to protect all the countries in the western Balkans and close to Ukraine because it is important at this moment to work together. Unity is important and it's a strong message to Russia.\"\r\n\r\nRelated\r\nKyiv demolishes Soviet monument representing Russia-Ukraine friendship\r\n6. Odesa council votes to remove Catherine the Great statue\r\nAuthorities in the Ukrainian Black Sea port of Odesa have voted to remove a statue of Empress Catherine the Great of Russia.\r\n\r\nThe monument to the city's founder will be relocated, Odesa city council said on Wednesday.\r\n\r\nThe statue towers over a central square but has been repeatedly vandalised with red paint following Russia's invasion.\r\n\r\nA small majority of Odesa residents had already voted in an online poll to remove the monument.\r\n\r\nADVERTISEMENT\r\nCatherine the Great -- who served as empress of Russia from 1762 to 1796 -- founded Odesa in the late 18th century and the city became a strategic point for the former Soviet Union.\r\n\r\nThe empress' statue had previously been dismantled in 1920 under Soviet rule but was restored by Ukrainian authorities in 2007.\r\n\r\nSince Moscow's invasion, Ukrainian authorities have been removing monuments and renamed some streets linked with Russia.\r\n\r\nLocal Odesa lawmakers had also voted to remove and relocate a monument to an 18th-century Russian general, Alexander Suvorov."],
      "url": "https://www.euronews.com/2022/11/30/ukraine-war-blinken-condemns-barbaric-russian-strikes-new-director-at-zaporizhzhia-nuclear",
      "scraped_at": "2025-11-14T14:41:49.873006",
      "paragraph_count": 0
    },
    {
      "title": "How an energy crisis is testing Moldova's mettle to turn away from Russia",
      "content": ["Clockwise from top left: Evdochia, Victor, Galina and Constantin give their views on Moldova's energy crisis.\r\nCopyright Credit: Euronews\r\nBy Madalin Necsutu\r\nPublished on 08/11/2022 - 23:27 GMT+1 •Updated 09/11/2022 - 19:00 GMT+1\r\nShare\r\nComments\r\nMoldova has seen all its electricity supplies -- from Ukraine and Transnistria -- stop in recent weeks.\r\nDivisions are deepening in Moldova as an energy crisis engulfs the former Soviet country ahead of winter.\r\n\r\nIn the space of a just month, Chisinau has seen Russian gas imports cut in half and electricity from the pro-Russia breakaway region of Transnistria -- which supplied 70% of Moldova's needs -- stop completely. The other 30%, imported from war-hit Ukraine, has also been cut as Moscow bombs the country's energy infrastructure.\r\n\r\nHousehold energy tariffs have soared in the last year, with the price of electricity jumping by around 50% this month alone. It's pushed people to consume less and turn to alternative heating sources, such as firewood and coal.\r\n\r\nMoldovans are divided between those who don't want Russian \"energy blackmail\" to deviate the country from its pro-EU path and others who think Chisinau should make concessions and cosy up to Vladimir Putin in order to get more gas.\r\n\r\nWe don't know if we will have enough gas to get through the winter, but with faith, patience and national dignity, we will have enough.\r\n Galina \r\nConstantin, 60, a farmer from a village in the north of the country, was in Chisinau on Sunday (6 November) to attend a  protest organised by pro-Russian fugitive Ilan Shor against the government of Prime Minister Natalia Gavrilita.\r\n\r\nADVERTISEMENT\r\n\"I don't think Moldova has enough gas to get through this winter,\" he told Euronews. \"I think they should buy more from Russia. We used to live better with the Russians. It was different. In Europe, everything is expensive. Where can Europe get gas to give to Moldova?\"\r\n\r\nMoldova's pro-EU president Maia Sandu, added Constantin, \"had better reconcile with Putin, not turn his back on him\".\r\n\r\nAmid the crisis, Moldova has turned to its neighbour Romania for help, which has stepped in to cover 90% of the country's needs. \r\n\r\nI dread the thought of having to turn on the heat.\r\n Evdochia \r\nBut it's a lot more expensive: nearly double the price of electricity from Transnistria, which has not paid for the Russian gas it imports for 15 years, accumulating a historical debt of $9 billion to Russian energy giant Gazprom.\r\n\r\nThe energy crisis developed after Moldova became a candidate for EU membership -- alongside Ukraine -- in June.\r\n\r\nNatalia, a 36-year-old mother employed in the wine industry, is optimistic that her country will endure the current crisis and remain on its pro-EU path.\r\n\r\n\"We can overcome this crisis because our small republic has chosen the democratic way,\" she told Euronews. \r\n\r\n\"If we choose this path, we can also pay these prices for gas. This winter, the prices will be very high, but people understand and are on the right way.\r\n\r\n\"Our president Maia Sandu did not go to Moscow to ask for help, which means that we hope for EU's support because we are a small country.\"\r\n\r\nCredit: AP Photo\r\nPolice officers block a street during an anti-government protest in Chisinau, Moldova October 23, 2022 Credit: AP Photo\r\nThe European Bank for Reconstruction and Development lent Moldova €;300 million this summer to help with the crisis. Earlier this month, the US announced that it was offering Moldova around $50 million to reimburse electricity costs and \"reducing dependence [energy] towards Russia\".\r\n\r\nADVERTISEMENT\r\nMoldova has already stored more than 157 million cubic meters of gas in Romania and Ukraine, which would be enough to meet the country's needs for about a month and a half this winter. \r\n\r\nVictor, 64, present at last Sunday's protests, said this is not enough. \r\n\r\n\"Gas is cheaper in Russia, if the EU will give us gas, it has to go through several countries, including Romania, and that costs more. If Ukraine were not bombed, the gas would reach us more easily from Russia. Romania cannot help us. They can't give us gas at a low price, that's clear,\" he told Euronews.\r\n\r\nMoldovans are most scared of the upcoming gas bills, even though, just like last year, the government has paid generous compensation, especially for those on low incomes.\r\n\r\nRelated\r\nEnergy crisis: Winter could be very difficult for Moldova, its PM tells Euronews\r\nUkraine war: Moldova ships in one million iodine pills amid fears of nuclear disaster\r\nWhere is Transnistria and why does it matter?\r\n\"I dread the thought of having to turn on the heat. However, we don't know what will happen if we bear in the cold,\" Evdochia, a 63-year-old, told Euronews.\r\n\r\n\"I need heat, and we need to turn on the gas. I think that Russia will help us more in the winter. Those who voted for the current pro-European government are [the] diaspora. They are welcome there, and we are dying of hunger and cold here in Moldova.\"\r\n\r\nGalina, 55, an actress, disagrees and says if necessary, she will put on more clothes to get through this winter, where temperatures can hit as low as -15C.\r\n\r\n\"We don't know if we will have enough gas to get through the winter, but with faith, patience and national dignity, we will have enough. \r\n\r\n\"I will be in solidarity with my country, and I will be free,\" she told Euronews.\r\n\r\nShe admits that the current government lacks experience but believes the anti-governmental protesters are being manipulated.\r\n\r\nProtests are organised regularly by the party named after Moldovan oligarch Ilan Shor.\r\n\r\nADVERTISEMENT\r\nHis supporters held protests in Chisinau last month chanting against the government’s pro-EU policies and carrying banners with slogans such as “No to Cold War, no to cold winter.”\r\n\r\nThe US State Department said Shor was working with “corrupt oligarchs and Moscow-based entities to create political unrest in Moldova” and to undermine Chisinau’s efforts to become a member of the EU.\r\n\r\nSandu similarly accused “corrupt” political actors in Moldova of pushing for Russia's interests while the violence from the Kremlin's war in Ukraine spills into their country.\r\n\r\nOn Monday, a Russian missile landed in a Moldovan border city when Ukrainian forces shot it down. Residents of Naslavcea said they were shaken by the explosion, which caused damage but no casualties."],
      "url": "https://www.euronews.com/my-europe/2022/11/09/how-an-energy-crisis-is-testing-moldovas-mettle-to-turn-away-from-russia",
      "scraped_at": "2025-11-14T14:41:50.472332",
      "paragraph_count": 0
    },
    {
      "title": "Russia’s invasion of Ukraine spills over into Moldova",
      "content": ["Copyright Sergei Grits/Copyright 2022 The AP. All rights reserved\r\nBy Euronews\r\nPublished on 30/11/2022 - 9:51 GMT+1 •Updated 10:29\r\nShare\r\nComments\r\nA Russian missile which was shot down by Ukrainian air defences fell on a village in the North of Moldova on Monday, according to government reports.\r\nA Russian missile that was shot down by Ukrainian air defences fell on a village in the North of Moldova on Monday, according to government reports.\r\n\r\nThe country's interior ministry said the missile fell on Naslavcea, close to the Ukrainian border. 'So far there are no reported victims, but the windows of several houses in Naslavcea were destroyed,' it added.\r\n\r\nIt's the latest spillover of Russia's invasion of Ukraine to the former Soviet state and it's led to some citizens fearing what could come next.\r\n\r\nInca, an actress in the capital, Chișinău, said \"I was afraid to think about what I would feel if I lived where the missiles landed. And also, God forbid, what if a rocket would come into my house, near my child and my family.\"\r\n\r\nThree weeks ago, Moldova said that Russian cruise missiles targeting Ukraine had crossed its airspace and summoned Moscow's envoy to demand an explanation.\r\n\r\nADVERTISEMENT\r\nLike its neighbour, it was a former Soviet state, and is not part of the EU or the NATO military alliance. Moldova also has a small breakaway region, Transnistria, which hosts over 1,000 Russian ‘peacekeeping’ forces."],
      "url": "https://www.euronews.com/2022/11/01/russias-invasion-of-ukraine-spills-over-into-moldova",
      "scraped_at": "2025-11-14T14:41:50.990542",
      "paragraph_count": 0
    },
    {
      "title": "Energy crisis: Winter could be very difficult for Moldova, its PM tells Euronews",
      "content": ["Copyright Credit: Euronews Romania\r\nBy Euronews\r\nPublished on 16/09/2022 - 9:06 GMT+2\r\nShare\r\nComments\r\nMoldova was already one of Europe's poorest countries. But now, amid fears of Russian gas being cut and skyrocketing inflation, the situation is looking even worse.\r\nAmid skyrocketing inflation and fears that Russian gas could be cut off, Moldova is facing a tough winter, its prime minister has told Euronews Romania. \r\n\r\n\"Entire Europe is expecting a difficult winter but it is even more difficult for Moldova,\" said Natalia Gavrilita, who was elected to office last year. \"While many European countries still have a partial dependency on Russian gas, for Moldova this dependency is 100%. And there is a risk that the contract will be unilaterally stopped by Gazprom.\"\r\n\r\nMoldova was already one of Europe's poorest countries, even before the war in neighbouring Ukraine. Now the situation has dramatically worsened. \r\n\r\nThe cost of household items and energy prices have so, bringing hardship to many across the country. The inflation rate was 34% in August. \r\n\r\n\"Energy prices have gone up tremendously and they are absolutely unaffordable for Moldovan citizens and businesses,\" she added. \"So we have a dual objective: maintaining stability and maintaining peace in the country and ensuring we have energy resources that are affordable.\" \r\n\r\nADVERTISEMENT\r\nMoldova, like Ukraine, applied for EU membership in the days after Russia's invasion on 24 February. Brussels in June gave both countries candidate status, the first step on an often very long road to joining the 27-country bloc.\r\n\r\n\r\nIn addition to spiralling inflation and energy fears, Chișinău also has the problem of its separatist region, Transnistria.\r\n\r\nIn the early 1990s and amid Moldova's split from the remnants of the USSR, Transnistrian separatists backed by Russia waged an insurrection turned full-fledged war until a ceasefire was struck in 1992, which has held until this day."],
      "url": "https://www.euronews.com/2022/09/16/energy-crisis-winter-could-be-very-difficult-for-moldova-its-pm-tells-euronews",
      "scraped_at": "2025-11-14T14:41:51.508159",
      "paragraph_count": 0
    },
    {
      "title": "Ukraine war: Nuclear safety, Putin in Kaliningrad, and Russian tourist visas",
      "content": ["Copyright AP Photo/Emilio Morenatti\r\nBy Euronews with AP, AFP\r\nPublished on 01/09/2022 - 21:40 GMT+2 •Updated 02/09/2022 - 7:27 GMT+2\r\nShare\r\nComments\r\nHere's the latest developments you need to know from Ukraine and Russia.\r\n1. Zaporizhzhia nuclear power plant's integrity 'violated,' says UN inspection team chief\r\nThe head of the UN nuclear agency on Thursday said the \"physical integrity\" of a Russian-held Ukrainian nuclear plant had been \"violated\" following frequent shelling on his team's first visit to the facility.\r\n\r\nADVERTISEMENT\r\n\"It is obvious that the plant and physical integrity of the plant has been violated several times,\" IAEA head Rafael Grossi told reporters after returning to Ukrainian-controlled territory.\r\n\r\nA UN inspection team arrived at Ukraine's Zaporizhzhia nuclear power plant Thursday on a mission to safeguard it against catastrophe, reaching the site amid fighting between Russian and Ukrainian forces that prompted the shutdown of one reactor and underscored the urgency of the task.\r\n\r\nThe visit from the 14-member expert delegation from the International Atomic Energy Agency came after months of negotiations to pass through the front lines and get inside Europe's biggest nuclear plant. Arriving in a convoy of SUVs and vans, the inspectors were led by IAEA director Rafael Grossi.\r\n\r\nEarlier in the day, Grossi reported that the group had collected important information on its first tour at the plant and a part of the mission would continue its assessment \"until Sunday or Monday\" to continue the assessment, without specifying their number.\r\n\r\n\"My team is staying on, and more importantly ... we are establishing a continued presence by the IAEA here,'' he said in a video on Twitter, the plant visible behind him.\r\n\r\nAs the experts made their way through the war zone toward the complex, Russia and Ukraine accused each other of shelling the area and trying to derail the visit. The heavy shelling delayed the team's progress toward the plant.\r\n\r\nADVERTISEMENT\r\nEnergoatom, Ukraine's state nuclear power company, said Russian mortar shelling had led to the shutdown of one of its reactors by its emergency protection system and had damaged a backup power supply line used for in-house needs. One of the plant’s reactors that wasn’t operating was switched to diesel generators, Energoatom said.\r\n\r\n“There has been increased military activity, including this morning until very recently,\" Grossi said during the journey, adding that after being briefed by the Ukrainian military he decided to keep moving despite the risks. \"Weighing the pros and cons and having come so far, we are not stopping.”\r\n\r\nThe Zaporizhzhia plant has been occupied by Russian forces but run by Ukrainian engineers since the early days of the 6-month-old war. Ukraine alleges Russia is using it as a shield to launch attacks, while Moscow accuses Ukraine of recklessly firing on the area.\r\n\r\n2. Sergei Lavrov warns Moldova over Russian peacekeepers\r\nRussia's foreign minister warned Thursday that any actions seen as endangering a Russian peacekeeping contingent in a separatist region of Moldova would be considered as an attack on Russia itself.\r\n\r\nSergey Lavrov's statement in an address at Russia's top foreign affairs school underlined concerns that Moldova's Transnistria region, which borders Ukraine, could be drawn into the Russia-Ukraine conflict.\r\n\r\nRussia has stationed peacekeepers there since the 1992 end of a three-month war that left Transnistria outside Moldovan control. Russian forces also guard a large ammunition dump in the region.\r\n\r\nRelated\r\nTransnistria separatists set their eyes on possible Russian unification\r\nUkraine war: Fears grow that Russia will target former Soviet state of Moldova next\r\nIn April, tensions in Moldova soared after a series of explosions in Transnistria.\r\n\r\n“Everyone should understand that any kind of actions that will raise a threat to the security of our servicemen will be considered in accordance with international law as an attack on the Russian Federation,” Lavrov said.\r\n\r\nADVERTISEMENT\r\nAfter Lavrov's comments, Moldova's foreign ministry summoned Russia's charge d'affaires for “clarification.”\r\n\r\n“We remind the Russian side that the legislation of the Republic of Moldova guarantees fundamental human rights and freedoms,” the ministry said.\r\n\r\nRodrigo Abd / Associated Press\r\nFILE - Soldiers walk amid destroyed Russian tanks in Bucha, in the outskirts of Kyiv, Ukraine, April 3, 2022. Rodrigo Abd / Associated Press\r\n3. Russian military facing 'severe manpower shortages', says US\r\nRussia is suffering “severe manpower shortages” in its 6-month-old war with Ukraine and has become more desperate in its efforts to find new troops to send to the front lines, according to a new American intelligence finding disclosed this week.\r\n\r\nRussia is looking to address the shortage of troops in part by compelling soldiers wounded earlier in the war to return to combat, recruiting personnel from private security companies and even recruiting from prisons, according to a US official who spoke on the condition of anonymity to discuss the downgraded intelligence finding.\r\n\r\nThe official added that the intelligence community has determined that one step that Russia’s Defense Ministry is expected to take soon is recruiting convicted criminals to enlist “in exchange for pardons and financial compensation.”\r\n\r\nThe US government highlighted its finding as Russian President Vladimir Putin last week ordered the Russian military to increase the number of troops by 137,000 to a total of 1.15 million.\r\n\r\nPutin’s decree, which takes effect on 1 January 2023, didn’t specify whether the military would beef up its ranks by drafting a bigger number of conscripts, increasing the number of volunteer soldiers or using a combination of both. \r\n\r\nBut some Russian military analysts predicted it would rely heavily on volunteers, a cautious stand reflecting the Kremlin’s concerns about possible fallout from an attempt to increase the draft.\r\n\r\n4. Vladimir Putin visits Kaliningrad\r\nRussian President Vladimir Putin visited the Russian exclave of Kaliningrad on Thursday, wedged between NATO member countries and at the heart of tensions between Moscow and Western countries over the conflict in Ukraine .\r\n\r\nPutin began his visit to Kaliningrad by meeting students returning to school, answering their questions on subjects as varied as the economy, aerospace and Moscow's offensive in Ukraine, in images broadcast live on Russian television. \r\n\r\nADVERTISEMENT\r\n\"Our mission and that of our soldiers (...) is to stop this war that Kyiv is waging in Donbas, to protect people and, of course, to defend Russia itself,“ he said. \r\n\r\nThe Russian president also affirmed that the inhabitants of Donbas, a region where many Russian speakers live, \"consider that they are part of the space (...) cultural and linguistic\" Russian.\r\n\r\nPutin's trip to Kaliningrad comes against the backdrop of tensions around enforcing international sanctions against the exclave, which is not physically connected to Russia but instead borders Poland and Lithuania. \r\n\r\nIn June, Lithuania stopped allowing transit through its territory of certain goods bound for Kaliningrad. However, after protests and threats from Moscow, the EU ended up asking Vilnius to authorise the transit by rail of Russian goods, excluding military equipment.\r\n\r\nMoscow announced last month that it was deploying state-of-the-art hypersonic missiles in Kaliningrad.\r\n\r\nPetr David Josek / Associated Press\r\nFILE - Finland's Foreign Minister Pekka Haavisto in Prague, 31 August 2022 Petr David Josek / Associated Press\r\n5. Finland drastically cuts tourist visas for Russians\r\nFinland on Thursday slashed the number of visas issued to Russian citizens to a tenth of the regular amount in a move seen as a show of solidarity with Ukraine.\r\n\r\nFinland, which shares the longest border with Russia of all European Union member countries, announced the decision in August amid growing pressure from politicians and ordinary citizens to restrict the movement of Russian tourists through the Nordic country as Moscow continues its war in Ukraine.\r\n\r\n“It’s important that we show that at the same time when Ukrainians are suffering, normal tourism shouldn’t continue business as usual,” Finnish Foreign Minister Pekka Haavisto said during a European Union foreign ministers meeting in the Czech capital Prague on Wednesday.\r\n\r\nStarting Thursday, Finland will only permit Russians to apply for tourist visas once a week and in just four Russian cities: Moscow, St Petersburg, Murmansk, and Petrozavodsk close to the Finnish border.\r\n\r\nHaavisto said he was particularly worried about a kind of Russian “tourist route” through Helsinki airport which has been used by thousands of Russians before Moscow’s Feb. 24 attack on Ukraine. Russians are now crossing into Finland before flying to other European nations as a way of circumventing flight bans imposed after the invasion.\r\n\r\nOn top of its visa decision, the Finnish Foreign Ministry said the government is currently exploring the possibility of helping Russian human rights defenders, civil society members and journalists critical to the Kremlin by establishing a new kind of humanitarian visa enabling them to access the Nordic country.\r\n\r\nRelated\r\nEU foreign ministers agree to scrap Russia visa deal but stop short of full tourist ban\r\nGermany and France join forces against growing calls for EU visa ban for Russians\r\nHow a sanctions loophole is letting Russians enter the EU\r\nAt this week’s Prague meeting, EU foreign ministers decided to tighten travel rules for Russians within the 27-member bloc but found no consensus to issue a full-scale tourist visa ban, something that has been urged by Poland and the Baltic countries of Estonia, Latvia and Lithuania.\r\n\r\nADVERTISEMENT\r\nMoscow on Thursday described the EU’s decision to scrap a simplified visa regime for Russian tourists as absurd and bad news for Russian citizens. Kremlin spokesman Dmitry Peskov said Russia was considering options to respond to the move.\r\n\r\n“It is a new ridiculous decision in a series of ongoing absurdities,\" Peskov said in a conference call with reporters, as quoted by news outlets.\r\n\r\nFinland shares a 1,340-kilometre border with Russia and the country has regularly ranked among one of the most popular Western travel destinations or stopovers."],
      "url": "https://www.euronews.com/2022/09/01/ukraine-war-nuclear-safety-putin-in-kaliningrad-and-russian-tourist-visas",
      "scraped_at": "2025-11-14T14:41:52.021650",
      "paragraph_count": 0
    },
    {
      "title": "Ukraine war: How has Russia's invasion changed Europe?",
      "content": ["A statue of a hand with finger nails painted in Ukraine's national colors was placed in front of the Russian embassy in Prague, Czech Republic, Wednesday, Aug. 24, 2022\r\nCopyright Credit: AP\r\nBy David Mac Dougall, Andrea Carlo, Joshua Askew, Verena Schad, David Hutt, Madalin Necsutu, Nenad Jaćimović, Vincent Coste\r\nPublished on 23/08/2022 - 21:32 GMT+2 •Updated 30/11/2022 - 12:01 GMT+1\r\nShare\r\nComments\r\nRead our A-Z country guide that charts how six months of war in Ukraine has changed Europe, sometimes forever.\r\nRussia's war has brought death, destruction and misery to Ukraine over the last nine months. But how has the conflict changed the rest of Europe?\r\n\r\nAustria: Keeping faith with neutrality\r\nThe war sparked calls for a debate about Austria’s decades-old faith in neutrality.\r\n\r\nThe policy, which dates back to 1955 when the country was occupied by Allied forces, means Austria is not part of the NATO military alliance. \r\n\r\nNevertheless, in the aftermath of Russia's invasion, some called for a rethink.\r\n\r\n“A critical debate about the pros and cons of neutrality is necessary, even though the vast majority of the population supports the almost mythical neutrality,” said Alfred Gerstl of the University of Vienna.\r\n\r\nADVERTISEMENT\r\nChancellor Karl Nehammer has “clearly articulated his wish to not debate this sensitive issue right now,” added Gerstl.\r\n\r\nThe idea that neutrality must not be discussed is also supported by public opinion, according to a survey.\r\n\r\nTo underscore this neutral stance, Nehammer, in mid-April, became the first European leader to visit Russian President Vladimir Putin for face-to-face talks since the start of the war.\r\n\r\n[Words: David Hutt and Verena Schad]\r\n\r\nBelgium: Delaying its nuclear power phase-out\r\nBelgium delayed its shutdown of nuclear power plants in anticipation of Russia reducing its energy supplies to Europe.\r\n\r\nThe country, which currently has seven reactors, had been intending to phase out its reliance on nuclear power by 2025. \r\n\r\nBut rising gas prices and question marks over Russian supplies to Europe caused a change of heart.\r\n\r\nBelgium says it will now delay the phase-out of nuclear power by 10 years, until 2035.\r\n\r\n[Words: Andrea Carlo]\r\n\r\nBulgaria: War sours relations with Russia\r\nThe war in Ukraine saw relations between Moscow and Bulgaria, a former Soviet ally during the communist era, deteriorate rapidly. \r\n\r\nNot only did the pro-western coalition government of Kiril Petkov back EU sanctions against Russia, but it also refused a Moscow demand to pay for imported Russian gas in roubles. \r\n\r\nThat saw Gazprom halt gas supplies to the country, which was almost totally reliant on imported Russian energy. \r\n\r\nADVERTISEMENT\r\nIn July, Petkov and his Greek counterpart opened a new gas pipeline between the two countries, pumping in energy from Azerbaijan.\r\n\r\nA few weeks earlier, Petkov's government fell after the Ukraine war -- among other issues -- exposed divisions within the ruling coalition.\r\n\r\nBulgaria had its fourth general election in fewer than two years in October, but a viable coalition government has yet to emerge.\r\n\r\nThe war has also accentuated divisions within Bulgarian society, driven by a large prevalence of misinformation about what is happening in Ukraine.  \r\n\r\nIn May, a Gallup International Balkan survey revealed that nearly a quarter of respondents (23.3%) supported Vladimir Putin's war in Ukraine. \r\n\r\nThe same poll showed that 58.8% disapprove of Russia's invasion.\r\n\r\n[Words: Euronews Bulgaria]\r\n\r\nCredit: Valentina Petrova/AP\r\nA protester holds a poster depicting Vladimir Putin along with the words \"Killer\" during a protest rally in downtown Sofia in front of Bulgarian Presidency building. Credit: Valentina Petrova/AP\r\nCzech Republic: Key Kyiv ally that has welcomed Ukrainian refugees\r\nBy David Hutt\r\n\r\nMore than 413,000 refugees have been registered in the Czech Republic, according to the United Nations High Commissioner for Refugees (UNHCR). \r\n\r\nThat’s around 4% of the country’s 10.7 million population. By comparison, the 1.3 million-odd Ukrainian refugees registered in Poland account for 3.3% of its population.\r\n\r\nAccording to a survey published in March, 85% of Czech respondents backed their government in opening their doors to Ukrainian refugees.\r\n\r\nAnother poll last month found that 75% were in favour of taking in Ukrainians. \r\n\r\nIt is thought there is sympathy for being on the bitter end of a Russian attack. On August 21, 1968, as Czechoslovak protestors took to the streets to demand a more liberal form of leadership from their communist regime, Soviet tanks rolled in to put down the \"Prague Spring\". Naturally, Czechs -- and Slovaks -- have sympathy for what they see as further victims of Russian aggression. \r\n\r\nADVERTISEMENT\r\nThe acceptance of Ukrainian migrants has been eased by the country’s typically low unemployment rate (around 3.3% in July), said Lubomír Kopeček, a political science professor at Masaryk University.\r\n\r\nThe Czech Ministry of Labor and Social Affairs tweeted in mid-August that around 101,000 of the refugees have now found work.\r\n\r\nRussia's war in Ukraine has also reinforced Prague's recent pivot to the West, such as NATO, the European Union and Washington. \r\n\r\nIt has been one of the more vocal and active defenders of Ukraine within Europe.\r\n\r\n“The strong pro-Ukrainian stance they have taken is credible and chimes with a substantial chunk of public opinion in the Czech Republic,” said Sean Hanley, an associate professor in Central and Eastern European politics at University College London.\r\n\r\nDenmark: War sparks historic change\r\nBy Andrea Carlo\r\n\r\nWhile Sweden and Finland have grabbed the headlines by announcing they want to join NATO in response to the war in Ukraine, Denmark also made a historic decision. \r\n\r\nWhile a founding member of NATO, Copenhagen has had a long-time opt-out of getting involved in the EU's defence policies. \r\n\r\nHowever, that will now all change, after a referendum in June in which 66.9% of Danes backed aligning Denmark with Brussels. \r\n\r\n\"Tonight Denmark has sent a very important signal,\" said Denmark's Prime Minister Mette Frederiksen shortly after the result was announced. \r\n\r\n\"To our allies in Europe and NATO, and to (Russian President Vladimir) Putin. We're showing that when Putin invades a free country and threatens stability in Europe, we others pull together.\r\n\r\n\"Denmark now can partake in the European cooperation on defence and security. And for that, I'm very, very happy.\"\r\n\r\nCredit: AP Photo\r\nPolice officers stand next to a trailer transporting a Soviet T-34 tank which was installed as a monument in Narva, arrived to a military museum in Tallinn, Estonia, Tuesday, Credit: AP Photo\r\nEstonia: Support for Ukraine sky-high... like its inflation\r\nBy Josh Askew\r\n\r\nADVERTISEMENT\r\nEstonia is Europe's inflation hotspot - its annual rate hit 23.2% earlier this month.\r\n\r\nBut soaring prices -- driven by rising energy costs due to the war -- have done little to change Estonia's position as one of the continent's leading voices of support for Ukraine.\r\n\r\nTallinn has given €250 million in military assistance to Ukraine - a third of the country’s yearly defence budget.\r\n\r\nEstonia, formerly part of the Soviet Union, has taken in 50,000 Ukrainian refugees (equivalent to 4% of its population), called for more robust sanctions on Russia and recently banned Russians from entering the country.\r\n\r\nIt has also begun removing Soviet-era monuments from public spaces across the country.\r\n\r\nTallinn has committed to stopping Russian gas imports and, to compensate, is building a floating LNG terminal in Paldiski. \r\n\r\nFrance: Striving to improve its energy independence\r\nBy Vincent Coste\r\n\r\nAs in many European countries, the energy squeeze as a result of Russia's invasion of Ukraine is having a direct impact on daily life. \r\n\r\nFrance is much less dependent on Russia for its gas supply -- it imported 17% of its gas needs from Russia in 2020 -- but rising energy costs, including for petrol and electricity, helped push inflation to 6.1% in July, according to the French statistics institute. \r\n\r\nIn response, Paris has introduced various measures to help households, such as a \"fuel discount\". This help, currently €0.18 per litre, will be increased to €0.30 per litre in September and October. It will be maintained until December when it will fall to €0.10.\r\n\r\nThe government has also maintained its \"tariff shield\" to limit the rise in electricity bills to 4% and to freeze gas prices at their October 2021 level. The scheme will be extended until the end of 2022. In addition, €230 million have been earmarked for low-income households that use oil for heating.\r\n\r\nFinally, the government will renationalise EDF, the country's largest electricity company. It aims to protect France's energy independence, which has been undermined by the war in Ukraine. \r\n\r\nThis energy independence has been further undermined by issues with France's nuclear power plants, which meant in the past the country has been a net exporter of electricity. But issues like corrosion meant that as of June, 27 of 56 reactors were closed. Paris has now committed to renewing its nuclear power plants. \r\n\r\n\r\nFinland and Sweden: How the war in Ukraine saw neutrality tossed aside\r\nBy David Mac Dougall\r\n\r\nADVERTISEMENT\r\nAt the start of 2022, few people would have bet cold hard cash that by autumn both Finland and Sweden would have applied for NATO membership and be coming close to the end of their accession process.\r\n\r\nIn Sweden, the ruling Social Democrats had a strong tradition of neutrality baked into their DNA, and there was no particular interest among the voting public for membership; while in Finland only one big political party had been strongly pro-NATO and the public interest in joining had languished below 30% for decades (even if the diplomatic, military and security policy establishment were champing at the bit to join at the first possible opportunity!)\r\n\r\nAll that changed with Russia's invasion of Ukraine. Fast forward six months and the two Nordic nations, which had been closely aligned with NATO anyway - are now conducting regular military operations with NATO forces on their territory and in the skies, and will soon be covered by NATO's Article V on collective defence against any future Russian aggression.\r\n\r\n\r\nWhile Russia has said there would be unspecified \"consequences\" for NATO membership, their sabre rattling has so far amounted to nothing.\r\n\r\n\"Finns are now more security-oriented,\" said Krista Mikkonen, Finland's acting interior minister.\r\n\r\n\"We have always paid attention to the safety of our society and we are in fact one of the safest countries in the world. However, Russia's attack on Ukraine has brought security into the public debate in Finland stronger than before. Finns have been sad and shocked by the attack and want to strengthen our own security as well,\" she told Euronews.\r\n\r\nIn Finland, in particular, a country which shares the EU's longest border with Russia, there has been a reluctant acceptance that while successive governments and presidents tried hard to keep open channels of communication with the Kremlin, and established strong relations on issues from maritime safety to cultural exchanges, none of it was enough to be able to trust the Russians when it comes to security.\r\n\r\n\"Security is much more than just weapons. It also includes cherishing our democratic values,\" said Mikkonen.\r\n\r\nADVERTISEMENT\r\n\"In many areas in Finland interaction across the eastern border has been active and grassroots level connections strong. Now there is a lot of confusion and uncertainty about whether there will be any return to this in the future.\"\r\n\r\nCredit: AP\r\nFinnish Prime Minister Sanna Marin attends a press conference with Swedish Prime Minister Magdalena Andersson earlier in 2022 as they announce a debate on whether to join NATO Credit: AP\r\nGermany: Will rising energy costs strain solidarity with Ukraine?\r\nBy Verena Schad\r\n\r\nNo other large country in the European Union has become as dependent on Russian energy as Germany.\r\n\r\nSo the prospect of Gazprom limiting gas supplies in the coming months is causing anxiety. \r\n\r\nIndeed amid the recent heatwave, Germans rushed to buy electric fan heaters to prepare for a possible energy crisis this winter.\r\n\r\nThe government, meanwhile, is enforcing energy savings in the public sector to fill up the gas storage tanks before winter, as well as a gas levy of 2.4 cents per kilowatt hour, on top of the already drastically increased gas tariff. So it can get really expensive for Germans, a household of four can expect to pay around €500 more per year, not including VAT.\r\n\r\nThese extra costs could possibly strain solidarity for Ukraine in the long run. Critics and conspiracy theorists have already taken up positions to once again agitate against the state. Images of a \"winter of rage\" with unprecedented popular uprisings are being painted, especially on social media.\r\n\r\nBut Professor Uwe Demele, from the Eberswalde University of Applied Sciences, said such a doomsday scenario was wide of the mark.\r\n\r\n\"Losses such as a high gas price will probably be accepted as long as they don't threaten their existence,\" he told Euronews. \r\n\r\nAway from the energy prices, another big topic in Germany is the supply of arms to Ukraine. \r\n\r\nChancellor Olaf Scholz was criticised throughout Europe for his hesitation in sending heavy weapons to help Kyiv. \r\n\r\nThe war also saw Germany commit to spending €100bn on modernising its army, a big deal in a country where pacifist sentiment is strong in light of Nazi atrocities during World War II. \r\n\r\nHungary: Did the war help Orban secure a fourth term?\r\nBy Josh Askew\r\n\r\nIn April, a little more than a month after Russia's invasion, Viktor Orbán’s ruling Fidesz party won a record, fourth consecutive election.\r\n\r\nOne of Orbán’s main claims in the run-up to the vote was that he alone would keep Hungary out of the war, while the opposition would drag the former communist country into a bloody protracted conflict with Russia.\r\n\r\nADVERTISEMENT\r\n“The war in Ukraine provided Prime Minister Orbán with a much-appreciated opportunity to step up as the leader who protects the nation from a looming war,” Dalma Dojcsak, senior strategy expert at the Hungarian Civil Liberties Union, told Euronews. “This image helped him to get his fourth consecutive election victory.”\r\n\r\nCiting the state of emergency caused by the Ukraine war, Orbán signed off on a special legal order in May, which allowed the government to suspend certain acts of parliament and rule by decree.\r\n\r\nAccording to Dojcsak, this legislation enables the “government to practically rule and decide about any issue without any effective oversight”, with parliamentary approval no longer needed.\r\n\r\n“The extraordinary legal order has been and still is a tool for the government to secure its own goals and not to protect the people of Hungary,” she added.\r\n\r\nHungarian officials have said the law is necessary to speed up decision-making and protect peace and security amid an unprecedented crisis sparked by the war.\r\n\r\nUnder Orbán, Hungary has pursued a policy of what it calls strict neutrality towards Ukraine, which some pundits have said is pro-Russian.\r\n\r\nThough the Hungarian leader called for a ceasefire in Ukraine, he has also refused to allow weapons transfers across the Hungary-Ukraine border, mocked Volodymyr Zelenskyy and lobbied against EU sanctions on Russia.\r\n\r\n“The Hungarian government, alone among EU countries, is … trying to please Putin,” Hungarian MEP Anna Donáth told Euronews. \r\n\r\nShe claims Hungary is motivated by a desire for “**cheap Russian gas**”.\r\n\r\n\"In a neighbouring country, there is a war – the end of which no one can yet see,\" the Hungarian government told Euronews in an emailed statement. \"This war presents an ongoing threat to Hungary, putting our physical security at risk and endangering the energy supply and financial security of families and the economy as a whole. \r\n\r\n\"The world stands on the brink of an economic crisis. Hungary must stay out of this war and must protect the financial security of families. For this, the government needs room for manoeuvre and the ability to take immediate action.\"\r\n\r\nCredit: AP\r\nViktor Orban, left, with Vladimir Putin in 2017 Credit: AP\r\nItaly: Will the election change the country's support for Ukraine?\r\nBy Andrea Carlo\r\n\r\nItaly has joined Europe in giving its backing to Ukraine. Italians have welcomed Ukrainians into their country and their homes -- approximately 160,000, the second highest number in Western Europe after Germany -- and the national government is thought to have provided Kyiv with more than €150 million of heavy weaponry.\r\n\r\nNevertheless, there are signs that the country’s support for Ukraine may be beginning to waver, as inflation, rising energy prices and an overall sense of war fatigue starts to kick in for a significant portion of the Italian public.\r\n\r\nTo begin with, Italy’s relationship with Russia over the past few decades has been complex. Under controversial former prime minister Silvio Berlusconi’s tenure in the 2000s, Moscow-Rome relations warmed up, and the country has ended up receiving approximately 40% of its energy imports from Russia.\r\n\r\nWhile all leading Italian political parties denounced Vladimir Putin and his invasion of Ukraine, pro-Russian sympathies have proliferated among several parties, especially on the right. In 2015, populist Northern League leader Matteo Salvini opposed sanctions against Russia over its invasion of Crimea.\r\n\r\nADVERTISEMENT\r\nFollowing the invasion of Ukraine, several prominent pundits expressed attitudes that have been characterised as being “soft” or even apologetic of Russia. An example comes from Professor Alessandro Orsini, who thought that the west should allow Russia to win the war to avoid a potential nuclear catastrophe.\r\n\r\nThe Italian general public was also broadly critical of any kind of NATO interventionism in Ukraine -- roughly 83% -- and were divided over the provision of arms to the invaded country. \r\n\r\nBack in March, a group of workers at Pisa’s Galileo Galilei airport tried to block an aeroplane loaded with arms headed to Ukraine. \r\n\r\nAs of June, roughly half of Italians oppose sending arms to Ukraine.\r\n\r\nWith the upcoming snap elections -- which came after the collapse of Mario Draghi’s technocratic coalition government that supported the EU line on the war -- likely to usher in a right-wing government headed by nationalist Giorgia Meloni, certain analysts wonder whether the country could see a change of direction in its attitude towards Russia.\r\n\r\nLithuania: 'You can see Ukrainian flags on every corner'\r\nBy David Mac Dougall\r\n\r\nThe Kremlin's aggression in Ukraine didn't come as much of a surprise to Lithuania, the Baltic state which shares a border with Russia through its exclave in Kaliningrad. Politicians in the capital Vilnius have been raising the alarm within the EU for years.\r\n\r\n\"Lithuania was always among those who tried to call attention to what was happening in Russia. It didn't start yesterday or on 24th February,\" said Linas Linkevičius, Lithuania's former foreign minister, and former defence minister. The problems began, he told Euronews, when Russia instigated a war in the South Caucus region.\r\n\r\n\"When Russia annexed Crimea in 2014, it was not a surprise for us,\" he stated.\r\n\r\nLinkevičius said that life in Lithuania goes on life goes on as usual, but people are not as relaxed as before - although \"empathy and support for the people of Ukraine is very high. You can see Ukrainian flags on every corner\".\r\n\r\nLithuanians have also found a novel, practical way to support the war effort by raising millions of euros to buy a Bayraktar drone to send to the Ukrainian military.\r\n\r\nOne particular area of concern however is Lithuania's long border with Belarus, which Linkevičius said is \"losing sovereignty before our eyes.\"\r\n\r\n\"It's 30km from our capital to the border, and the border is 280km long. It's the EU's external border with a country that is not independent, but which is a training field for Russia for a long time, and a platform for launching attacks against Ukraine.\" \r\n\r\nMoldova: Bidding for EU membership and fearing it will be next\r\nby Madalin Necsutu\r\n\r\nJust a week after Russia invaded Ukraine, Moldova formally applied to join the EU, hastening its planned pro-Western course in light of events.\r\n\r\nBrussels later made Moldova a candidate for EU membership, the first milestone on a long road to joining the 27-member bloc.\r\n\r\nBut it wasn't just the country's strategic direction that changed with Russia's invasion of Ukraine. \r\n\r\n\"The war in Ukraine has had a devastating impact on the Moldovan economy,\" Igor Munteanu, political analyst and former Moldovan ambassador in Washington, told Euronews. \r\n\r\n\"Due to this war, the price of energy, various products and access to basic services skyrocketed.\"\r\n\r\nInflation in Moldova rose from 18.52% in February to 33.55% this month, hitting pockets hard in what was already Europe's poorest state. \r\n\r\nIt's being driven by higher gas prices. \r\n\r\nThe country is heavily reliant on supplies from Russia and prices have soared by 47% in August, sparking ex-president Igor Dodon to call for snap elections.\r\n\r\nOn top of this, Moldova -- like other countries neighbouring Ukraine -- saw an influx of refugees following the outbreak of the war. More than half a million Ukrainians have crossed the border, with around 70,000 still living in the country. \r\n\r\nMoldova's prime minister, Natalia Gavrilita, said earlier this year that “coping with this influx is one of the biggest challenges any Moldovan government has faced over the last three decades”.\r\n\r\nAlso with the war close to its border, Moldova, formerly part of the Soviet Union, feared it is next in Moscow's crosshairs.\r\n\r\nCredit: Euronews\r\nMoldova is close to the fighting in south-east Ukraine Credit: Euronews\r\nBut it's not just its proximity to Ukraine that is driving this anxiety.\r\n\r\nFor more than 30 years, Moldova has had about 1,500 to 2,000 Russian soldiers on its territory following a war in the breakaway region of Transnistria, which proclaimed itself a separate Soviet republic amid expectations that Chisinau might declare its independence in 1990.\r\n\r\nAmid the 1991 coup d’état attempt in Moscow and Moldova’s split from the remnants of the USSR, Transnistrian separatists backed by Russia waged an insurrection-turned-full-fledged war until a ceasefire was struck in 1992, which has held until this day.\r\n\r\nThe cessation of hostilities came with an arrangement to host Russian “peacekeepers” in the strip of land sandwiched between Moldova and Ukraine.\r\n\r\nPoland: ‘I told you so’\r\nBy Josh Askew, Michal Kranz and Andrea Carlo\r\n\r\nPoland, which borders Ukraine, was on the frontline of the initial refugee exodus. As of August, 1.3 million Ukrainians have fled over to their neighbour, according to the UN's refugee agency.\r\n\r\nWhile much of the focus was initially on the situation at the Ukrainian-Polish border, large Ukrainian populations have now settled in towns and cities across Poland.\r\n\r\nThere was a huge, unprecedented mobilisation to help the refugees, with public and private initiatives providing food, medical aid and housing to the new arrivals.\r\n\r\nStill, there has been some kickback. Faced with a mounting cost of living crisis and immense pressure on local resources, a minority of Poles have complained that the government is favouring Ukrainians over its own people.\r\n\r\nA survey by the Market and Social Research Institute showed that 90% of Poles questioned supported Ukrainian refugees, with the two neighbouring Slavic states sharing linguistic and cultural affinities.\r\n\r\nThe long-term impact of this refugee influx on Poland remains to be seen.\r\n\r\n“Whether [it] has a lasting, long-term impact depends on the course of the war and how many of these refugees decide to settle in Poland or return home,” said Prof Aleks Szczerbiak, a Polish politics expert at the University of Sussex.\r\n\r\nPoland has also seen its regional standing soar.\r\n\r\nThe Ukraine war “provided Warsaw with an opportunity to raise its diplomatic and military profile as a key regional player,” said Prof Szczerbiak.\r\n\r\n“Its critical geographical location, together with the fact that it is NATO’s largest defence spender in the region, means that Poland has become pivotal to the alliance’s security relationship with Moscow.”\r\n\r\nCredit: AP\r\nA family which fled from the war in Ukraine reunite after crossing the border in Medyka, Poland, Wednesday, March 2, 2022 Credit: AP\r\nRomania: Queuing to help Ukrainian refugees\r\nBy Euronews Romania\r\n\r\nRomania -- much like Poland, Ukraine's neighbour to the north-west -- has extended its helping hand to fleeing refugees.\r\n\r\nIn the early days of Russia's invasion, there were queues at either side of the Siret border crossing: Ukrainians trying to get out of their country and into Romania and Romanians heading to the frontier to make offers of help to their neighbours.\r\n\r\nMore than two million Ukrainians have crossed into Romania; 87,000 Ukrainians have chosen to stay, 39,000 of them children, say authorities.\r\n\r\nThousands of Romanian volunteers have helped refugees with free food, shelter and transport, some also found them jobs.\r\n\r\nThe authorities, meanwhile, allowed them to have free healthcare and schooling for their children.\r\n\r\nBeyond Romania's humanitarian response, the country has also seen an impact in terms of security. In the build-up to the war, NATO strengthened its eastern flank by sending 1,000 troops to a base on Romania's Black Sea coast.\r\n\r\nThat has since swelled to 5,500 troops, including 4,000 US soldiers and 800 from France. \r\n\r\nSerbia: Stuck between a rock and a hard place?\r\nby Nenad Jaćimović, Euronews Serbia\r\n\r\nRussia's war in Ukraine has put pressure on Belgrade's strategy of having good relations with Moscow and Beijing while at the same time pursuing European Union membership.\r\n\r\nSerbia is one of a handful of countries in Europe — such as Bosnia and Belarus — refusing to join Western sanctions against Russia, although it has backed UN General Assembly resolutions condemning the invasion.\r\n\r\nSenior EU diplomats, European leaders and MEPs have all urged Belgrade to back the sanctions.\r\n\r\nBut there has also been pressure from Moscow playing on the pro-Russian and anti-NATO sentiment among the Serbian population. A survey in March found only 21% of respondents believed Serbia should side with Russia over the war; a poll in April found 76% opposing putting sanctions on Moscow over its invasion of Ukraine. \r\n\r\nGood relations with Moscow have allowed Serbia — which is 100% dependable on Russian gas — to secure supplies on favourable terms.\r\n\r\nBelgrade says this will ensure safe supply during the winter months and ease economic pressure in a country where inflation reached 12.6% in July.\r\n\r\nVuk Vuksanović, from the Belgrade Centre for Security Policy, believes pressure on Belgrade has eased a little.\r\n\r\n“Whether these pressures will return, it largely depends on whether the West will notice some worrying trends related to the presence of the Russian factor in Serbia, but it can also depend a lot on Russia, because the latter sometimes also uses certain forms of pressure on Vučić and his government to warn him not to try to get too close to the West,” Vuksanović told Euronews Serbia.\r\n\r\nVuksanović said keeping good relations with Russia has had a very bad impact on relations with neighbours in the region.\r\n\r\nThis includes Kosovo, a former province of Serbia that declared independence in 2008 but which Belgrade has been refusing to recognise since.\r\n\r\nIts Prime Minister Albin Kurti called Serbia's President Aleksandar Vučić \"little Putin” in the past and recently claimed Belgrade, backed by Russia, will attack Kosovo.\r\n\r\nVučić has repeatedly dismissed these allegations. In a recent interview with the New York Times, he said: “Kurti wants to be a 'little Zelenskyy' fighting 'little Putin'. This is his narrative — that Vučić is a terrible nationalist who wants to fight against everybody.”\r\n\r\n“It is not true at all,” added Vucic. \r\n\r\nSlovakia: War sparks crackdown on disinformation\r\nBy David Hutt\r\n\r\nSlovakia, which shares a border with Ukraine, has been a key supporter of Kyiv since Russia's invasion in late February. \r\n\r\nBratislava has already donated an air defence system to Ukraine and there is a debate raging in the country about whether it should sell its fleet of fighter jets to Kyiv.  \r\n\r\nJaroslav Nad', Slovakia's defence minister, wants to hand over the country's MIG-29s in the autumn for €300 million. \r\n\r\nA recent survey in Slovakia showed just half of the respondents thought that was a good idea.\r\n\r\nNad' put the low approval for this policy down to the success of Russian propaganda.\r\n\r\nEarlier in the war, Slovakia's coalition government passed a law that allows the authorities to block disinformation websites temporarily.\r\n\r\nBut the crackdown isn’t widespread. Pro-Russian politicians still publicly accuse NATO of being responsible for the war. Conspiracy theories still circulate. Public opinion hasn’t snapped too hard against Putin.\r\n\r\nSlovenia: One of the first to show Ukraine support\r\nSlovenia's then-prime minister Janez Jansa was at the forefront of European efforts to show support to Ukraine.\r\n\r\nAlongside his counterparts from Poland and the Czech Republic, he was among the first foreign leaders to visit Kyiv after Russia's invasion. He met with Ukraine president Volodymyr Zelenskyy and received praise for taking the risk of visiting a European capital during wartime.  \r\n\r\nSpeaking to Euronews' Anelise Borges on 14 April, Jansa -- who was ousted following an election a fortnight later -- called for more military support for Ukraine and said if the country had crumbled in the early days of the invasion then Georgia and Moldova would have been next. \r\n\r\nHe also suggested that Russia had filled the vacuum of a reluctance to enlarge the European Union.\r\n\r\n\"It's clearly a difficult issue [enlargement] for some member states but the vast majority support a fast track approach [for allowing Ukraine to join the EU] because we sensed we were very weak when we lacked the strategic answers to the strategic questions and now it's obvious that if the European Union is not enlarging somebody else does and this does not bring more peace and more security.\"\r\n\r\nSpain: War causes splits in the coalition government\r\nBy Andrea Carlo and Amaranta Zermeno\r\n\r\nIt is in times of crisis that political fault lines are most commonly exposed, and, in the case of Spain’s coalition government, the war in Ukraine has been no exception.\r\n\r\nThe current administration, led by the centre-left prime minister, Pedro Sánchez, includes three other partners: the hard-left United We Can (Unidas Podemos, UP), the socialist Catalonian In Common We Can (En Comú Podem, ECP), and the nationalist Galicia in Common (Galicia en Común, GeC).\r\n\r\nIn the weeks prior to Russia’s invasion of Ukraine, tensions were already coming to the surface, as the coalition saw itself divided over the question of NATO involvement. \r\n\r\nWhile Sánchez supported the alliance’s efforts and agreed to send fighter jets and ships to Eastern Europe in the hopes of deterring Russia – which, ironically, saw him aligned to the centre-right opposition party – equality minister Irene Montero, from Unidas Podemos, criticised such plans and saw them as leading to further escalation.\r\n\r\nSince the conflict commenced, such divisions have not been resolved.\r\n\r\nIn July, Madrid committed to increasing its military spending as part of a NATO goal of committing 2% of GDP to defence. \r\n\r\nThe government approved a one-off expenditure of almost €1 billion that will go to cover unexpected expenses produced by Russia’s invasion of Ukraine.\r\n\r\n\"It's very simple to understand: what is spent on tanks, is not spent on hospitals,\" said Podemos spokesman Pablo Echenique, responding to his party's position on the increased defence spending. \r\n\r\nSweden: [see Finland]\r\nUnited Kingdom: First and fastest to come to Ukraine's aid\r\nBy David Mac Dougall\r\n\r\nFor a country that recently voted to be on the outside of the European Union looking in, Britain has ironically positioned itself at the centre of Europe's response to Russia's invasion of Ukraine.\r\n\r\nThey were among the first, and fastest, to offer robust military support -- including hosting a programme to train 10,000 Ukrainian soldiers -- while the British public responded with thousands of tons of humanitarian aid and offers to host Ukrainian families, even if the government made it tough to get a visa.\r\n\r\nBut it's Britain's lame duck Prime Minister who has seized the political opportunities afforded him by the conflict, to wrap himself in a Churchillian greatcoat of wartime respectability after a series of damaging domestic scandals.\r\n\r\n\"Johnson’s support for Ukraine has been both emphatic and self-interested, and there is no doubt it is part of his premiership he would most like to be remembered for,\" said Esther Webber, senior UK correspondent for Politico.\r\n\r\nJohnson's support for Ukraine is fuelled partly by apparent genuine feeling for the cause, and partly through his personal friendship with Ukrainian President Volodymyr Zelenskyy. \r\n\r\nAnd it doesn't hurt that it has also given him a useful opportunity to focus on the world stage at a time when he faced significant difficulties at home.\r\n\r\n\"At times his attachment to Ukraine has allowed him to rise above the domestic fray, with his supporters arguing the UK needed his leadership on this important global issue, but was ultimately not enough to save him from resigning.\"\r\n\r\nJohnson's focus on Ukraine and Russia, and the need for top-level cooperation with European and US allies, have helped achieve a partial reset of relations.\r\n\r\n\"However mutual suspicion endures in almost every other part of the UK's interactions with the EU post-Brexit,\" notes Politico's Esther Webber.\r\n\r\nJohnson's apparent successor as UK prime minister, Liz Truss, has also taken a hard line against the Kremlin, although she had an ill-fated trip to Moscow pre-invasion where she invoked her own wartime prime-ministerial heroine Margaret Thatcher, posing in Red Square in a fur coat and hat on a mild spring day.\r\n\r\nBut she will likely inherit the keys to Number 10 Downing Street with a slate of domestic political problems: from sliding poll numbers to the cost of living crisis; rising energy bills and environmental problems with sewage on Britain's beaches: so Ukraine might not be at the top of her priorities list in the months ahead.\r\n\r\nCredit: AP\r\nUkrainian President Volodymyr Zelenskyy, right, and Britain's Prime Minister Boris Johnson walk during their meeting in downtown Kyiv, Ukraine, Saturday, April 9, 2022 Credit: AP"],
      "url": "https://www.euronews.com/my-europe/2022/08/24/ukraine-war-country-by-country-guide-on-how-russias-invasion-has-changed-europe",
      "scraped_at": "2025-11-14T14:41:52.696430",
      "paragraph_count": 0
    },
    {
      "title": "Transnistria separatists set their eyes on possible Russian unification",
      "content": ["A woman walks past the Operational Group of Russian Forces HQ in Tiraspol, the capital of the breakaway region of Transnistria, in Moldova, Monday, Nov. 1, 2021.\r\nCopyright AP/Dmitri Lovetsky\r\nBy Euronews with AP\r\nPublished on 22/07/2022 - 14:40 GMT+2\r\nShare\r\nComments\r\nThe foreign minister of Moldova's separatist Transnistria region says that it is committed to achieving independence and possible unification with Russia, and that Moldova's EU candidacy status effectively ends any possibility of cooperation.\r\nThe foreign minister of Transnistria has said that the separatist region is committed to achieving independence from Moldova and possible unification with Russia, and that Moldova's recent EU candidacy status effectively ends any possibility of cooperation.\r\n\r\nADVERTISEMENT\r\nTransnistria, a sliver of land lying between Ukraine and the rest of Moldova, has hosted a contingent of Russian peacekeeping forces since the end of a separatist war in 1992. After Russia sent troops into Ukraine in February, speculation has risen that Moscow would aim to take control of the territory.\r\n\r\nIn April, a series of explosions in the territory, which has roughly 470,000 inhabitants, caused tensions to soar.\r\n\r\nVitaly Ignatyev, the unrecognised government's foreign minister, told a news conference in Moscow that Transnistria will pursue the goals determined in a 2006 referendum, which saw almost 100% of voters back independence from Moldova and potential Russian integration. The referendum was widely seen as illegitimate by the international community.\r\n\r\n“The subsequent free accession to Russia is a process that probably requires significant decisions, political preparation and much more,” Ignatyev said. “ The main priority, obviously, is independence.”\r\n\r\nMoldova is constitutionally neutral and thus not a potential NATO member, but is showing a growing Western orientation. In June, the EU granted it candidate status alongside Ukraine, with full bloc membership conditional on reforms such as tackling corruption and strengthening rule of law.\r\n\r\n“Having received the status of a candidate for EU membership, Moldova has thus crossed a certain Rubicon,\" Ignatyev said. “It put an end to the issue of building political relations within certain common spaces, because this decision was made solely by the Moldovan leadership, it was not taken collectively. Moreover, no one can speak for us.”"],
      "url": "https://www.euronews.com/2022/07/22/transnistria-separatists-set-their-eyes-on-possible-russian-unification",
      "scraped_at": "2025-11-14T14:41:53.368754",
      "paragraph_count": 0
    },
    {
      "title": "Ukraine war: President Zelenskyy fires spy chief and top prosecutor",
      "content": ["Copyright AP Photo\r\nBy Euronews with AP\r\nPublished on 18/07/2022 - 6:18 GMT+2 •Updated 23/07/2022 - 8:57 GMT+2\r\nShare\r\nComments\r\nThe Ukrainian president cited the fact that 'more than 60 employees' of the prosecutor’s office and the state security service stayed in occupied territory to work for the Russians.\r\nUkrainian President Volodymyr Zelenskyy has fired his country's spy chief and top prosecutor, citing hundreds of criminal proceedings into treason and collaboration by people in their departments, and other law enforcement agencies. \r\n\r\n“In particular, more than 60 employees of the prosecutor’s office and the SBU (state security service) have remained in the occupied territory and work against our state,” Zelenskyy said.\r\n\r\n“Such an array of crimes against the foundations of the state’s national security, and the links recorded between Ukrainian security forces and Russian special services raise very serious questions about their respective leaders,’’ he said in his nightly video address to the nation.\r\n\r\nZelenskyy dismissed Ivan Bakanov, a childhood friend and former business partner whom he had appointed to head the SBU. Bakanov had come under growing criticism over security breaches since the war began.\r\n\r\nHe also dismissed Prosecutor General Iryna Venediktova, and replaced her with her deputy Oleksiy Symonenko. Venediktova has helped lead war crime investigations.\r\n\r\nADVERTISEMENT\r\nThe political moves in Kyiv come as Russia has ordered its forces in Ukraine to step up operations. Dozens of people were killed in Ukraine in recent days as Russian rockets and missiles pounded the country in the latest of a series of bombardments. \r\n\r\nRussia's defence ministry said in a statement that Defence Minister Sergei Shoigu had ordered military units to step up their operations to prevent strikes on eastern Ukraine and other territories controlled by Moscow, according to Reuters.\r\n\r\nMeanwhile, Russian missiles hit industrial facilities earlier Sunday at Mykolaiv, a key shipbuilding center in southern Ukraine. The local mayor said the missiles struck an industrial and infrastructure facility. Mykolaiv has faced regular Russian missile strikes in recent weeks as the Russians have sought to soften Ukrainian defenses.\r\n\r\nThe Russian military has declared a goal to cut off Ukraine's entire Black Sea coast all the way to the Romanian border. If successful, such an effort would deal a crushing blow to the Ukrainian economy and trade, and allow Moscow to secure a land bridge to Moldova's separatist region of Transnistria, which hosts a Russian military base."],
      "url": "https://www.euronews.com/2022/07/18/ukraine-war-president-zelenskyy-fires-spy-chief-and-top-prosecutor",
      "scraped_at": "2025-11-14T14:41:53.800509",
      "paragraph_count": 0
    },
    {
      "title": "Ukraine war: Accept our terms or brace for the worst, Putin tells Kyiv",
      "content": ["Copyright Alexei Nikolsky, Sputnik, Kremlin Pool Photo via AP\r\nBy AP with Euronews\r\nPublished on 08/07/2022 - 7:48 GMT+2 •Updated 11:06\r\nShare\r\nComments\r\nSpeaking at a meeting with leaders of the Kremlin-controlled Russian parliament, Putin said the country had barely started its actions in Ukraine, and that Ukraine should accept its terms now before things get worse.\r\nRussian President Vladimir Putin on Thursday warned Kyiv that it should quickly accept Moscow's terms or brace for the worst, adding ominously that Russia has barely started its action in the country.\r\n\r\nSpeaking at a meeting with leaders of the Kremlin-controlled Russian parliament, Putin accused Western allies of fueling the hostilities, charging that \"the West wants to fight us until the last Ukrainian.”\r\n\r\n“It's a tragedy for the Ukrainian people, but it looks like it's heading in that direction,” he added.\r\n\r\nNegotiation table\r\nPutin declared that Russia was ready to sit down for talks to end the fighting, saying that “those who refuse to do so should know that the longer it lasts the more difficult it will be for them to make a deal with us.”\r\n\r\n“We are hearing that they want to defeat us on the battlefield,” he said. “Let them try.”\r\n\r\nADVERTISEMENT\r\nThe Kremlin has previously demanded that Kyiv acknowledge Russian sovereignty over the Crimean Peninsula, which it annexed in 2014, as well as recognise the independence of Moscow-backed separatist regions in eastern Ukraine.\r\n\r\nMoscow has also said in the past that it expected Ukraine to bow to the existing situation on the ground, a reference to other land gains made since Russian troops entered Ukraine on 24 February.\r\n\r\nRelated\r\nVladimir Putin blasts NATO 'imperialism' over Western military shake-up plan\r\nWestern leaders would look 'disgusting' topless, says Vladimir Putin\r\nControl of the east\r\nAfter failing to capture Kyiv and other big cities in Ukraine's northeast early, Russia’s military shifted its focus to the eastern industrial heartland of Donbas, where Moscow-backed separatists have fought Ukrainian troops since 2014.\r\n\r\nEarlier this week the Russian military claimed control of Luhansk province, one of two that make up Donbas, and that it is preparing to press its offensive into the second one, Donetsk.\r\n\r\nMoscow is expected to try to cut Ukraine off from its Black Sea coast all the way to the Romanian border. If successful, it would deal a crushing blow to the Ukrainian economy and also create a corridor to Moldova’s separatist region of Transnistria, where Russia maintains military forces.\r\n\r\nPutin also reaffirmed his long-held claim that the West is using the conflict in Ukraine to try to isolate and weaken Russia.\r\n\r\n“They simply don't need such a country as Russia,” he said. “This is why they have used terrorism, separatism and internal destructive forces in our country.”\r\n\r\n“The course of history is unstoppable, and attempts by the collective West to enforce its version of the global order are doomed to fail,” Putin added."],
      "url": "https://www.euronews.com/2022/07/08/putin-to-ukraine-accept-our-terms-or-brace-for-the-worst",
      "scraped_at": "2025-11-14T14:41:54.350316",
      "paragraph_count": 0
    },
    {
      "title": "Ukraine war: Five things you need to know about the conflict on Thursday",
      "content": ["A Ukrainian soldier flashes the victory sign atop a tank in Donetsk region, 20 June 2022\r\nCopyright AP Photo/Efrem Lukatsky\r\nBy Euronews with AP, Reuters\r\nPublished on 23/06/2022 - 19:13 GMT+2 •Updated 20:32\r\nShare\r\nComments\r\nFrom Ukraine's EU candidacy to Russian army's progress in the east, here are five of the latest developments in the war.\r\n1. EU countries endorse Ukraine as bloc membership candidate\r\nEU leaders have decided to grant Ukraine candidate status on Thursday afternoon -- a move that was widely expected as the bloc continues its support of the country at war.\r\n\r\nWhile mostly symbolic, the status represents a stunning geopolitical victory for the war-torn country, who until earlier this year was never considered a serious contender to enter the 27-strong bloc. It is also seen as a rebuttal to Russia's coercive attempt to reinstate its lost sphere of influence.\r\n\r\n\"Agreement! EUCO has just decided EU candidate status to Ukraine and Moldova,\" said European Council President Charles Michel on Twitter. \"A historic moment.\"\r\n\r\n\"Today marks a crucial step on your path towards the EU.\"\r\n\r\nMoldova -- which was also granted candidate status -- has filed its EU membership application earlier this year, fearing that the Russian invasion of Ukraine might trigger a domestic conflict with the Moscow-backed separatist region of Transnistria.\r\n\r\nPrior to the Council summit, the European Commission issued a recommendation to grant candidate status to Ukraine and Moldova, while the European Parliament voted in support of their bids.\r\n\r\n2. Russian forces advance on eastern front line\r\nThe Russian military extended its grip Thursday on territory in eastern Ukraine, capturing two villages and vying for control of a key highway as it seeks to cut supply lines and encircle frontline Ukrainian forces, British and Ukrainian military officials said.\r\n\r\nUkrainian forces withdrew from some areas near the city of Lysychansk to avoid being surrounded as Russians sent in reinforcements and concentrated their firepower in the area, Britain’s Defence Ministry said. The city is located in Luhansk province, a major battlefield in Russian President Vladimir Putin’s war against Ukraine.\r\n\r\nUkraine's General Staff said Russian forces took control of the villages of Loskutivka and Rai-Oleksandrivka and were trying to capture Syrotyne, a settlement outside the province's urban administrative centre, Sievierodonetsk.\r\n\r\nLuhansk Governor Serhiy Haidai said the Russians were “burning everything out” in their offensive to encircle Ukraine's fighters, and had an edge in heavy artillery and troop numbers.\r\n\r\nHe said shelling had intensified at the Azot chemical plant, the only part of the city still under Ukrainian control where some 500 civilians are holed up.\r\n\r\nLysychansk, located on a steep river bank facing Sievierodonetsk, also faces a relentless Russian artillery barrage. At least one civilian died and three others were wounded in 24 hours, the governor said.\r\n\r\nThe British Defence Ministry said Russian forces had likely advanced more than 5 kilometres toward the southern approaches of Lysychansk since Sunday, and are trying to cut Ukrainian supply lines.\r\n\r\n3. Two Britons and Morrocan sentenced to death in DPR preparing appeal\r\nTwo Britons and a Moroccan who were captured while fighting for Ukraine and sentenced to death by a court in the self-proclaimed Kremlin-backed Donetsk People's Republic (DPR) are preparing to appeal, Russia's TASS news agency cited one of their lawyers as saying on Thursday.\r\n\r\nThe court in DPR, which is armed and supported by Russia, found the three men -- Britons Aiden Aslin and Shaun Pinner and Moroccan Brahim Saadoun -- guilty of \"mercenary activities and terrorism\".\r\n\r\nThe men's families deny that the trio were mercenaries, stating that they are all residents of Ukraine -- with Aislin and Pinner both moving to Ukraine in 2018 -- and have served with the Ukrainian army before the 24 February invasion.\r\n\r\n\"My colleagues and I are currently preparing the full text of an appeal against the sentence in the interests of our defendants,\" TASS quoted Pinner's lawyer, Yulia Tserkovnikova, as saying.\r\n\r\n\"Undoubtedly, if the appeal is dismissed and the sentence comes into force, a request for clemency will be filed as this is an inherent right of the defendants, under the legislation of the Donetsk People's Republic,\" she added.\r\n\r\nOn Thursday, Aislin's family told UK-based media he was informed by DPR officials that his death sentence will be carried out, with time for appeal seemingly running out. \r\n\r\n4. Zelenskyy urges Israel to send arms and join sanctions\r\nUkrainian President Volodymyr Zelenskyy said Thursday that Russia destroyed more than 2,000 schools and other educational institutions during the war.\r\n\r\nIn a video address to students and faculty at Jerusalem’s Hebrew University, Zelenskyy said that in areas where Russian troops made quick advances, “forces were shooting people on the streets, they are torturing people, they are raping minors — boys and girls.”\r\n\r\nZelenskyy expressed gratitude for the support of the Israeli people: \"I am grateful for all the Ukrainian flags that appeared on your streets. We see it all, and we appreciate it all,\" he said.\r\n\r\nBut he also voiced disappointment that Israel hadn't joined Western-led sanctions against Russia or provided Ukraine with military aid to give its forces a boost in the war.\r\n\r\n\"We would like, we understand that it is not easy for you, but we would very much like to write in the tables, in that column next to your state's name, about the help for our army that we could receive,\" he said.\r\n\r\n\"As for sanctions, when the states of the world impose sanctions against Russia, it is not about money, it is not about business - it is about values, it is about general security.\" \r\n\r\n\"It is about the fact that everyone who wants to destroy another nation should be responsible,\" Zelenskyy said.\r\n\r\nIsrael relies on good ties with Russia for security coordination in Syria, where Russia has troops and where Israel carries out frequent strikes against enemy targets. It has sent humanitarian aid to Ukraine.\r\n\r\n5. China's Xi criticises sanctions 'abuse', Putin scolds the West\r\nChinese President Xi Jinping on Thursday criticised \"the abuse\" of international sanctions, while Russian President Vladimir Putin scolded the West for fomenting global crisis, with both leaders calling for greater BRICS cooperation.\r\n\r\nXi called on Brazil, Russia, India, China and South Africa (BRICS) to take up the responsibility conferred by their economic clout, and said they should stand up for a truly multinational international system based on the United Nations.\r\n\r\nPutin called for stronger BRICS cooperation and took a swipe at the West which he accused of fomenting a crisis.\r\n\r\n\"Only on the basis of honest and mutually beneficial cooperation can we look for ways out of the crisis situation that has developed in the global economy due to the ill-considered and selfish actions of individual states,\" Putin said.\r\n\r\nHe accused the West of \"using financial mechanisms\" to \"shunt their own mistakes in macroeconomic policy on to the whole world.\"\r\n\r\nThe United States and European powers blame Putin's decision to invade Ukraine as the reason relations with the West have sunk to the lowest level since the 1962 Cuban Missile Crisis -- including the severest sanctions in modern history."],
      "url": "https://www.euronews.com/2022/06/23/ukraine-war-five-things-you-need-to-know-about-the-conflict-on-thursday",
      "scraped_at": "2025-11-14T14:41:54.854780",
      "paragraph_count": 0
    },
    {
      "title": "Euroviews. Don't wait for war in Moldova before giving a clear signal on EU membership prospects | View",
      "content": ["Moldova's President Maia Sandu poses for photographers prior to a meeting with European Commission President Ursula von der Leyen\r\nCopyright Credit: AP\r\nBy Iulian Groza\r\nPublished on 22/06/2022 - 13:15 GMT+2\r\nShare\r\nComments\r\nThe opinions expressed in this article are those of the author and do not represent in any way the editorial position of Euronews.\r\n\"Confirming Moldova’s EU candidacy and outlining a robust integration policy would not only send a strong signal against Russian destabilisation attempts but would also rally the Moldovan people, who are eager for change.\"\r\nSome years ago, in Brussels, while negotiating what would become Moldova’s EU Association Agreement, I invited policymakers not to wait for a war to break out before giving the region a clear signal on membership.\r\n\r\nThat was before 2014 and sadly the subsequent hesitancy from Europe did not go unnoticed by Vladimir Putin, who has since twice launched unprovoked hostilities against our neighbour Ukraine. \r\n\r\nThis week, EU leaders have a chance to reaffirm the European Commission’s formal recommendation and start Moldova’s accession process without delay.\r\n\r\nThe Russian invasion of Ukraine was audible on the streets of Moldovan capital Chisinau and, in the subsequent months, nearly half a million refugees have passed through the territory. \r\n\r\nAround one hundred thousand have stayed, their wellbeing assured thanks to a concerted collaboration of state, civil society and ordinary citizens, many of whom have accommodated refugees in their own modest homes - an impressive effort for a country of Moldova’s size and means and one that has gained international plaudits.\r\n\r\nADVERTISEMENT\r\nIn addition to this unprecedented humanitarian situation, Moldova faces challenges on multiple fronts: soaring inflation, trade disruption, an ongoing Russian propaganda campaign and even violent attempts to reignite conflict in the separatist region of Transnistria. \r\n\r\nConfirming Moldova’s EU candidacy and outlining a robust integration policy would not only send a strong signal against Russian destabilisation attempts but would also rally the Moldovan people, who are eager for change.\r\n\r\nEU is a grassroots desideratum in Moldova, an ever-growing majority of Moldovans are calling for it. And in the most recent elections Moldovans installed a pro-EU, pro-reform government, dislodging the pro-Russian former President Igor Dodon. \r\n\r\nIn a sign of Moldova’s commitment to transparency and the rule of law, Dodon is now being investigated for corruption. Other oligarchs are on the run too, and their ill-gotten gains are being returned to the state.\r\n\r\nMoldova is not expecting a quick fix, it is understood that the accession process takes time and there are no shortcuts. But it is key to give Moldovan society a clear sense of direction, particularly in these volatile geopolitical times. \r\n\r\nThere are some in European capitals who worry that granting candidate status would provoke the Kremlin, but it should be evident by now from the war crimes being committed in Ukraine that Putin needs no provocation to create turmoil. \r\n\r\nIf Ukraine had not fought so valiantly, as it continues to do, Kyiv would have fallen, and Moldova would have been next in the firing line.\r\n\r\nMoldova understands Russian aggression only too well – 12% of the country has been occupied by Russian forces since the 1990s. Recent mysterious explosions in Transnistria, almost certainly committed by Russian intelligence agents, were designed to test the resolve of careful confidence-building measures between Chisinau and Tiraspol. But the frozen conflict is not an interethnic issue, it is an artificial conflict stirred up by Moscow to undermine Moldova’s sovereignty. Despite its talk of independence, 70% of trade in Transnistria is with the EU and local elites there are starting to show resilience towards Kremlin pressure. This shows the valuable leverage that deeper EU integration brings to peacebuilding.\r\n\r\nADVERTISEMENT\r\nMoldova is already a known quantity, anchored to the EU in multiple ways. Two-thirds of the country’s trade is with the EU and due to the Russian blockade of the Ukrainian Black Sea ports, Moldova provides alternative transit routes for Ukraine’s exports via Romania. Chisinau has been mobilising to reduce its energy dependence on Russia by buying gas from Europe and integrating into the bloc’s electricity grid. Moldova is bolstering EU security by supporting the work of Frontex on the border of Ukraine. In addition, hundreds of thousands of Moldovan citizens live, work and study in the EU, fostering invaluable economic, social and cultural ties.\r\n\r\nOn 3 March, a week after the Russian invasion of Ukraine, Moldova officially applied for EU membership. Despite grappling with numerous crises, Moldova then engaged in a national effort by government, civil society, businesses and the diaspora community to complete paperwork totalling over 2,000 questions sent by the European Commission to assess the country’s harmonisation with EU legislation. By 12 May, the questionnaires were completed. Such efficiency is a testament to Moldova’s commitment to the reform, stability and prosperity that EU candidacy and eventual membership would bring.\r\n\r\nMoldova has developed a vibrant civil society and a maturing, pluralistic political scene. With the carrot of EU candidacy status, this can only be accelerated as the government continues to fight corruption, reform the judiciary and tackle poverty. The country has for too long been held back by Moscow-sponsored kleptocrats and geopolitical divisions but now the direction is clear. Moldova does not seek any special treatment; it fully expects to be rewarded on merit. Thankfully the country has already demonstrated its political will to do the hard work.\r\n\r\nStrategic ambiguity towards the EU’s friendly neighbours has failed at deterring Moscow’s imperial ambitions. We hope that our strong, demonstrable commitment to European prosperity and security will be matched with a clear vision for membership.\r\n\r\nIulian Groza is the Executive Director of the Institute for European Policies and Reforms (IPRE, Chișinău) and former deputy minister of Foreign Affairs and European Integration of the Republic of Moldova."],
      "url": "https://www.euronews.com/2022/06/22/dont-wait-for-war-in-moldova-before-giving-a-clear-signal-on-eu-membership-prospects-view",
      "scraped_at": "2025-11-14T14:41:55.354763",
      "paragraph_count": 0
    },
    {
      "title": "Brussels backs Ukraine and Moldova as candidates for EU membership",
      "content": ["Copyright Geert Vanden Wijngaert/Copyright 2022 The Associated Press. All rights reserved\r\nBy Alice Tidey\r\nPublished on 17/06/2022 - 10:28 GMT+2 •Updated 21:35\r\nShare\r\nComments\r\nEU national leaders will have the final say at a summit in Brussels on 23-24 June. Georgia, meanwhile, was told it wasn't ready yet.\r\nThe European Commission has backed Ukraine and Moldova to become candidates for EU membership.\r\n\r\nBut leaders of EU countries will then have the final say at a summit in Brussels on 23-24 June.\r\n\r\nThe announcement was welcomed by both Ukrainian President Volodymyr Zelenskyy and his Moldovan counterpart Maia Sandu.\r\n\r\nEuropean Commission chief Ursula von der Leyen said in the case of Ukraine that \"we all know that Ukrainians are ready to die for the European perspective, we want them to live with us, the EU\".\r\n\r\nShe praised the country's pre-war reforms to tackle corruption, curb the influence of oligarchs and strengthen the rights of minorities although she noted that \"we want to see results on the ground\".\r\n\r\nADVERTISEMENT\r\nShe also flagged that the country enjoys a \"very robust parliamentary, presidential democracy\" and that its public administration has kept the country going despite the war. She also noted that \"Ukraine has a very vibrant and active civil society\".\r\n\r\n\"To conclude on Ukraine, we have one clear message and that is, yes Ukraine deserves European perspective, yes Ukraine should be welcome as a candidate country,\" she told reporters.\r\n\r\nCandidate status for Moldova too, not Georgia\r\nMoldova too has a solid foundation in place to reach the stability of institutions guaranteeing democracy, the rule of law, human rights and the economic integration with the EU, the Commission concluded.\r\n\r\n\"Provided the country’s leaders stay on course, we believe that the country has the potential to live up to the requirements,\" von der Leyen said.\r\n\r\nIn the case of Georgia, however, the Commission said it should only be given \"European perspective\" but that it should only get candidate status once a number of priorities have been addressed.\r\n\r\n\"It is a huge step forward for Georgia to get the European perspective, this is a big achievement, and the door is wide open,\" the Commission head stressed. \"It is up to Georgia now to take the necessary steps\" which  \"also determines, of course, the timeframe\".\r\n\r\n\"The sooner you deliver, the sooner there is progress,\" von der Leyen said.\r\n\r\nWatch the Commission's briefing in the video player below.\r\n\r\n\r\n'Historic decision' for Ukraine\r\nThe candidate status, if approved by EU leaders at their Council summit next week, is more of a symbolic gesture. It does not entitle Ukraine or Moldova to more EU funds and does not also mean that accession negotiations will begin in earnest.\r\n\r\nADVERTISEMENT\r\nFor that, both countries will need to continue with their reformist agenda with von der Leyen highlighting that accession is a \"dynamic process\" and that it does not have \"a defined timeline.\"\r\n\r\n\"We expect these reforms to be done, if so, then it's merit-based, and then there's movement forward,\" she said.\r\n\r\nStill, Zelenskyy took to Twitter to \"commend the positive Commission's conclusion\" which he described as a \"historic decision\".\r\n\r\n\"It's the first step on the EU membership path that'll certainly bring our victory closer,\" he also wrote, adding that he now expects \"a positive result\" at the European Council level when EU leaders meet next week. \r\n\r\n\r\nSandu said the Commission's recommendation sends a \"strong signal of support for Moldova and our citizens\", vowing the country will be \"working hard\" to undertake the additional reforms required and that they now \"count on EU Council support.\"\r\n\r\n\r\nFrance, Germany, and Italy also backing Ukraine\r\nIt comes a day after leaders of the bloc's three biggest member states — France, Germany and Italy — made their long-awaited first trip to Kyiv and clearly stated their backing for Ukraine's bid.\r\n\r\nADVERTISEMENT\r\nFrance's Emmanuel Macron insisted that it would provide \"a strong, quick, expected gesture of hope and clarity that we want to send to Ukraine and its people\" while Germany's Olaf Scholz stated that \"Ukraine belongs to the European family\".\r\n\r\nThey stressed, however, that there would be conditions and that the war-torn country would not get preferential treatment over other counties that have been in negotiations to join the 27-country bloc for years.\r\n\r\nAny country that wishes to join the EU must fulfil what is known as the \"Copenhagen criteria\" for a functioning market economy, a stable democracy and the rule of law, and the acceptance of all EU legislation, including of the euro. These usually require the candidate country to undertake a series of reforms. \r\n\r\nRelated\r\nUkraine war: Macron, Scholz and Draghi back EU candidate status for Ukraine\r\nWhat's the background?\r\nRussia's invasion of Ukraine, which Moscow said was partly motivated by the West seemingly encroaching on what it says is its sphere of influence, has backfired by leading to a flurry of countries looking to join the EU and the NATO military alliance.\r\n\r\nUkraine announced its wish to join the EU just four days after Russia launched its attack on 24 February. Kyiv filled out all the necessary and lengthy paperwork in a single month after receiving it on April 8 during a visit to the Ukrainian capital by European Commission president Ursula von der Leyen.\r\n\r\nMoldova and Georgia followed suit. \r\n\r\nRelated\r\nExplained: Where EU leaders stand on Ukraine's membership to the bloc\r\nEU leaders split\r\nUkraine can count on the Baltics, which have all unambiguously stated the country belongs in the EU. But some other countries particularly those with close ties to the Western Balkans may well push for strong conditions in order to assuage potential criticism of favouritism. \r\n\r\nMacron emphasised from Kyiv that he, along with Scholz and Italian Prime Minister Mario Draghi, \"will have to build together the unanimity of the 27\" before the EU Council summit next week. \r\n\r\nADVERTISEMENT\r\nAccording to Marie Dumoulin, director of the Wider Europe programme at the European Council on Foreign Relations (ECFR), a thinktank, Denmark, Portugal and the Netherlands have raised concerns over Ukraine's candidacy.\r\n\r\n\"This had to do with issues with the rule of law and with the fight against corruption in Ukraine, which are real issues and which the Ukrainian government itself recognises that it has to work on,\" she told Euronews.\r\n\r\n\"There is, of course, this argument that the Ukrainian state is not ready.\"\r\n\r\n\"The other concern is that by sending this kind of signal to Ukraine and possibly Moldova in the context of a war, we could send to other countries that have been candidates for EU membership or that are not yet recognised as candidates but aspire to this a negative signal,\" she added, explaining that these EU hopefuls could conclude that the process has \"little to do with themselves and more to do with geopolitical issues.\"\r\n\r\nCommissioner for Neighbourhood and Enlargement Olivér Várhelyi stressed to reporters on Thursday that \"to ensure that we have all the member states on board, the best way to do it is to ensure full credibility and full adherence to the criteria and this is what we are doing in this case.\"\r\n\r\nThe Commission's opinion also stressed that nothing is set in stone and that \"the accession process remains based on established criteria and conditions. This allows any country in the process to progress based on own merits but also means that steps towards the EU can be reversed if the underlying conditions are not met anymore.\"\r\n\r\nWhy the EU is leaning toward yes\r\nFor Guntram Wolff, director of the Bruegel thinktank, the candidate status could not only help Ukraine rebuild after the war and strengthen its institutions because it \"can make it more likely that recovery money is well spent\" but it \"could even be a catalyst for EU reforms\", he said in a note on Thursday.\r\n\r\n \"Decision-making processes need to become easier and the EU needs to move away from unanimity in critical areas,\" he added. \r\n\r\nCamino Mortera-Martinez, head of the Brussels office of the Centre for European Reform (CER), another think tank, described enlargement as the \"trickiest\" issue facing the EU and noted that the Commission's early lobbying on member states for Ukraine membership \"is working.\"\r\n\r\n\"Many think that Ukraine is not ready to join the EU yet, but they know the EU cannot afford to keep it in the waiting room for years, as it has done with other candidates like North Macedonia,\" she said in a note. \r\n\r\nShe also tentatively backed Macron's idea of a European Political Community that would allow countries that wish to join or that have left the bloc to have closer ties to the union.\r\n\r\nBreakaway regions could be a problem\r\nOne issue that could slow accession — already a very long process — for Ukraine and Moldova are the breakaway regions within their borders.\r\n\r\nADVERTISEMENT\r\nSeparatist leaders in eastern Ukraine declared their territories independent in the weeks before Russia launched its invasion and the so-called Donetsk People's Republic (DPR) and Luhansk People's Republic (LPR) are recognised only by Moscow. Crimea, and its illegal annexation by Russia in 2014, is also a sore point.\r\n\r\nThe pro-Russia territory of Transnistria in Moldova will likely prove a headache for the country as it seeks to become an EU member, a fact Sandu conceded during a joint press conference with Macron earlier this week.\r\n\r\n\"The Transnistrian region and the illegal presence of Russian troops in this area represent a weak point of vulnerability for the Republic of Moldova,\" she said.\r\n\r\nAn EU official stressed to reporters on Thursday that the two countries have \"internationally recognised borders and recognised by the member states\" and that the bloc has a \"very firm position of non-recognition\" of these breakaway regions.\r\n\r\nBut he noted that these will have to be addressed later in the accession process."],
      "url": "https://www.euronews.com/my-europe/2022/06/17/brussels-set-to-endorse-ukraine-as-a-candidate-for-eu-membership",
      "scraped_at": "2025-11-14T14:41:55.959269",
      "paragraph_count": 0
    },
    {
      "title": "U.S., Ukrainian officials weigh ‘high possibility’ of Putin invading Moldova",
      "content": ["Ukrainian President Volodymyr Zelenskyy has warned that Russia’s assault on Ukraine “was intended only as a beginning.”\r\n\r\nServicemen of the militia from the Donetsk People's Republic walk past damaged apartment buildings.\r\nService members of the militia from the Donetsk People's Republic walk past damaged apartment buildings in an area controlled by Russian-backed separatist forces in Mariupol, Ukraine, on April 16. | Alexei Alexandrov/AP Photo\r\n\r\nBy Quint Forgey\r\n04/24/2022 12:23 PM EDT\r\nUpdated: 04/24/2022 01:53 PM EDT\r\n\r\n\r\nU.S. and Ukrainian officials on Sunday discussed the possibility of Russian President Vladimir Putin expanding his invasion from the Donbas region of southeastern Ukraine into the neighboring nation of Moldova — another former Soviet state and non-NATO member in Eastern Europe.\r\n\r\n“I think where they go from here remains to be seen,” deputy national security adviser Jon Finer told NBC’s “Meet the Press” in an interview, referring to Russian forces. “But they are a long way from cities like Odesa” — the Black Sea port city in southern Ukraine — “and certainly from Moldova.”\r\n\r\nRussian forces “have a lot of fighting still to do,” Finer added, “and we think the Ukrainians are going to be very effective in fending them off.”\r\n\r\nPressed on how the Biden administration’s wartime strategy would change if Russia began making moves toward Moldova, Finer responded that the United States has “shown an ability to be nimble” and “to adjust our assistance and our approach as the Russian war aims have evolved.”\r\n\r\n“We will continue to do that over time, depending on how things evolve on the battlefield,” Finer said.\r\n\r\nFiner’s remarks came after Russian news agencies reported last Friday that Rustam Minnekayev, the deputy commander of Russia’s central military district, said Russia plans to take full control of the Donbas and the southern part of Ukraine as part of its new offensive in the country.\r\n\r\n“Control over the south of Ukraine is another way to Transdniestria, where there is also evidence that the Russian-speaking population is being oppressed,” Minnekayev reportedly said at a meeting in Russia’s central Sverdlovsk region.\r\n\r\nTransdniestria, or Transnistria, is a pro-Russia breakaway region of Moldova, which borders Ukraine to the southwest. Moldova, like Ukraine, was part of the Soviet Union until Soviet President Mikhail Gorbachev dissolved the sprawling communist state in 1991.\r\n\r\nMinnekayev also reportedly said that Russia plans to establish a land corridor between the Donbas and Crimea, the Black Sea peninsula south of Ukraine that Russia seized and illegally annexed in 2014.\r\n\r\nMoldova’s Ministry of Foreign Affairs and European Integration then summoned Oleg Vasnetov, Russia’s ambassador to the country, to express “deep concern” last Friday over Minnekayev’s remarks.\r\n\r\n“These statements are unfounded and contradict the position of the Russian Federation supporting the sovereignty and territorial integrity of the Republic of Moldova, within its internationally recognized borders,” the ministry said in a statement.\r\n\r\nDuring the meeting with Vasnetov, “It was reiterated that the Republic of Moldova, in line with its Constitution, is a neutral state and this principle must be respected by all international actors, including the Russian Federation.”\r\n\r\nAsked on Sunday about a potential Russian invasion of Moldova, Igor Zhovkva, deputy head of the office of Ukrainian President Volodymyr Zelenskyy, told NBC that Russian forces “can move anywhere they want, but they will not, we will not let them do this.”\r\n\r\n“The actual war of Russia started in 2014 by capturing the Crimea and part of Donbas. So, yes, now they want to capture the whole Donbas. Yes, they want to have the connection between Donbas and the Crimea,” Zhovkva said.\r\n\r\n“As far as the Moldova is concerned, yes, we heard those announcements of Russian officials,” Zhovkva continued. “Who knows? You never know with Russia, but … that could be a high possibility.”\r\n\r\nAfter retreating from around the capital of Kyiv in northern Ukraine earlier this month, Russian forces last Monday launched their anticipated assault in the Donbas, which is home to two breakaway areas largely held by Moscow-backed separatists: the so-called Donetsk People’s Republic and Luhansk People’s Republic.\r\n\r\nIn an address last Friday, Zelenskyy repeated his warning that Russia’s invasion of Ukraine “was intended only as a beginning,” and that Putin then intends “to capture other countries.”\r\n\r\n“All nations that, like us, believe in the victory of life over death must fight with us. They have to help us, because we are the first on this path. And who is next?” Zelenskyy said. “If anyone who can become next wants to stay neutral today so as not to lose anything, this is the riskiest bet. Because you will lose everything.”\r\n\r\nWatch: The Conversation\r\nPlay Video34:32\r\nSeth Moulton on his Senate bid, Venezuela and the Epstein files | The Conversation\r\nDoug Lute, a retired Army lieutenant general and former U.S. ambassador to NATO, agreed with Zelenskyy’s assessment of Putin’s ambitions on Sunday.\r\n\r\n“I think he would like to do that. President Putin would like to do that. He would like to expand the power of Russia in his neighborhood. He would like to recreate something like the old Russian empire,” Lute told ABC’s “This Week” in an interview.\r\n\r\nHowever, such a restoration of the Soviet Union is “not within” Putin’s capabilities, Lute said, adding: “There’s a big gap here between his aims and his means.”"],
      "url": "https://www.politico.com/news/2022/04/24/putin-invade-moldova-ukraine-00027380",
      "scraped_at": "2025-11-14T14:41:55.959269",
      "paragraph_count": 0
    },
    {
      "title": "MoldovaMoldova - between EU accession and mounting regional tensions\r\n",
      "content": ["SHARE:\r\nPublished 3 years ago on July 20, 2022By admin\r\n\r\nSignup to our weekly newsletter to receive exclusive interviews, articles & videos.\r\nEnter your email address\r\n \r\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. You can unsubscribe at any time.\r\n\r\nWith a raging war next door, a breakaway region packed with Russian soldiers stirring tensions and an EU accession process picking up speed, the Republic of Moldova has been having an eventful couple of weeks, writes Cristian Gherasim.\r\n\r\nThe war in Ukraine placed the small eastern European country in a precarious position. The nation of 2.5million has received the largest number of refugees in relation to its population size.\r\n\r\nDuring a visit to Chisinau, earlier last month, the UN secretary general talked about the fragile position Moldova is in. He mentioned that the country finds itself in the first line of defense in keeping peace and stability in the region.\r\n\r\n“I am deeply concerned about the continuation and possible spread of the war Russia is waging in Ukraine, and by the impact it is having not only in the region but around the world. The consequences of escalation are too frightening to contemplate,” Antonio Guterres said during his visit.\r\n\r\nSandwiched between Ukraine and the EU, Moldova remains one of the poorest countries on the continent. A former soviet republic, maintaining a total dependence on Russian gas, Moldova has always had its politics fueled by its east/west divide represented by the Russian speaking Moldovans and the more centrist, western-leaning and Romanian speaking part of population.\r\n\r\nThe pro-European government hopes that closer ties with the European Union and the possibility of a future EU membership could help mitigate Moldova’s fragility in the region.\r\n\r\nTransnistria\r\n\r\nThough enthusiasm might be high with the majority of the population backing EU membership, as a recent study of WatchDog.md NGO shows, Moldova might never become part of the EU unless the Transnistrian problem is resolved.\r\n\r\nTransnistria is an unrecognized breakaway region located in the narrow strip of land between the river Dniester and the Moldovan–Ukrainian border that is internationally recognized as part of the Republic of Moldova. With its own institutions, a flag, national bank and independence day, Transnistria hosts a contingent of 1,500 troops that Russia says are peacekeepers.\r\n\r\nThe Russian controlled and heavily armed region made headlines over the past weeks due to recent comments by Russian military officials saying that Kremlin wants to create a “land corridor” from Russia in the east to Transnistria. Russian Major General Rustam Minnekayev argued than an intervention in Transnistria would be warranted because of “oppression of Russian-speaking population”.\r\n\r\nSuch a turn of events would bring Russian forces on Moldovan soil and right at NATO’s doorstep.\r\n\r\nSparking even more fears that Russia might be trying to justify a new conflict in Eastern Europe and reach Transnistria, a series of unexplained explosions occurred in parts of the region, damaging two radio towers, a military unit, with explosions being heard in Transnistria's capital Tiraspol, near the Ministry of State Security building. The Transnistrian foreign minister blamed Ukraine for the explosions which Kiev denied. Ukraine President Zelenskyy said that such false flag attacks are used by Moscow as pretext to attack Moldova.\r\n\r\nSpeaking to EU Reporter, Armand Gosu, professor at the University of Bucharest and a leading expert on Moldova and the ex-Soviet region, said that Putin would want to occupy Transnistria and instate a friendly government in Chisinau, capital of Moldova, but it’s not that simple to pull off.\r\n\r\n“The problem for Putin is that Russia can’t win the battle for Donbas, let alone Odessa. Surely not now.\r\n\r\nIf indeed Odessa were to fall, the risk is huge for Moldova, as most likely Transnistria would be swamped by officials linked to the Russian secret service trying to turn Transnistria into a new Donbas.\r\n\r\nThe good news is that Transnistria doesn’t want to go to war. The political and economic elite there would want to do business with the EU and Romania instead”.\r\n\r\nEU accession and its hurdles\r\n\r\nEarlier this month, the European Parliament voted to grant Moldova EU candidate status. More so, the Moldovan government handed back the complete EU questionnaire needed to kick-start the process.\r\n\r\nYet, Moldova is still very far along the path towards becoming an EU member state.\r\n\r\nBesides the unresolved Tranistrian issue, Moldova has an even harder time in tackling corruption. For the trend to change, Moldova needs an overhaul of its governance and a drastic break with past oligarch practices - which the current government has said it will undertake.\r\n\r\nSuch oligarch practices have been made infamous by the likes of Vladimir Plahotniuc, the former chairman of the Democratic Party, charged in the disappearance of more than $1 billion -- 12.5% of Moldova’s GDP -- from the country’s biggest banks;\r\n\r\n“The oligarch problem in Moldova can be sorted out through justice reform. This is what Maia Sandu’s program promises. With oligarchic structures such as those present in Modova and other former soviet republics it would be very difficult for Moldova to become an EU member state. I don’t think EU could tolerate any form of corruption particularly after the experience it has had with Romania and Bulgaria”, Armand Gosu told EU Reporter.\r\n\r\nIf and how fast Moldova can root out corruption remains unclear, but the country’s pro-European president, Maia Sandu, and parliamentary majority promised zero tolerance towards wrongdoings, shortly after winning last year’s elections. The country’s European path, its security and that of the entire region rely on the government’s success in delivering on that promise."],
      "url": "https://www.eureporter.co/world/moldova/2022/07/20/moldova-between-eu-accession-and-mounting-regional-tensions/",
      "scraped_at": "2025-11-14T14:41:55.959269",
      "paragraph_count": 0
    },
    {
      "title": "Moldova is Russia’s next target\r\n",
      "content": ["SHARE:\r\nPublished 3 years ago on July 21, 2022By admin\r\n\r\nSignup to our weekly newsletter to receive exclusive interviews, articles & videos.\r\nEnter your email address\r\n \r\nWe use your sign-up to provide content in ways you've consented to and to improve our understanding of you. You can unsubscribe at any time.\r\n\r\nA lot hinges on stopping Russian troops advancing into the Ukrainian city port of Odessa, most of all the territorial integrity of neighboring Moldova, writes Cristian Gherasim.\r\n\r\n“We have to face up to the reality that if things take a turn for the worse and Odessa falls to the Russians, then the situation becomes extremely dangerous for the Republic of Moldova. If that happens, Moldova is the next,” Mihai Popșoi, vice-president of the parliament of the Republic of Moldova told EU Reporter.\r\n\r\n“We can’t exclude Moldova to be the next target in Putin's crosshairs”, Galia Sajin, another Moldovan MP and member of the Parliamentary Foreign Affairs Committee added for EU Reporter.\r\n\r\nSandwiched between Ukraine and the EU, Moldova finds itself in quite the predicament not only because of its proximity to the warzone but also because of the volatile situation in its breakaway region of Transnistria were 1500 Russian troops are stationed.\r\n\r\nTransnistria recently made headlines both because Russian military officials commented about a possible intervention on the ground and due to of a series of unexplained explosions happening around Tiraspol that Kremlin could use to justify opening a new front to protect the Russia-speaking population there.\r\n\r\nThere are no clear guaranties to rule out that from happening and to protect Republic of Moldova.\r\n\r\n“Regretfully, I have to say that we have no security guarantees and our neutrality status might not be enough to fend off any possible aggression. The problem is Russian military presence in Transnistria”, the vice-president of the Parliament of the Republic of Moldova commented.\r\n\r\nMoldova’s fragility has been further explained by Armand Gosu, a leading expert on the region. Speaking to EU reporter he said that Putin would want to occupy Transnistria and instate a friendly government in Chisinau, capital of Moldova, even though that might not be that easy to pull off.\r\n\r\n“If indeed Odessa were to fall, the risk is huge for Moldova, as most likely Transnistria would be swamped by Russian military and turned into a new Donbas”, he said.\r\n\r\nA sliver of hope that the region and Moldova might not be dragged into the war next door comes from the fact that Transnistria doesn’t not want a conflict and wants to do business with EU and Romania instead, a vision shared by the Moldovan Parliament vice-president.\r\n\r\nThe Moldovan official believes that current events have brought his country and the EU closer together.\r\n\r\n“Obtaining that status of candidate member state would help stabilize the situation and peacefully resolve the conflict in Transnistria”, Mihai Popșoi explained.\r\n\r\nOn the other hand, experts believe that without sorting out the status of Transnistria, Moldova might never become part of the EU.\r\n\r\nDespite the high enthusiasm with the majority of the population backing EU membership and the European Parliament voting to grant Moldova candidate status, Transnistria isn’t the only thing stopping Moldova from becoming an EU member state.\r\n\r\nThe European Commission has been sounding the alarm over Moldova’s rampant corruption for quite some time and for the need to tackle it. In addition to the overhaul of its governance, Moldova needs a drastic break with oligarch practices - which the current government has said it will undertake.\r\n\r\n“The oligarch problem in Moldova can only be resolved through justice reform. With such oligarchic structures it would be very difficult for Moldova to become an EU member state”, Armand Gosu explained.\r\n\r\nIf and when Moldova roots out corruption remains unclear, but the country’s pro-European president, Maia Sandu and parliamentary majority promised zero tolerance towards wrongdoings, shortly after winning last year’s elections."],
      "url": "https://www.eureporter.co/world/moldova/2022/07/21/moldova-is-russias-next-target/",
      "scraped_at": "2025-11-14T14:41:55.959269",
      "paragraph_count": 0
    },
    {
      "title": "Western powers meet to pledge urgent support for Moldova as winter nears",
      "content": [
        "Some 45 countries and institutions meet in Paris on Monday (21 November) to pledge millions of euros of aid for Moldova, as fears mount that it could be further destabilised by the conflict in Ukraine.",
        "Some 45 countries and institutions meet in Paris on Monday (21 November) to pledge millions of euros of aid for Moldova, as fears mount that it could be further destabilised by the conflict in Ukraine.",
        "Moldova, which lies between Ukraine and Romania, has felt the effects of rising food and energy prices and thousands of refugees arriving in the country of about 2.5 million people, which has taken more refugees per head than any other country.",
        "Largely dependent on Russia energy supplies, Moldova is facing more difficulties with winter arriving and Moscow cutting natural gas supplies by about 40%, hurting its ability to supply enough electricity to its population.",
        "Faced with being starved of the Russian gas it has depended on for decades, the…",
        "Moldova, now a EU candidate country, was part of the former Soviet Union. Some of its territory, Transnistria, is occupied by Moscow-backed separatists.",
        "Although it has strong historical and linguistic ties to neighbouring EU member Romania, it relies exclusively on Russia’s Gazprom for gas imports.",
        "“Moldova is directly impacted because its dependent on Russian energy supplies and is a country which has a part of its territory controlled by Russian soldiers so it’s especially vulnerable,” a French diplomat told reporters in a briefing.",
        "Donor conferences in Berlin and Bucharest earlier this year saw pledges in total of about €1.3 billion.",
        "Aid would be used to support Moldova’s budget and electricity supplies as well as the costs for hosting thousands of Ukrainian refugees."
      ],
      "url": "https://www.euractiv.com/news/western-powers-meet-to-pledge-urgent-support-for-moldova-as-winter-nears/",
      "scraped_at": "2025-11-14T14:41:57.867520",
      "paragraph_count": 10
    },
    {
      "title": "Moldova fears new Russian push towards breakaway east next year",
      "content": [
        "Moldova's spy chief warned of a \"very high\" risk of a new Russian offensive towards his country's east next year and said Moscow still aimed to secure a land corridor through Ukraine to the breakaway Moldovan region of Transnistria.",
        "Moldova’s spy chief warned on Monday (19 December) of a “very high” risk of a new Russian offensive towards his country’s east next year and said Moscow still aimed to secure a land corridor through Ukraine to the breakaway Moldovan region of Transnistria.",
        "The comments by Alexandru Musteaţă, head of the Information and Security Service, echo recent messages out of Ukraine where top army generals have warned in recent days of the threat of a major new Russian offensive early next year.",
        "“The question is not whether the Russian Federation will undertake a new advance towards Moldova’s territory, but when it will do so,” Musteaţă told the TVR-Moldova television channel.",
        "He said his agency believed Russia was looking at several scenarios to reach Moldova and that it was possible an offensive would be launched in January-February or later in March-April.",
        "The Information and Security Service said in a statement that it expected Russian offensive action would depend on the course of its 24 February invasion of Ukraine.",
        "Russia’s Defence Ministry did not immediately reply to a written Reuters request for comment.",
        "The Kremlin’s invasion of Ukraine has suffered a slew of setbacks, most recently in the south where its troops were forced to retreat from the western bank of the Dnipro River in a big win for Kyiv last month.",
        "To Ukraine’s west, fellow ex-Soviet republic Moldova has a tiny defence budget and has long had Russian troops and peacekeepers based in Transnistria, a breakaway statelet that has survived for three decades with support from Moscow.",
        "Musteaţă said Russia wanted its forces to link up with those forces in Transnistria.",
        "Ukrainian General Valery Zaluzhniy told The Economist last week Russia was preparing 200,000 fresh troops for a major offensive that could come from the east, south or even from Belarus to the north as early as January, but more likely in spring.",
        "Moldova, now seeking closer ties with the West like Ukraine, has condemned the Russian invasion of its larger neighbour.",
        "Two explosions damaged Soviet-era radio masts that broadcast Russian radio from a village in the…"
      ],
      "url": "https://www.euractiv.com/news/moldova-fears-new-russian-push-towards-breakaway-east-next-year/",
      "scraped_at": "2025-11-14T14:41:58.995643",
      "paragraph_count": 13
    },
    {
      "title": "Moldova facing dark winter as energy crisis bites",
      "content": [
        "Faced with being starved of the Russian gas it has depended on for decades, the coming months will be crucial for Moldova., since recently a EU candidate country.",
        "Faced with being starved of the Russian gas it has depended on for decades, the coming months will be crucial for Moldova., since recently a EU candidate country.",
        "A silence hangs over Ion Ignat’s normally noisy factory in Chetrosu, Moldova, with his 50 workers fretting about their future.",
        "“Normally, all the machines are running. Now all is dead silent,” said the owner of the plant that makes bricks and concrete products about a half an hour’s drive from the capital Chisinau.",
        "The 60-year-old decided to halt production early last month for the first time since 1992 when spiralling energy prices made it too expensive to fire the kilns and run the machinery.",
        "Ignat hopes to restart production soon if oil and gas prices fall.",
        "In the meantime like many others in this impoverished nation nestled between Romania and Ukraine, he is preparing for a hard winter.",
        "Faced with being starved of the Russian gas it has depended on for decades, the coming months will be crucial for this country of 2.6 million people with a Soviet past and European ambitions.",
        "European Commission president Ursula von der Leyen will visit later this week to discuss how the bloc can help Moldova, which became an EU candidate in the wake of the Russian invasion of Ukraine.",
        "Its pro-European and Harvard-educated president, Maia Sandu, has warned her country risks running out of gas and electricity this winter, with gas prices rising 600 percent in the last year.",
        "“It’s a daily challenge to supply the country with energy. A family is paying 70 to 75% of its incomes on (gas and electricity) bills,” President Sandu said in a recent address to parliament in neighbouring Romania.",
        "Moldova — where inflation was 33.9% year-on-year in September – is almost entirely dependent on Russian gas.",
        "But Russian energy giant Gazprom is reducing deliveries by half in November, according to Chisinau.",
        "As for electricity, Ukraine used to supply 30 percent of its needs. But Russian strikes on energy infrastructure there led to Kyiv to stop all exports to Moldova.",
        "The remaining 70 percent of the country’s power normally comes from a thermal power station in Transnistria, a small breakaway region where Russian troops are stationed, which also cut deliveries to Chisinau.",
        "EU member Romania said last month it would start selling electricity to its neighbour at a reduced price because of the difficulties created by the war in Ukraine.",
        "Moldova’s pro-Western government, facing warnings from Russian gas supplier Gazprom about non-payment on obligations, must…",
        "The Moldovan government has also urged towns to turn off street lights and households to limit consumption, with businesses asked to change their hours to work at off-peak times.",
        "One of those who has heeded the call is Sergei Litra, the owner of Moldova’s first craft brewery. His employees now work in two shifts outside peak hours, one running from 11 pm to five in the morning.",
        "“Everything depends on when the war in Ukraine will end. This war made everybody understand that we need energy independence,” the 36-year-old told AFP, adding that he was considering buying solar panels.",
        "Sandu — a former World Bank economist elected in 2020 — said Moldova’s dependence on Russian gas is a “vulnerability (that) generates political blackmail”.",
        "In a polarised nation often seen as split between Russia and the West, Sandu is worried that the current economic turmoil could lead to social unrest.",
        "Several thousand protesters denouncing Moldova’s pro-Western leaders marched through ex-Soviet state’s capital for the sixth…",
        "On 26 October the US Treasury imposed sanctions on a former Moldovan official and several other figures to counter Russia’s “persistent malign influence campaigns and systemic corruption in Moldova.”",
        "Back at the brick factory, Ignat said the “next six months will be decisive” for his country.",
        "“We have one foot in Russia and one in the EU. But if we’re going to be brave and dignified we’ll have both feet in Europe and we’ll get rid of the blackmail of the past 30 years,” he told AFP.",
        "To the government’s anger, street lights have been turned back on in the capital after the mayor decided the blackout was a safety hazard that didn’t save enough energy.",
        "“I felt deep sadness seeing Chisinau plunged into darkness,” said pharmacist Liliana Damaschin, 54, who had returned to Moldova from her job in Italy for a holiday. “I am very worried about my country.”"
      ],
      "url": "https://www.euractiv.com/news/moldova-facing-dark-winter-as-energy-crisis-bites/",
      "scraped_at": "2025-11-14T14:42:00.058136",
      "paragraph_count": 28
    },
    {
      "title": "Moldova can't rely only on neutral status, security aide says",
      "content": [
        "Moldova can no longer rely only on its neutral status and must ramp up its defensive military power, a security aide to pro-Western President Maia Sandu said on Monday (26 September).",
        "Moldova can no longer rely only on its neutral status and must ramp up its defensive military power, a security aide to pro-Western President Maia Sandu said on Monday (26 September).",
        "The small east European nation, sandwiched between Ukraine and Romania, one of Europe’s poorest countries, allocated just over 1 billion leu – or 0.45% of GDP – for defence spending this year.",
        "The former Soviet  republic applied for European Union membership this year and strongly condemned Russia’s invasion of Ukraine, but has Russian troops and peacekeepers based in its Transnistria breakaway region and relies heavily on Russian energy.",
        "“Moldova can no longer rely exclusively on foreign policy instruments, one of which is its neutral status, to ensure state stability,” said Dorin Recean, the security aide.",
        "“Moldova must start work on increasing its defence potential… The authorities need to obtain the conscious support of citizens who should understand it is critical to the state’s survival,” he said, calling for funds to be allocated for this task.",
        "Sandu met with NATO chief Jens Stoltenberg on 20 September in New York. Unlike Georgia and Ukraine, Moldova so far has not sought membership in NATO.",
        "Several thousand people protested in Moldova’s capital on Sunday for the second straight weekend to demand the resignation of the country’s pro-Western government amid mounting anger over spiralling natural gas prices and inflation.",
        "Moldova has seen political tensions rise in recent months as gas prices soar following Russia’s invasion of Ukraine.",
        "Protesters chanted “Down with Maia Sandu”, and “Down with the government”.",
        "The rallies are the largest since Sandu won a landslide election victory in 2020 on an anti-corruption platform, but pose no immediate threat to the president and her administration.",
        "Sandu has repeatedly condemned Moscow’s actions in Ukraine and is pushing for membership of the European Union, which has provided the ex-Soviet state with considerable assistance.",
        "Her critics charge she should have negotiated a better gas deal with Russia, Moldova’s main supplier.",
        "On Friday, Moldova’s gas regulator raised prices by 27% for households.",
        "The protests have been organised by the opposition party of Ilan Shor, an exiled businessman convicted of fraud in connection with a $1 billion bank scandal. The chief suspect in that fraud, business magnate Vlad Plahotniuc, is also outside Moldova, his whereabouts unknown.",
        "Prime Minister Natalia Gavrilita said she was focused on helping those with low incomes.",
        "“The problems of the country and its people will not be solved on the streets,” she wrote on the point.md news site. “We are trying to solve the problems of people most in need.”",
        "Protesters have vowed to hold weekly rallies until Sandu and her government leave office.",
        "An encampment of about 100 tents remains around Moldova’s parliament an protesters on Sunday set up a further dozen tents outside the president’s residence.",
        "Moldova is poised to make a payment to Gazprom for this month’s gas supplies to alleviate fears the Russian gas giant could reduce or cut supplies from 1 October, Deputy Prime Minister Andrei Spinu said Monday.",
        "“In the very next few days, Moldovagaz will pay Gazprom an advance in the amount of $33.89 million for the month of September,” Spinu said in remarks broadcast on Pro TV Chisinau.",
        "The state gas company has paid Gazprom for August, but a senior company source previously told Reuters it is struggling to make its 50% advance payment for September amounting to $33.89 million.",
        "(Edited by Georgi Gotev)"
      ],
      "url": "https://www.euractiv.com/news/moldova-cant-rely-only-on-neutral-status-security-aide-says/",
      "scraped_at": "2025-11-14T14:42:01.120765",
      "paragraph_count": 23
    },
    {
      "title": "‘I don’t feel safe here’: Transnistria fears could spark Moldova exodus",
      "content": [
        "Explosions in separatist-controlled region have heightened worries that country could be drawn into the Ukraine war",
        "Whena string of mysterious explosionshit government buildings in Transnistria, the Moscow-backed separatist region of Moldova, there was no immediate claim of responsibility. But for Pasha, a 24-year old journalist from the breakaway region’s capital, Tiraspol, this week’s blasts were a clear sign that it was time to get out.",
        "“There was a chance that there would be more attacks, and it’s no fun waiting to find out where would be hit next,” he said. Adding to the uncertainty were growing rumours that men in the region would be mobilised to fight alongside Russian troops across the border inUkraine.",
        "So Pasha, his mother and his friend, fellow journalist Maxim, 23, packed their essentials and drove to the Moldovan capital, Chișinău, where they are staying with relatives. They are hoping to return home, but other friends who left Transnistria have already fled to Turkey, Poland or the Czech Republic.",
        "With a population of 470,000 people, Transnistria is a predominantly Russian-speaking sliver of land wedged between the Nistru River and the Ukraine border.",
        "A year after Moldova declared independence from the Soviet Union, the region broke away in 1992 after a five-month war in which Russian forces (and Crimean Cossacks) intervened on the side of the separatists.",
        "No country, not even Russia, has recognised the self-declared Transnistrian Moldovan Republic, butthe “frozen conflict” has kept Moldova partitioned ever since. Now, many fear that last week’s explosions may herald a dangerous thaw.",
        "On Monday, government buildings in Tiraspol were hit by what appeared to be rocket-propelled grenades. In the following days, blasts hit a radio tower broadcasting in Russian, and shots were reportedly fired near a Russian arms depot.",
        "Separatist authorities in Tiraspol blamed the incidents on Ukrainian infiltrators. Kyiv has accused Russia of launching the attacks to further destabilise the region, while Moscow denounced them as “acts of terror”. Meanwhile, Moldova’s pro-EU president, Maia Sandu, blamed the blasts on infighting between rival factions in Transnistria.",
        "But the uncertainty has prompted growing concern that Moldova could be dragged into the Ukraine conflict.",
        "Moscow has long used Transnistria as a bargaining chip in its efforts to influence Moldova. The region still hosts 1,500 Russian troops, as well as 20,000 tonnes of ammunition stored in Cobasna, the largest ammunition depot in easternEurope. Among last week’s incidents were shootings a mile away from Cobasna, according to the Transnistrian authorities.",
        "Moldovan government sources fear that if the depot blew up it could result in an explosion 10 times bigger than the 2020 Beirut blast, where more than 2,000 tonnes of explosive material was stored.",
        "Despite its frail economy, Moldova has already received about 95,000 people fleeing the war in Ukraine, a figure equivalent to 3.5% of its population, according to the Moldovan foreign ministry.",
        "The events of the past week are prompting many refugees to consider fleeing once again. “If war comes to Transnistria, I will leave, probably for Germany,” said Lyuda, 35, an accountant and single mother who fled Mariupol in March and is now working for the UNHCR mission in Moldova.",
        "Security has been stepped up on the Transnistrian side of the border, causing long queues of traffic, but at the Moldovan checkpoints down the road, security forces simply wave vehicles through.",
        "Moldova’s government has pledged to step up security, but for now life goes on as usual in Chișinău. In Valea Morilor park, joggers make laps around the lake, anglers cast their lines and the loudest sound is the voice of a canoe coach training her students.",
        "Across the city, Chișinău’s central market is packed with people buying food and offerings for the upcoming Paștele Blajinilor, Moldova’s holiday commemorating the dead. But even here, there is an edge of uncertainty. Alex, a stallholder in the market had just come off a call with a cousin in Italy who he was thinking of joining, he said. “I have a wife and a baby, and I don’t feel safe here,” he said.",
        "Inside Transnistria, separatist authorities have kept quiet about the war raging in Ukraine. “Transnistria’s leaders are being cautious,” said the Moldovan journalist Alina Radu. “They are not cheering on the war, but nor are they criticising Russia’s military aggression.”",
        "Since the death of its Soviet-era industry, Transnistria’s economy has been dominated by a small elite. Russia provides Transnistria with free gas, which gives businesses in the region a competitive advantage over Moldovan businesses.",
        "Its largest conglomerate, which controls everything from petrol stations to a cognac distillery – and the football club FC Sheriff – was co-founded by the former KGB agent Victor Gușan, who alsohas a Ukrainian passport and owns property in Kyiv.",
        "“Transnistrian leaders are under a lot of pressure,” said the Moldovan journalist Alina Radu. “For the first time, they are isolated. Both Moldova and Ukraine have governments that are not pro-Russian. Transnistrian elites have two options: to follow the orders of Putin, the most terrible dictator today, or to have a prosperous future with Europe.”",
        "Analysts in Chișinău warn that Russian security and propaganda networks are spreading.",
        "A recentreportfrom the Royal United Services Institute, said Russian spy agency the FSB aimed “to destabilise Moldova to tie down Ukrainian forces on the southern border, to counter growing pro-European sentiment in the country, and to show the west that support for Ukraine risks wider consequences, including in the Balkans”.",
        "Valeriu Pașa, from the Moldovan thinktank Watchdog said that Moscow had overestimated vestigial pro-Moscow sentiment in the country.",
        "“Russia’s aim is to create tension,” he said, pointing to debunked viral reports that Romanian troops had been deployed near the border with Moldova.",
        "But Moldova, with a population of just 2.5 million, has already suffered from mass emigration, and such pressures still had the potential to cause more harm, said Radu. “I am afraid that the tension might generate yet another harmful wave of emigration – just as the government has been trying to bring back the diaspora.”",
        "This article was amended on 1 May 2022 to correctly refer to more than 2,000 tonnes of explosive material being involved in the 2020 Beirut blast, rather than 2,000 tonnes of ammunition."
      ],
      "url": "https://www.theguardian.com/world/2022/may/01/i-dont-feel-safe-here-transnistria-fears-could-spark-moldova-exodus",
      "scraped_at": "2025-11-14T14:42:01.580617",
      "paragraph_count": 27
    },
    {
      "title": "Transnistria appeals to Russia for ‘protection’, reviving fears for Moldova breakaway region",
      "content": [
        "US says it is closely watching situation in key region on Ukraine border after officials asked Moscow for help against the government in Moldova",
        "The US has said it is closely watching the situation in the breakaway Moldovan region of Transnistria, after pro-Russian officials in the territory appealed to Moscow for “protection”.",
        "Transnistria, which borders war-strickenUkraineto the east, has maintained autonomy from Moldova for three decades with support from Russia, which has more than a thousand troops stationed there since a brief war in 1992.",
        "Since Moscow began its full-scale assault on Ukraine, Chișinău has been concerned the Kremlin could use Transnistria to open a new front in the south-west, in the direction of Odesa.",
        "The request forRussiato help Transnistria’s economy withstand Moldovan “pressure” was made after a meeting of hundreds of officials in the unrecognised region.",
        "The resolution came a day before the Russian president, Vladimir Putin, on Thursday makes his annual address to Russian lawmakers and as Ukraine suffers setbacks on the battlefield. There are suggestions Putinmight bring up the Transnistrian request in his speech and express support for the region.",
        "Moldova’s pro-European government dismissed the appeal as a propaganda event to gain headlines.",
        "The region, long seen as a potential flashpoint with Russia in Europe, held a “congress of deputies of all levels” after Moldova said it would require Transnistrian companies to pay import duties to the central budget from January.",
        "At the meeting, the congress passed a resolution saying it would appeal to both houses of Russia’s parliament “with a request to implement measures to protect [Transnistria] in the face of increasing pressure from Moldova”.",
        "Russian officials responded by saying that one of its “priorities” was to protect the thin sliver of land, which has been de facto controlled by pro-Russian forces since the collapse of the Soviet Union but is internationally recognised as part of Moldova.",
        "US state department spokesperson Matthew Miller said on Wednesday: “Given Russia’s increasingly aggressive role in Europe, we are watching Russia’s actions in Transnistria and the broader situation there very closely.”",
        "After Russia’s full-scale invasion of Ukraine in 2022,tensions surged around the separatist region, which says it has 220,000 Russian citizens. Relations between Moldova and Russia have also frayed as the government in Chișinău has steered a pro-European course.",
        "Moldova’s president, Maia Sandu, in Albania for a summit of south-east European countries, said her country remained committed to a peaceful resolution of the Transnistrian conflict. “What the government is doing today is making small steps for the economic reintegration of the country,” she said.",
        "Polish prime minister Donald Tusk said tensions in Transnistria were dangerous for the region. The problem “is not a new one”, he said, adding that the “threat of Russian intervention or at least some provocation there is something permanent”.",
        "The call for help from Moscow has fuelled comparisons with February 2022, when Russian-backed militants in eastern Ukraine called for protection against what they said were relentless attacks and shelling by Kyiv’s forces.",
        "Russia and Agence France-Presse contributed to this report"
      ],
      "url": "https://www.theguardian.com/world/2024/feb/29/transnistria-moldova-breakaway-region-russia-protection-appeal",
      "scraped_at": "2025-11-14T14:42:02.087738",
      "paragraph_count": 16
    },
    {
      "title": "Fears grow over Moldova breakaway region being drawn into Ukraine war",
      "content": [
        "Senior Russian diplomat says Moscow is ‘concerned’ over string of explosions in Transnistria",
        "A Russian minister refused to rule out Moldova’s breakaway region Transnistria being drawn into theUkrainewar, in a potential escalation of the conflict to another European country.",
        "The deputy foreign minister, Andrey Rudenko, said on Tuesday said Moscow “was concerned” over the string of recent explosions in Transnistria, sayingRussia“would like to avoid a scenario” in which Transnistria would be dragged into the war.",
        "Speaking to journalists in Moscow, Rudenko said the “situation with the explosions” in the region indicated that “certain forces” behind the attacks were interested in creating “another hotbed of tension in Europe” – a reference to two episodes of violence reported in the enclave in as many days.",
        "“An investigation will be carried out accordingly, and we hope that the reasons will be established and those responsible will be punished,” RIA Novosti cited Rudenko as saying.",
        "Transnistria, which is controlled by pro-Russian separatists and permanently hosts 1,500 Russian troops as well as a large arms depot, borders western Ukraine.",
        "Rudenko’s statements came after Moldova’s president, Maia Sandu, convened a meeting of her security council on Tuesday following the two incidents.",
        "On Tuesday morning, local authorities said two antennas that carried Russian radio broadcasts were blown up, while on Monday unknown attackers shelled the region’s state security ministry in Tiraspol with a grenade launcher.",
        "After the security council meeting, Sandu said certain unnamed “forces inside Transnistria” were in “favour of war” and were interested in destabilising the situation in the region.",
        "Russian president Vladimir Putin’s spokesperson, Dmitry Peskov, earlier on Tuesday told journalists that he was “concerned” about the news that came out of Transnistria, while the leader of the self-proclaimed republic in Donetsk, Denis Pushilin, told the RIA Novosti that Moscow should “take into account what is happening in Transnistria” when planning the next stage of its military campaign.",
        "Last week, a senior Russian commander said the goal of Russia’s new offensive was to seize control of southern Ukraine and to gain access to Transnistria, first creating worries that the small east European country could become a new flashpoint in rising tensions between Moscow and the west.",
        "Commenting on the explosion at the security ministry, the Moldovan government said the blast had been aimed at “creating pretexts for straining the security situation” in the breakaway region.",
        "Officials in Transnistria on Tuesday announced a number of new security measures, further raising concerns about a possible escalation in the breakaway state. Measures included the instalment of military checkpoints at the entrances to the cities of the region and the cancellation of the annual 9 May victory day parade.",
        "Bob Deen, an expert on Moldova and a senior research fellow at the Clingendael Institute thinktank, said it was difficult to know whether the recent incidents were a false-flag operation by Russia or genuine acts of sabotage by anti-Russian groups.",
        "But he said recent Russian rhetoric pointed to some of the long-term goals Russia had in mind for Transnistria. “We have seen that the topic of Transnistria is becoming discussed more openly in the Russian public domain. Russian recent statements could be an indication of the ambitions Moscow has there.”",
        "According to Deen, it was unlikely that Russian forces would be able to stage an offensive toward the border with Moldova, given that Moscow was engaged in heavy fighting in the eastern Donbas region. To get to Transnistria, Moscow would need to stage an offensive toward Odesa, which has been hindered by the recent sinking of the Moskva cruiser, which forced Russian warships to move further away from Ukraine’s coast.",
        "Deen was also sceptical that Transnistria’s own forces, which number about 7,500 troops, would be used in an attack on Ukraine from its western border.",
        "“There is little appetite to fight in Ukraine among the Transnistrian troops as well as the general population in the region, many of whom are leaving towards Moldova to escape any potential violence.”",
        "“Similarly to Belarus, the region does not want to be fully dragged into this war,” he said, adding that the recent rhetoric by Moscow may be a ploy to get Ukraine to pull troops away from the Donbas towards its western border.",
        "With Russian backing, Transnistria fought a war against Moldova in the early 1990s that left the territory with de facto independence and a permanent Russian garrison. Russian state media – widely available in Transnistria – have played a significant role in cementing pro-Russian attitudes in the enclave as Moldova has shifted towards the west under the leadership of its liberal president.",
        "Last week, Sandu signed into law a bill banning the orange and black striped ribbons of Saint George, which enjoy wide popularity in Russia as a way to show public support for the government and the military, a move that angered Russian officials. In the same bill, Sandu banned the prowar signs “Z” and “V”, first used by the Russian armed forces."
      ],
      "url": "https://www.theguardian.com/world/2022/apr/26/moldova-holds-security-meeting-as-tensions-rise-over-breakaway-region-transnistria",
      "scraped_at": "2025-11-14T14:42:02.611833",
      "paragraph_count": 21
    },
    {
      "title": "Russian commander suggests plan is for permanent occupation of south Ukraine",
      "content": [
        "Rustam Minnekayev speaks of aim for land corridor to Crimea, despite Putin’s earlier claims",
        "A senior Russian military commander has said the goal of Russia’s new offensive is to seize control of southernUkraineand form a land bridge to Crimea, indicating that Russia plans a permanent occupation of Ukrainian territory taken in the war.",
        "Rustam Minnekayev, acting commander of the central military district, also told members of a defence industry forum on Friday that control over southern Ukraine would give Russia access to Transnistria, a pro-Russian breakaway region ofMoldova, indicating that Russia may attack the port city of Odesa or launch an economic blockade of the area.",
        "The remarks directly contradict earlier claims from Vladimir Putin thatRussiawas not planning to occupy Ukrainian cities permanently and suggests the Kremlin is changing tack after its failed offensive toward Kyiv, which appeared to seek regime change.",
        "The statement was the first by a high-ranking official about the Russian military’s goals to occupy territory as it manoeuvres for an anticipated “battle for Donbas” in Ukraine’s east.",
        "“Since the beginning of the second phase of the special operation … one of the tasks of the Russian army is to establish full control over Donbas and southern Ukraine. This will provide a land corridor to Crimea, as well as affecting vital objects of the Ukrainian economy, Black Sea ports through which agricultural and metallurgical products are supplied to [other] countries,” Minnekayev said on Friday at the annual meeting of the Union of Defence Industry Enterprises of Russia’s Sverdlovsk region.",
        "Crimea was annexed by Russia in 2014, a move not recognised by the international community.",
        "Russia’s campaign in southern Ukraine has been more successful than its attempts to take Kyiv from the north, although it has also met fierce resistance from Ukrainian troops. Russia has occupied the city of Kherson and has claimed near-total control of Mariupol, as it plans a pincer-style attack on Ukrainian forces in the eastern Donbas region.",
        "Volodymyr Zelenskiy hasaccused Russia of planning to “falsify” an independence referendumin the partly occupied southern regions of Kherson and Zaporizhzhia, telling Ukrainians there not to give personal information to occupying forces.",
        "Russia was planning “to falsify a so-called referendum on your land, if an order comes from Moscow to stage such a show. And this is the reality. Be careful,” Zelenskiy said.",
        "The Kremlin refused to answer questions about Minnekayev’s comments on Friday, saying the Russian defence ministry was responsible for the “special operation”, meaning Russia’s war in Ukraine.",
        "It is not clear if Minnekayev was revealing details about Russia’s formal plans for its offensive or expressing his personal views on the benefits of Russia’s military offensive.",
        "Minnekayev, the acting commander of one of Russia’s four military districts, also said that “control over southern Ukraine will give yet another point of access to Transnistria, where facts of oppression of the Russian-speaking population have also been observed”.",
        "“Apparently, we are now at war with the whole world,” Minnekayev said.",
        "If true, that could indicate Russia would seek to take Odesa, one of Ukraine’s largest cities, and seek to reinforce its positions in Transnistria, a Russian-controlled territory of Moldova that has hosted Russian troops since the fall of the Soviet Union.",
        "With Russian backing, Transnistria fought a war against Moldova in the 1990s that left the territory with de facto independence and a garrison of 1,500 Russian troops. The region is recognised as part of Moldova. The unrecognised state is strongly influenced internationally by nostalgia for the Soviet Union and its affinity for Russia, which is fostered by state propaganda.",
        "It is unlikely that Russian forces, which have sustained considerable losses in the early stages of the war, would be able to stage an offensive toward Odesa at the moment, much less the border with Moldova. Russian warships have been driven further from Ukraine’s coast after the Moskva cruiser, a Russian flagship,sank in the Black Sea last week. Ukraine claimed it had attacked the cruiser with anti-ship missiles.",
        "On Friday night the Russian defence ministry said one sailor had died and 27 were missing after the Moskva fire, with 396 others rescued.",
        "Analysts said that Minnekayev’s statement could mean Russia would target the economy of Odesa and the surrounding region rather than launch an attack on the city. Russian forces had already been driven back in a Ukrainian counteroffensive last month and may be close to exhaustion.",
        "“My interpretation of the recent statement by Minnekayev is that Russia intends to hold on to what they’ve taken in the south (largely assumed at this point), and try to pressure Ukraine over time on the economic front, including via blockade,” Michael Kofman, research program director in the Russia studies programme at CNA, a research and analysis organisation based in Arlington, Virginia, wrote on Twitter.",
        "“I am sceptical of any further major offensives beyond Donbas given losses and current force availability constraints,” he added."
      ],
      "url": "https://www.theguardian.com/world/2022/apr/22/ukraine-south-occupation-russian-military-chief-rustam-minnekayev",
      "scraped_at": "2025-11-14T14:42:02.908094",
      "paragraph_count": 21
    },
    {
      "title": "Russia’s war in Ukraine threatens to spill over in dangerous new phase",
      "content": [
        "Analysis:Mysterious explosions in Moldova raise possibility of new Putin gambit after early failures",
        "Aseries of mysterious explosions in Moldovahave raised the threat of Russia’s war in Ukraine spilling over into new territory, with unpredictable consequences.",
        "The blasts destroyed radio antennas in a Russian-garrisoned sliver of easternMoldovaalong the Ukrainian border, Transnistria, which had been peaceful since a brief conflict in 1992 waged by Kremlin-backed separatists against the Moldovan army.",
        "The separatist authorities blamed the incidents on Ukrainian infiltrators while the Kyiv government alleged they were false-flag attacks designed to provide a pretext for an infusion of Russian troops, to add to the 1,500 already based there, just as similar blasts in the Donbas preceded the 24 February Russian invasion ofUkraine.",
        "Those allegations were given greater weight when residents in Transnistria received fake SMS texts on Tuesday warning of an imminent Ukrainian attack. The Moldovan president, Maia Sandu, convened an emergency meeting of her security council and declared that forces were at play in Transnistria which were “interested in destabilising the region”.",
        "A Russian move into Transnistria would pose an imminent threat to the sovereignty of Moldova, a country of 2.6 million people which, like Ukraine, has shown increasing interest in joining Nato.",
        "It would also menace Odesa, the Ukrainian port city which lies on the Black Sea coast between Moldova and Russian-occupied Kherson.",
        "Four days ago the commander of Russia’s central military district,Rustam Minnekayev, said Moscow’s goals involved the seizure of southern Ukraine, so as to give Russia control over the Black Sea coast and access to Transnistria.",
        "On Tuesday, Nikolai Patrushev, the secretary of Russia’s security council and one of Vladimir Putin’s closest advisers, raised another grim specter, declaring that Ukraine could fragment into “several states”, blaming such an outcome on western intervention.",
        "The threat of dismemberment follows the humiliating failure of Putin’s primary war aim, to subjugate all of Ukraine and install a friendly government in Kyiv. The massive offensive launched in February was unable to break Ukrainian resistance while Moscow was unable to deter Nato support.",
        "Repeated Russian warnings, explicitly brandishing the world’s biggest nuclear arsenal, have had a diminishing impact.Finland and Sweden look set to declare their readiness to join Nato next monthin time for the alliance summit at the end of June, shrugging off suggestions from Moscow that such a move would lead to the westward deployment of Russian forces, including nuclear missiles.",
        "On Monday, the Russian foreign minister, Sergei Lavrov, tried amplifying the threat,accusing Nato of fighting a proxy war in Ukraineand warning that the danger of nuclear conflict “should not be underestimated.” But barely 12 hours later,Germany dropped its earlier escalatory reservations about supplying heavy weapons to Ukraine, and announced that it would be sending 50 Gepard self-propelled anti-aircraft guns.",
        "That announcement, by thedefence minister, Christine Lambrecht, was made at Tuesday’s meeting of approximately 40 countries at Ramstein airbase, to coordinate and enhance western military support for Kyiv that marked a raising of the stakes by Ukraine’s backers. Announcing the UK’s own contribution of anti-aircraft systems, defence minister James Heappey went further, saying it would be “entirely legitimate” for the weapons to be used against supply lines inside Russia.",
        "In response Russia has started bombing the supply lines bringing in western arms, targeting railways and bridges and threatening to hit Kyiv.",
        "As the Ukraine war evolves, the parties to the conflict are redefining their aims. Russia has abandoned outright conquest for now, and is seeking to carve out a contiguous zone of occupation reaching as far as Transnistria, which Putin can package as “Novorossiya”, the foundation for a new Russian empire.",
        "The Biden administration meanwhile has emphatically confirmed that its objectives go beyond the defence of Ukraine to the hobbling of Russia’s capacity to carry out further acts of aggression.",
        "“What we want to see is a free and independent Ukraine and at the end of the day, that will involve a weakened Russia and strengthened Nato,” the chairman of the joint chiefs of staff, Gen Mark Milley, told CNN,echoing remarks made by the defence secretary, Lloyd Austin, the day before.",
        "“What’s at stake here is much greater than Ukraine,” Milley added. “If Russia gets away with this cost-free, so goes the so-called international world order and we enter an area of serious instability.”",
        "With the start of this new phase in the war, a layer is being stripped away from the buffer that has thus far kept Nato and Russia from coming into direct, hostile contact, during the cold war and since. And if the ominous explosions in Transnistria are auguries of a new Putin gambit, Moldova could find itself to be the next proving ground where this dangerous new world makes itself felt."
      ],
      "url": "https://www.theguardian.com/world/2022/apr/26/russias-war-in-ukraine-threatens-to-spill-over-in-dangerous-new-phase",
      "scraped_at": "2025-11-14T14:42:03.317793",
      "paragraph_count": 19
    },
    {
      "title": "Moldova facing ‘dangerous moment’ amid fears it could be drawn into Ukraine war",
      "content": [
        "Government warns unnamed forces are stoking tensions in Russian-speaking breakaway region of Transnistria",
        "Moldova is facing “a very dangerous new moment”, the country’s deputy prime minister has said, as he warned that unnamed forces were seeking to stoke tensions after a series of explosions in the breakaway region of Transnistria this week.",
        "In a briefing with journalists, Nicu Popescu said his government had seen “a dangerous deterioration of the situation” in recent days, after grenade attacks on the “ministry of security” in the breakaway region of Transnistria on Monday. The attacks with rocket-propelled grenades represented “a very dangerous new moment in the history of our region,”, he said, adding that Moldova’s institutions had been put on high alert in response.",
        "Fears are growingthat Moldova and Transnistria could be drawn into the Ukraine conflict. The predominantly Russian-speaking region of Transnistria in eastern Moldova has been controlled by pro-Russia separatists since 1992 after a short war when Moscow intervened on the side of the rebels.",
        "Last week a senior Russian commander said gaining control over southern Ukraine would help Russia link up withTransnistria, which shares a 453km border with Ukraine. Then on Monday came a series of mysterious explosions targeting Transnistria’s “state security ministry”, a radio tower and military unit.",
        "“Our analysis so far shows that there are tensions between different forces within the region interested in destabilising the situation and that makes the Transnistrian region vulnerable and creates risks for the Republic of Moldova,” said Popescu, who added that a majority of Moldovans, including those in Transnistria, wanted to stay out of the war.",
        "Moldova’s government, which does not control Transnistria, was working through several hypotheses about the cause of the attacks, he said, adding that it could be a provocation or “the result of some tensions of some forces inside this region”. He added: “We cannot point exactly the finger or put the blame, but what we see is that indeed there are some forces inside the region that work towards the destabilisation of the situation inside this region.”",
        "According to Popescu, who is also Moldova’s foreign minister, Transnistrian authorities announced last week they were stopping all men of fighting age from leaving the region, which he described as a sign that “we are not yet out of the potential danger zone”.",
        "Moldova had received public and private assurances from Moscow “thatRussiacontinues to recognise the territorial integrity of Moldova”, he said, adding that “given the situation in the region, we remain very alert”.",
        "Russian foreign ministry spokesperson Maria Zakharova claimed on Thursday that recent incidents in Transnistria were an attempt to drag it into the conflict inUkraine.",
        "Transnistrian authorities have blamed Ukraine for the attacks, while Kyiv has pointed the finger at Russia, saying Moscow is seeking to destablise the region.",
        "One senior EU diplomat said the incidents were “clearly prepared by Russia themselves”, a view that was based on their analysis of the situation, rather than intelligence sources. “We don’t see that there will be an active conflict”, the diplomat said, “but you never know because they [Russia] have done crazy things”.",
        "One of Europe’s poorest countries, Moldova is grappling with a large influx of refugees and the economic fallout of the war that has stopped nearly 15% of its exports.",
        "About 95,000 people fleeing the war in Ukraine have arrived in Moldova, equivalent to 3.5% of the population, according to the Moldovan foreign ministry. While the number has stabilised and even decreased recently, the former Soviet country is still adapting to the new arrivals, with Ukrainian refugees now accounting for one in 10 of the child population in Moldova.",
        "The war is also having “major negative economic impacts”, Popescu said as up to 14% of Moldova’s exports, which had gone to Ukraine, Belarus and Russia, had “virtually stopped”. Inflation had shot up to 22% and the price of Moldova’s imports had gone up, as the nearby Ukrainian port ofOdesa– the cheapest way to transport many goods – was no longer available.",
        "Moldova is seeking economic support from the EU, as well as eventual membership of the bloc.",
        "The government in Chișinăufiled a membership application in Marchsoon after Ukraine launched its bid to join the EU, and is busy answering hundreds of questions from Brussels about its readiness to join.",
        "Last week, Moldova’s government announced it had submitted to Brussels an initial questionnaire answering 369 questions; it is now working through a second document covering 2,000 other queries on the country’s compatibility with EU law.",
        "“We are a country with a European history, a European identity,a European language– and our Romanian language is already an official language of the EU, so that makes things much easier,” Popescu said, adding that Moldova had proven it was adept at changing governments through democratic means.",
        "But even EU member states sympathetic to Moldova, Ukraine and Georgia’s membership bids say these countries are unlikely to join anytime soon."
      ],
      "url": "https://www.theguardian.com/world/2022/apr/28/moldova-facing-very-dangerous-moment-amid-fears-it-could-be-drawn-into-ukraine-war",
      "scraped_at": "2025-11-14T14:42:03.637284",
      "paragraph_count": 20
    },
    {
      "title": "Russia-Ukraine war: what we know on day 62 of the invasion",
      "content": [
        "Kremlin warns of immediate response unless UK stops ‘direct provocation’ after minister backs Ukrainian strikes on Russian soil",
        "Russia’s defence ministry warned of an immediate “proportional response” if Britain continued its “direct provocation”,after the UK armed forces minister, James Heappey, described Ukrainian strikes on Russian soil that hit supplies anddisrupted logistics as “completely legitimate”.",
        "​A Russian minister refused to rule out Moldova’s breakaway region,Transnistria, being drawn into the Ukraine war, in a potential escalation of the conflict to another European country. The deputy foreign minister, Andrey Rudenko, said on Tuesday that Moscow “was concerned” about the string of recent explosions in Transnistria, saying Russia “would like to avoid a scenario” in which Transnistria was dragged into the war.",
        "A Russian missile has hit a strategic bridge linking the southernOdesa regionwith neighbouring Romania, Ukrainian officials said.The strike on the bridge, across the Dniester estuary near the city of Odesa,has cut off the railway connection to areas of the Odesa regionwest of the estuary and Romania, the head of Ukraine’s railways said.",
        "TheUN secretary general,António Guterres, has travelled to Moscow in an attempt to put the UN at the heart of Ukrainian mediation efforts.In a joint press conference with Russia’s foreign minister, Guterres said the UN was “ready to fully mobilise its human and logistical resourcesto help save lives in Mariupol”. Ukraine’s deputy prime minister Iryna Vereschuk saidthere was “no point” in the UNif there was no real humanitarian corridor from Mariupol.",
        "During his joint press conference with Guterres,Russia’s foreign secretary, Sergei Lavrov, said Russia had dismissed Ukraine’s proposal to stage peace talks in the port city of Mariupol.Lavrov said it was too early to talk about who would mediate in any negotiations, buthe said Moscow was committed to a diplomatic solution via talks on Ukraine.",
        "The head of the UN’s atomic watchdog has condemned the Russian occupation of theChernobyl nuclear plant, describing the situation as “absolutely abnormal and very, very dangerous”.The International Atomic Energy Agency (IAEA) director general, Rafael Grossi,is heading an expert mission to Chernobylto “deliver equipment, conduct radiological assessments and restore safeguards monitoring systems”, the IAEA said.",
        "TheUS has vowed to move “heaven and earth” to help Ukraine win its battle against Russia’s invasion as it hosted defence talks in Germany with allies from 40 nations.The gathering is being led by the US defence secretary, Lloyd Austin, after his meeting with the Ukrainian president,Volodymyr Zelenskiy, on Sunday.",
        "Germany will authorise the delivery of anti-aircraft systems to Ukraine, the German defence minister,Christine Lambrecht, said at the meeting of defence ministers at theUS Ramsteinairbase.In aclear switch in Berlin’s cautious policy on military backingfor Kyiv, Lambrecht said the government had agreed to sign off the delivery of usedGepard anti-aircraft weapons systems."
      ],
      "url": "https://www.theguardian.com/world/2022/apr/26/russia-ukraine-war-what-we-know-on-day-62-of-the-invasion",
      "scraped_at": "2025-11-14T14:42:04.047306",
      "paragraph_count": 9
    },
    {
      "title": "Russia warns of an immediate ‘proportional response’ if Britain continues its ‘direct provocation’ of Ukraine – as it happened",
      "content": [
        "Details are scant, but there are reports that the ministry of internal affairs in Transnistria says thattwo radio antenna that relayed Russian radio have been destroyed in Transnistria, the breakaway eastern region of Moldova.",
        "Reuters quotes the ministry saying: “In the early morning of 26 April, two explosions occurred in the village of Maiac, Grigoriopol district: the first at 6.40 and the second at 7.05”",
        "No residents were injured, the ministry said.",
        "Nexta is carrying thisunverified imagethat purports to show the radio towers on the ground.",
        "A photo of the two most powerful towers of the radio center in#Transnistria, which used to broadcast#Russianradio which were knocked out.pic.twitter.com/QDJhDYYOWv",
        "Transnistria borders Ukraine, and a Russian military official has previously suggested that Russia taking control of the south of Ukrainewould provide a corridor to Transnistria, where a Russian garrison has been stationed since the 1990s."
      ],
      "url": "https://www.theguardian.com/world/live/2022/apr/26/russia-ukraine-war-ukraine-foreign-minister-says-moscow-senses-defeat-us-set-to-host-talks-in-germany-on-arming-kyiv-live?page=with:block-626797d98f088a33aff42300",
      "scraped_at": "2025-11-14T14:42:04.792719",
      "paragraph_count": 6
    },
    {
      "title": "Russian forces capture villages in push into eastern Ukraine",
      "content": [
        "Ukrainian army driven out of Velyka Komyshuvakha and Zavody, while concern grows over Transnistria",
        "Russian forces have captured several villages in eastern Ukraine in their offensive to fully control Donbas, Kyiv has said, while Moscow reported blasts on its side of the border and fears mounted that the war may spill over into neighbouringMoldova.",
        "The Ukrainian defence ministry said on Wednesday Russian forces had pushed Kyiv’s army out of Velyka Komyshuvakha and Zavody, in the north-eastern Kharkiv region, and gained control over Zarichne and Novotoshkivske in Donetsk.",
        "The Kremlin said this month it was pulling its forces out from around Kyiv to focus on capturing the self-proclaimed republics of Donetsk and Luhansk in Donbas, which have been controlled by pro-Russia separatists since 2014.",
        "A defiant Vladimir Putin vowed on Wednesday that Russia would achieve its military goals. “All the tasks of the special military operation we are conducting in the Donbas andUkraine, launched on 24 February, will be unconditionally fulfilled,” the Russian president told parliament in Moscow.",
        "Pavlo Kyrylenko, the governor of the Donetsk region of Donbas, said on the Telegram messaging app that Russian forces “continue to deliberately fire at civilians and to destroy critical infrastructure”.",
        "The interior ministry of Moldova’s pro-Russia breakaway region of Transnistria, which borders western Ukraine, said on Wednesday that shots were fired overnight from Ukrainian territory towards a village housing a large Russian ammunition depot.",
        "The ministry also said drones were observed over the village, and it claimed they too had been launched from Ukraine. Its statement came after aseries of explosions in the unrecognised regionthat authorities there referred to as terrorist attacks.",
        "Russia’s foreign ministry has refused to rule out Transnistria – occupied by Russian forces for decades – being drawn into the war, saying Moscow was “concerned” by the explosions targeting the state security ministry, a radio tower and military unit.",
        "It was not clear who was behind the blasts in Transnistria but the attacks gave rise tointernational alarmthat Moldova could be Russia’s next target, or that Moscow could try to use the breakaway region as another launching point to attack Ukraine.",
        "Ukraine’s deputy defence minister, Hanna Malyar, on Wednesday accused Russia of preparing to use Transnistria as a bridgehead, while president Volodymyr Zelenskiy claimed Russian “special services” were working to“destabilise the situation”. The UN and US have expressed alarm but have not yet backed Kyiv’s claim that Moscow was responsible for the incidents.",
        "Meanwhile, blasts were heard on Wednesday in three Russian provinces bordering Ukraine, reports said, and an ammunition depot near Staraya Nelidovka in Belgorod province caught fire. Russia earlier this month accused Ukraine of attacking a fuel depot in Belgorod but Kyiv has not confirmed responsibility for incidents reported on Russian territory.",
        "The Ukrainian presidential adviser Mykhailo Podolyak said it was natural that Russian regions where fuel and weapons were stored were learning about “demilitarisation” – a pointed reference to Moscow’s stated objective for the nine-week-old war in Ukraine, which it calls a special military operation to disarm and “denazify” its neighbour.",
        "“If you [Russians] decide to massively attack another country, massively kill everyone there, massively crush peaceful people with tanks, and use warehouses in your regions to enable the killings, then sooner or later the debts will have to be repaid,” Podolyak said. “Karma is a cruel thing.”",
        "Russia’s defence ministry said its Kalibr missiles had struck an arms depot in Ukraine’s southern-central Zaporizhzhia region storing “foreign weapons and ammunition supplied to Ukrainian troops by the US and European countries”.",
        "The ministry said Russia’s air force destroyed 59 Ukrainian military targets overnight. Petro Andryushchenko, an official in Mariupol, said Russian forces hit the Azovstal steel plant there, where about 2,000 Ukrainian fighters and 1,000 civilians are still holed up, with 35 airstrikes over 24 hours.",
        "Despite the collapse in ties between Russia and the west, Moscow and Washington carried out a prisoner swap on Wednesday. The US freed a Russian pilot, Konstantin Yaroshenko, who had been jailed on drug trafficking charges, while Russia released former US marine Trevor Reed, who was accused of fighting with police.",
        "Zelenskiy has been pleading for heavier firepower to push back the Russian advance in Donbas but western allies are wary of being drawn into an outright war with Russia.",
        "With Moscow’s potentially critical eastern offensive under way, however, Washington pledged on Tuesday to move “heaven and earth” to enable Ukraine to win. Germanyannounced on Tuesdayit would send self-propelled anti-aircraft guns to Ukraine, reversing its much-criticised cautious stance on heavy weapon supplies.",
        "The UN refugee agency UNHCR has said it expects more than 8 million Ukrainians to eventually flee their country, with nearly 5.3 million having already left, and that $1.85bn will be needed to host them in neighbouring countries."
      ],
      "url": "https://www.theguardian.com/world/2022/apr/27/russia-forces-capture-villages-eastern-ukraine-war",
      "scraped_at": "2025-11-14T14:42:05.245874",
      "paragraph_count": 20
    },
    {
      "title": "‘We’ll fight to the end.’ Ukraine defiant in face of  Vladimir Putin’s phoney war",
      "content": [
        "Kyiv’s middle-class professionals ready to take up arms again",
        "The mood last week inUkrainewas eerily calm, despite talk of war. The first winter snow blanketed Kyiv. Many were still celebrating Orthodox Christmas – which falls on 7 January – or had left town for the holidays. Bars and restaurants rang out with Dean Martin’s Let It Snow!, while the fir trees in Independence Square looked like a mini-Narnia.",
        "Sure, Russia might invade at any moment. But, as Ukrainians wearily point out, the country has already been at war for eight long years, ever since Vladimir Putin annexed Crimea and kickstarted a brutish conflict in the east of the country, which has claimed nearly 14,000 lives. Friday’sdawn cyber-attack on government websiteswas merely the latest in a series of hostile acts.",
        "What to do in the event of a military operation by Moscow, and whether to stay, flee or fight? The consensus – at least according to surveys – is that a third of the population is ready to take up arms. In the upmarket Podil district, with its art deco mansions, a new piece of graffiti read: “Biy Moskaliv!”(“Beat Up Russians!”)",
        "Sitting in a law office just across the road, Serhii Filimonov explains what he intends to do, should the Kremlin attack. “There are about 50 of us. We will meet and decide where we can best fight,” he said. His group is made up of middle-class professionals: IT staff, designers, actors, journalists. Filimonov runs a security business andstarred in a film shown at Venice.",
        "None of this is likely to alarm Russia’s defence ministry, which has sent 100,000 troops to Ukraine’s border. These include the existing front between the Ukrainian army and the Moscow-run separatist territories of Donetsk and Luhansk in the east, as well as Belarus in the north, Crimea in the south and the breakaway Russian enclave of Transnistria in the west.",
        "But the Kyiv creatives know how to shoot. All are combat-hardened veterans of the 2014 war. Filimonov took part in thebloody battle for Ilovaysk, when the Russian army trapped Ukrainian forces, and was wounded by an enemy mortar strike. After an operation to remove shrapnel, he returned to the front, serving as a volunteer against Moscow with the Azov battalion.",
        "“We have registered weapons. We will defend our homes,” Filimonov said. “Putin wants to go back to the borders of the Russian empire. You can see this in Belarus, Kazakhstan. Here in Ukraine he wants to create atsarstvo–a tsardom. This is a war of civilisations. It’s the west versus Eurasia, democracy against slavery and authoritarianism. We want democracy and freedom.”",
        "Most experts agree that Russia’s vastly superior army, air force and navy could quickly seize Ukrainian territory. But Andriy Zagorodnyuk, Kyiv’s former defence minister, says the Kremlin’s conscript-heavy military will immediately face resistance, should it try to occupy towns and cities. Volunteers such as Filimonov and small army groups will launch bloody partisan attacks. “There is definitely no panic. I don’t see any panic at all,” Zagorodnyuk told theObserver. He acknowledged Ukraine’s relative military weakness but he said Kyiv had around 500,000 soldiers including reservists. It was ready for guerrilla war “on a huge scale”, he said.",
        "Masi Nayyem, a lawyer who founded the Podil practice, admitted he was looking forward to shooting at Russians again. In 2016 he fought with a paratrooper brigade in Avdiyivka, Ukraine’sfrontline positionoutside rebel-held Donetsk. “In peace time you have to be serious, responsible. In war you don’t have any considerations or need to think about consequences. It’s black and white,” he said.",
        "Talks between Russia and the US, Nato and the Organization for Security and Co-operation in Europeended last week in a dead end. The Kremlin has demanded assurances from the Biden administration that Ukraine and Georgia will never join Nato. In essence it wants to overturn the post-cold war order – restoring central and eastern Europe as a zone of Warsaw Pact-style Russian influence, from which Nato troops and weaponry are banned.",
        "Beneath the Kremlin’s shrill, tough-man rhetoric lies a mystery. It is unclear why Putin is moving with such strategic haste, demanding that the US and its allies rewrite international security rules in Russia’s favour. His demands are “non-starters”, as the US’s negotiator and deputy secretary of state, Wendy Sherman, put it. Putin’s possible goal, she suggested, was to establish a pretext for war.",
        "Andrew Wilson, professor in Ukrainian studies at University College London, said the timing from the Kremlin’s perspective was opportune. Putin has jailed his chief domestic critic, Alexey Navalny, and squashed Navalny’s opposition movement. Russia was awash with cash, thanks to rising energy prices. On the international stage the Kremlin faces off against a US administration it regards as weak and indecisive.",
        "What could happen next? “Creating a crisis to create opportunities is what they [the Russians] do,” Wilson said. He added: “I don’t think a full-scale invasion is possibility number one. The Ukrainians have pretty successfully advertised the huge cost of invasion and occupation. But Putin has to have a win of sorts, either on European security or Ukraine itself.”",
        "All of which presents observers with a dilemma: how to report on a crisis which does not quite feel like a crisis, and appears largely to exist inside Putin’s head? It is evident that Russia’s president feels emotionally about Ukraine. Last summer he wrote a long essay stating that Ukraine and Russia were “one people”, divided by the whims of Bolshevik map-making and western meddling.",
        "“With nothing yet happening on the ground, there’s nothing I can report to tell you something new and impactful,” Nataliya Gumenyuk, a Ukrainian journalist and author admitted, saying it was hard to make sense of a conflict in which Ukraine often appears as a bystander. She added: “We are caught in the position of waiting for the ‘worst scenario’ without a chance to influence the outcome.”",
        "Gumenyuk said the Kremlin’s goal was to turn the clock back to the early 1970s, before the Soviet Union signed the Helsinki accords guaranteeing human rights – a mistake, in the eyes of Moscow’s current hawkish leadership. Others have argued that Putin’s preferred geo-political model goes back further, to the imperialist 19th century, when mighty great powers over-rolled lesser ones.",
        "In anopinion piece for theNew York Timesthe eminent Russian political scientist Lila Shevtsova said the current stand-off over Ukraine had little in common with the political deals struck at Yalta in 1945, or at the congress of Vienna in 1815. Back then, the participants stuck to the rules. “[Putin’s] aim, really, is a Hobbesian world order, built on disruption and readiness for surprise breakthroughs,” she wrote.",
        "How a surprise breakthrough might morph into war is a topic of conversation inside the Kyiv government of comic-turned-president Volodymyr Zelensky. Little was seen of him last week. Zelensky won a landslide victory in 2019 after campaigning on a platform of peace. Faced with Russian intransigence over the fate of Ukraine’s already occupied territories, he has moved towards Nato and the west.",
        "US intelligence agencies say the risk of invasion is “high”. Their Ukrainian counterparts think Moscow may be planning a “staged provocation”. This could take the form of an attack on Russian citizens – at the embassy or consulate perhaps – or against Russian soldiers in Transnistria. The Kremlin would blame the “attack” on far-right Ukrainian nationalists, with the incident used for propaganda and as acasus belli.",
        "Alex Kovzhun, a political strategist who advised Ukraine’s former prime minister Yulia Tymoshenko, said the Kremlin needed to craft a compelling narrative. “They are obsessed with their TV ratings. All of us Ukrainians are extras in their internal TV show. They are the protagonists. From time to time they change the bad guys. Ukraine is not their favourite location.”",
        "Kovzhun added: “A fantastic postmodern storytelling device is the wink. In 2014 Putin winked when he said there were no Russian units in Crimea. It’s a conspiracy. He invites all Russian TV viewers to share in this conspiracy. He used the wink in Salisbury. Everybody knew two Russian idiots travelled there to kill Sergei Skripal, as part of a special operation.”",
        "It is just possible, of course, that Putin’s brinkmanship is part of an elaborate bluff, the latest in a series of stress tests designed to reveal weaknesses among the west’s ruling class and America. No one – save for the man in the Kremlin – can really know. But Filimonov thinks a storm is coming. “We are convinced something will happen,” he said. “Putin needs Ukraine. An attempt to seize it is inescapable. We will fight until the end.”",
        "This is the archive of The Observer up until 21/04/2025. The Observer is now owned and operated by Tortoise Media."
      ],
      "url": "https://www.theguardian.com/world/2022/jan/15/well-fight-to-the-end-ukraine-defiant-in-face-of-vladimir-putins-phoney-war",
      "scraped_at": "2025-11-14T14:42:05.436052",
      "paragraph_count": 24
    }
  ]
}